// 名称申报的证件类型
const idcTypeList =[
  {"value":"001", "label": "身份证"},
  {"value":"002", "label": "军官证"},
  {"value":"003", "label": "警官证"},

  {"value":"004", "label": "外国(地区)护照"},	
  {"value":"006", "label": "港澳居民身份证"},
  {"value":"007", "label": "回乡证"},
  {"value":"008", "label": "台胞证"},
  {"value":"009", "label": "其他有效身份证件"},
  {"value":"010", "label": "台湾居民身份证"},
  {"value":"011", "label": "台湾居民来往大陆通行证"},
  {"value":"012", "label": "香港特别行政区护照"},
  {"value":"013", "label": "澳门特别行政区护照"},
  {"value":"014", "label": "澳门（永久性）居民身份证"},
  {"value":"015", "label": "港澳居民来往内地通行证"},
  {"value":"016", "label": "台湾农民身份有关证明"},
  {"value":"005", "label": "港澳台居民居住证"},

  {"value":"017", "label": "户口薄"},
  {"value":"011", "label": "企业法人营业执照"},
  {"value":"014", "label": "营业执照"},
  {"value":"061", "label": "事业法人登记证"},
  {"value":"062", "label": "社团法人登记证"},
  {"value":"999", "label": "其他"},
]






// 内资企业-股东证件类型列表
const idcType = [
	{id: '001', text: '身份证', value: '身份证'}
	// {id: '009', text: '其他有效身份证件', value: '其他有效身份证件'}, // 内资设立登记不支持
	// {id: '017', text: '户口薄', value: '户口薄'}// 内资设立登记不支持
]
// 外资企业-股东证件类型列表
const idcTypeForeign = [
  {id: '004', text: '外国(地区)护照', value: '外国(地区)护照'},
  {id: '006', text: '港澳居民身份证', value: '港澳居民身份证'},
  {id: '007', text: '回乡证', value: '回乡证'},
  {id: '008', text: '台胞证', value: '台胞证'},
  {id: '009', text: '其他有效身份证件', value: '其他有效身份证件'},
  {id: '010', text: '台湾居民身份证', value: '台湾居民身份证'},
  {id: '012', text: '香港特别行政区护照', value: '香港特别行政区护照'},
  {id: '013', text: '澳门特别行政区护照', value: '澳门特别行政区护照'},
  {id: '015', text: '港澳居民来往内地通行证', value: '港澳居民来往内地通行证'},
  {id: '016', text: '台湾农民身份有关证明', value: '台湾农民身份有关证明'},
  {id: '005', text: '港澳台居民居住证', value: '港澳台居民居住证'},
  // 刷新页面后增加类型
  // {id: '001', text: '身份证', value: '身份证'},
  // {id: '002', text: '军官证', value: '军官证'},
  // {id: '003', text: '警官证', value: '警官证'},
  // {id: '017', text: '户口薄', value: '户口薄'},
]
 // 法人股东证件类型
 const idcTypeList1 =  [
  {id: '011', value: '企业法人营业执照'},
  {id: '014', value: '营业执照'},
  {id: '061', value: '事业法人登记证'},
  {id: '062', value: '社团法人登记证'},
  {id: '999', value: '其他'}
]

// 国籍为中国时
const idcTypeList2 =  [{id: '001', text: '身份证', value: '身份证'}]
// 国籍为中国（香港）时
const idcTypeList3 =  [
  {id: '006', text: '港澳居民身份证', value: '港澳居民身份证'},
  {id: '009', text: '其他有效身份证件', value: '其他有效身份证件'},
  {id: '007', text: '回乡证', value: '回乡证'},
  {id: '012', text: '香港特别行政区护照', value: '香港特别行政区护照'},
  {id: '015', text: '港澳居民来往内地通行证', value: '港澳居民来往内地通行证'},
  {id: '005', text: '港澳台居民居住证', value: '港澳台居民居住证'}
]
// 国籍为中国（澳门）时
const idcTypeList4 =  [
  {id: '006', text: '港澳居民身份证', value: '港澳居民身份证'},
  {id: '009', text: '其他有效身份证件', value: '其他有效身份证件'},
  {id: '007', text: '回乡证', value: '回乡证'},
  {id: '013', text: '澳门特别行政区护照', value: '澳门特别行政区护照'},
  // {id: '014', text: '澳门（永久性）居民身份证', value: '澳门（永久性）居民身份证'}, // 名称申报不支持
  {id: '015', text: '港澳居民来往内地通行证', value: '港澳居民来往内地通行证'},
  {id: '005', text: '港澳台居民居住证', value: '港澳台居民居住证'}
]
// 国籍为中国（台湾）时
const idcTypeList5 =  [
  {id: '009', text: '其他有效身份证件', value: '其他有效身份证件'},
  {id: '008', text: '台胞证', value: '台胞证'},
  {id: '010', text: '台湾居民身份证', value: '台湾居民身份证'},
  //{id: '011', text: '台湾居民来往大陆通行证', value: '台湾居民来往大陆通行证'}, // 名称申报不支持
  {id: '016', text: '台湾农民身份有关证明', value: '台湾农民身份有关证明'},
  {id: '005', text: '港澳台居民居住证', value: '港澳台居民居住证'}
]

// 国籍为其他国家时
const idcTypeList6 =  [
  {id: '004', text: '外国(地区)护照', value: '外国(地区)护照'},
  {id: '009', text: '其他有效身份证件', value: '其他有效身份证件'}
]
