const arr = [{ "id": "004", "value": "安道尔" }, { "id": "007", "value": "奥地利" }, { "id": "006", "value": "澳大利亚" }, { "id": "002", "value": "阿尔巴尼亚" }, { "id": "003", "value": "阿尔及利亚" }, { "id": "062", "value": "爱尔兰" }, { "id": "001", "value": "阿富汗" }, { "id": "005", "value": "阿根廷" }, { "id": "193", "value": "安哥拉" }, { "id": "038", "value": "埃及" }, { "id": "190", "value": "阿拉伯联合酋长国" }, { "id": "220", "value": "阿鲁巴岛" }, { "id": "095", "value": "阿曼" }, { "id": "151", "value": "阿塞拜疆" }, { "id": "040", "value": "埃塞俄比亚" }, { "id": "153", "value": "爱沙尼亚" }, { "id": "219", "value": "安提瓜和巴布达" }, { "id": "010", "value": "巴巴多斯" }, { "id": "246", "value": "巴布亚新几内亚" }, { "id": "195", "value": "博茨瓦纳" }, { "id": "057", "value": "冰岛" }, { "id": "231", "value": "波多黎各" }, { "id": "187", "value": "不丹" }, { "id": "152", "value": "白俄罗斯" }, { "id": "178", "value": "巴哈马" }, { "id": "096", "value": "巴基斯坦" }, { "id": "017", "value": "保加利亚" }, { "id": "166", "value": "布基纳法索" }, { "id": "099", "value": "巴拉圭" }, { "id": "131", "value": "巴勒斯坦" }, { "id": "008", "value": "巴林" }, { "id": "011", "value": "比利时" }, { "id": "014", "value": "玻利维亚" }, { "id": "012", "value": "波兰" }, { "id": "221", "value": "伯利兹" }, { "id": "019", "value": "布隆迪" }, { "id": "013", "value": "百慕大群岛" }, { "id": "097", "value": "巴拿马" }, { "id": "194", "value": "贝宁" }, { "id": "222", "value": "博内尔" }, { "id": "218", "value": "波斯尼亚—黑塞哥维那" }, { "id": "015", "value": "巴西" }, { "id": "039", "value": "赤道几内亚" }, { "id": "188", "value": "朝鲜" }, { "id": "047", "value": "德国" }, { "id": "126", "value": "多哥" }, { "id": "034", "value": "丹麦" }, { "id": "224", "value": "多米尼加" }, { "id": "036", "value": "多米尼克" }, { "id": "037", "value": "厄瓜多尔" }, { "id": "214", "value": "俄罗斯联邦" }, { "id": "211", "value": "厄立特里亚" }, { "id": "197", "value": "佛得角" }, { "id": "043", "value": "法国" }, { "id": "240", "value": "斐济" }, { "id": "101", "value": "菲律宾" }, { "id": "042", "value": "芬兰" }, { "id": "225", "value": "法属圭亚那" }, { "id": "241", "value": "盖比群岛" }, { "id": "045", "value": "冈比亚" }, { "id": "031", "value": "古巴" }, { "id": "227", "value": "瓜德罗普岛" }, { "id": "029", "value": "刚果" }, { "id": "208", "value": "刚果民主共和国" }, { "id": "027", "value": "哥伦比亚" }, { "id": "154", "value": "格鲁吉亚" }, { "id": "030", "value": "哥斯达黎加" }, { "id": "228", "value": "海地" }, { "id": "055", "value": "洪都拉斯" }, { "id": "046", "value": "韩国" }, { "id": "089", "value": "荷兰" }, { "id": "156", "value": "哈萨克斯坦" }, { "id": "035", "value": "吉布提" }, { "id": "209", "value": "津巴布韦" }, { "id": "192", "value": "吉尔吉斯斯坦" }, { "id": "149", "value": "捷克" }, { "id": "252", "value": "基里巴斯" }, { "id": "052", "value": "几内亚" }, { "id": "053", "value": "几内亚比绍" }, { "id": "022", "value": "加拿大" }, { "id": "196", "value": "加那利群岛" }, { "id": "048", "value": "加纳" }, { "id": "044", "value": "加蓬" }, { "id": "020", "value": "柬埔寨" }, { "id": "179", "value": "库克群岛" }, { "id": "226", "value": "格林纳达" }, { "id": "239", "value": "格陵兰" }, { "id": "215", "value": "克罗地亚" }, { "id": "223", "value": "库腊索岛" }, { "id": "021", "value": "喀麦隆" }, { "id": "024", "value": "开曼群岛" }, { "id": "200", "value": "科摩罗" }, { "id": "068", "value": "肯尼亚" }, { "id": "104", "value": "卡塔尔" }, { "id": "202", "value": "科特迪瓦共和国" }, { "id": "070", "value": "科威特" }, { "id": "071", "value": "黎巴嫩" }, { "id": "072", "value": "利比里亚" }, { "id": "073", "value": "利比亚" }, { "id": "106", "value": "罗马尼亚" }, { "id": "205", "value": "留尼汪" }, { "id": "169", "value": "莱索托" }, { "id": "075", "value": "卢森堡" }, { "id": "157", "value": "拉脱维亚" }, { "id": "168", "value": "老挝" }, { "id": "158", "value": "立陶宛" }, { "id": "107", "value": "卢旺达" }, { "id": "074", "value": "列支敦士登" }, { "id": "076", "value": "马达加斯加" }, { "id": "018", "value": "缅甸" }, { "id": "212", "value": "马耳他" }, { "id": "189", "value": "马尔代夫" }, { "id": "159", "value": "摩尔多瓦" }, { "id": "134", "value": "美国" }, { "id": "085", "value": "蒙古" }, { "id": "009", "value": "孟加拉国" }, { "id": "242", "value": "马克萨斯群岛" }, { "id": "254", "value": "密克罗尼西亚联邦" }, { "id": "203", "value": "马拉维" }, { "id": "077", "value": "马来西亚" }, { "id": "078", "value": "马里" }, { "id": "081", "value": "毛里求斯" }, { "id": "080", "value": "毛里塔尼亚" }, { "id": "210", "value": "梅利利亚" }, { "id": "100", "value": "秘鲁" }, { "id": "086", "value": "摩洛哥" }, { "id": "084", "value": "摩纳哥" }, { "id": "217", "value": "马其顿共和国" }, { "id": "255", "value": "马绍尔群岛共和国" }, { "id": "087", "value": "莫桑比克" }, { "id": "229", "value": "马提尼克岛" }, { "id": "230", "value": "蒙特塞拉特" }, { "id": "082", "value": "墨西哥" }, { "id": "173", "value": "南非" }, { "id": "245", "value": "诺福克岛" }, { "id": "092", "value": "尼加拉瓜" }, { "id": "243", "value": "瑙鲁" }, { "id": "204", "value": "纳米比亚" }, { "id": "088", "value": "尼泊尔" }, { "id": "083", "value": "尼日尔" }, { "id": "093", "value": "尼日利亚" }, { "id": "143", "value": "南斯拉夫" }, { "id": "094", "value": "挪威" }, { "id": "256", "value": "帕劳共和国" }, { "id": "103", "value": "葡萄牙" }, { "id": "185", "value": "其它" }, { "id": "066", "value": "日本" }, { "id": "121", "value": "瑞典" }, { "id": "122", "value": "瑞士" }, { "id": "232", "value": "萨巴" }, { "id": "206", "value": "圣多美和普林西比" }, { "id": "119", "value": "苏丹" }, { "id": "108", "value": "萨尔瓦多" }, { "id": "247", "value": "社会群岛" }, { "id": "113", "value": "塞拉利昂" }, { "id": "233", "value": "圣卢西亚" }, { "id": "118", "value": "斯里兰卡" }, { "id": "216", "value": "斯洛伐克" }, { "id": "172", "value": "斯洛文尼亚" }, { "id": "120", "value": "苏里南" }, { "id": "248", "value": "所罗门群岛" }, { "id": "251", "value": "萨摩亚" }, { "id": "234", "value": "圣马丁岛" }, { "id": "213", "value": "圣马力诺" }, { "id": "116", "value": "索马里" }, { "id": "111", "value": "塞内加尔" }, { "id": "199", "value": "塞卜泰(休达)" }, { "id": "032", "value": "塞浦路斯" }, { "id": "238", "value": "圣其茨—尼维斯" }, { "id": "112", "value": "塞舌尔" }, { "id": "109", "value": "沙特阿拉伯" }, { "id": "235", "value": "圣文森特和格林纳丁斯" }, { "id": "174", "value": "斯威士兰" }, { "id": "249", "value": "土阿莫土群岛" }, { "id": "250", "value": "土布艾群岛" }, { "id": "129", "value": "土耳其" }, { "id": "125", "value": "泰国" }, { "id": "161", "value": "塔吉克斯坦" }, { "id": "175", "value": "汤加" }, { "id": "236", "value": "特克斯和凯科斯群岛" }, { "id": "162", "value": "土库曼斯坦" }, { "id": "127", "value": "特立尼达和多巴哥" }, { "id": "128", "value": "突尼斯" }, { "id": "124", "value": "坦桑尼亚" }, { "id": "253", "value": "图瓦卢" }, { "id": "051", "value": "危地马拉" }, { "id": "130", "value": "乌干达" }, { "id": "163", "value": "乌克兰" }, { "id": "016", "value": "文莱" }, { "id": "136", "value": "乌拉圭" }, { "id": "137", "value": "瓦努阿图" }, { "id": "138", "value": "委内瑞拉" }, { "id": "164", "value": "乌兹别克斯坦" }, { "id": "117", "value": "西班牙" }, { "id": "114", "value": "新加坡" }, { "id": "244", "value": "新喀里多尼亚" }, { "id": "050", "value": "希腊" }, { "id": "123", "value": "叙利亚" }, { "id": "207", "value": "西撒哈拉" }, { "id": "091", "value": "新西兰" }, { "id": "056", "value": "匈牙利" }, { "id": "063", "value": "意大利" }, { "id": "058", "value": "印度" }, { "id": "059", "value": "印度尼西亚" }, { "id": "067", "value": "约旦" }, { "id": "133", "value": "英国" }, { "id": "061", "value": "伊拉克" }, { "id": "060", "value": "伊朗" }, { "id": "065", "value": "牙买加" }, { "id": "150", "value": "亚美尼亚" }, { "id": "191", "value": "也门共和国" }, { "id": "139", "value": "越南" }, { "id": "167", "value": "以色列" }, { "id": "237", "value": "英属维尔京群岛" }, { "id": "145", "value": "赞比亚" }, { "id": "049", "value": "直布罗陀" }, { "id": "025", "value": "乍得" }, { "id": "198", "value": "中非" }, { "value": "186", "value": "中国" }, { "id": "147", "value": "中国（澳门）" }, { "id": "148", "value": "中国（台湾）" }, { "id": "146", "value": "中国（香港）" }, { "id": "026", "value": "智利" }]
// 名称申报的证件类型
const idcTypeList =[
  {"value":"001", "label": "身份证"},
  {"value":"002", "label": "军官证"},
  {"value":"003", "label": "警官证"},

  {"value":"004", "label": "外国(地区)护照"},	
  {"value":"006", "label": "港澳居民身份证"},
  {"value":"007", "label": "回乡证"},
  {"value":"008", "label": "台胞证"},
  {"value":"009", "label": "其他有效身份证件"},
  {"value":"010", "label": "台湾居民身份证"},
  {"value":"011", "label": "台湾居民来往大陆通行证"},
  {"value":"012", "label": "香港特别行政区护照"},
  {"value":"013", "label": "澳门特别行政区护照"},
  {"value":"014", "label": "澳门（永久性）居民身份证"},
  {"value":"015", "label": "港澳居民来往内地通行证"},
  {"value":"016", "label": "台湾农民身份有关证明"},
  {"value":"005", "label": "港澳台居民居住证"},

  {"value":"017", "label": "户口薄"},
  {"value":"011", "label": "企业法人营业执照"},
  {"value":"014", "label": "营业执照"},
  {"value":"061", "label": "事业法人登记证"},
  {"value":"062", "label": "社团法人登记证"},
  {"value":"999", "label": "其他"},
]






// 内资企业-股东证件类型列表
const idcType = [
	{id: '001', text: '身份证', value: '身份证'}
	// {id: '009', text: '其他有效身份证件', value: '其他有效身份证件'}, // 内资设立登记不支持
	// {id: '017', text: '户口薄', value: '户口薄'}// 内资设立登记不支持
]
// 外资企业-股东证件类型列表
const idcTypeForeign = [
  {id: '004', text: '外国(地区)护照', value: '外国(地区)护照'},
  {id: '006', text: '港澳居民身份证', value: '港澳居民身份证'},
  {id: '007', text: '回乡证', value: '回乡证'},
  {id: '008', text: '台胞证', value: '台胞证'},
  {id: '009', text: '其他有效身份证件', value: '其他有效身份证件'},
  {id: '010', text: '台湾居民身份证', value: '台湾居民身份证'},
  {id: '012', text: '香港特别行政区护照', value: '香港特别行政区护照'},
  {id: '013', text: '澳门特别行政区护照', value: '澳门特别行政区护照'},
  {id: '015', text: '港澳居民来往内地通行证', value: '港澳居民来往内地通行证'},
  {id: '016', text: '台湾农民身份有关证明', value: '台湾农民身份有关证明'},
  {id: '005', text: '港澳台居民居住证', value: '港澳台居民居住证'},
  // 刷新页面后增加类型
  // {id: '001', text: '身份证', value: '身份证'},
  // {id: '002', text: '军官证', value: '军官证'},
  // {id: '003', text: '警官证', value: '警官证'},
  // {id: '017', text: '户口薄', value: '户口薄'},
]
 // 法人股东证件类型
 const idcTypeList2 =  [
  {id: '011', value: '企业法人营业执照'},
  {id: '014', value: '营业执照'},
  {id: '061', value: '事业法人登记证'},
  {id: '062', value: '社团法人登记证'},
  {id: '999', value: '其他'}
]

// 国籍为中国时
const idcTypeList2 =  [{id: '001', text: '身份证', value: '身份证'}]
// 国籍为中国（香港）时
const idcTypeList3 =  [
  {id: '006', text: '港澳居民身份证', value: '港澳居民身份证'},
  {id: '009', text: '其他有效身份证件', value: '其他有效身份证件'},
  {id: '007', text: '回乡证', value: '回乡证'},
  {id: '012', text: '香港特别行政区护照', value: '香港特别行政区护照'},
  {id: '015', text: '港澳居民来往内地通行证', value: '港澳居民来往内地通行证'},
  {id: '005', text: '港澳台居民居住证', value: '港澳台居民居住证'}
]
// 国籍为中国（澳门）时
const idcTypeList4 =  [
  {id: '006', text: '港澳居民身份证', value: '港澳居民身份证'},
  {id: '009', text: '其他有效身份证件', value: '其他有效身份证件'},
  {id: '007', text: '回乡证', value: '回乡证'},
  {id: '013', text: '澳门特别行政区护照', value: '澳门特别行政区护照'},
  // {id: '014', text: '澳门（永久性）居民身份证', value: '澳门（永久性）居民身份证'}, // 名称申报不支持
  {id: '015', text: '港澳居民来往内地通行证', value: '港澳居民来往内地通行证'},
  {id: '005', text: '港澳台居民居住证', value: '港澳台居民居住证'}
]
// 国籍为中国（台湾）时
const idcTypeList5 =  [
  {id: '009', text: '其他有效身份证件', value: '其他有效身份证件'},
  {id: '008', text: '台胞证', value: '台胞证'},
  {id: '010', text: '台湾居民身份证', value: '台湾居民身份证'},
  //{id: '011', text: '台湾居民来往大陆通行证', value: '台湾居民来往大陆通行证'}, // 名称申报不支持
  {id: '016', text: '台湾农民身份有关证明', value: '台湾农民身份有关证明'},
  {id: '005', text: '港澳台居民居住证', value: '港澳台居民居住证'}
]

// 国籍为其他国家时
const idcTypeList5 =  [
  {id: '004', text: '外国(地区)护照', value: '外国(地区)护照'},
  {id: '009', text: '其他有效身份证件', value: '其他有效身份证件'}
]
