let P0 = {
  "P018C": [
    {
      "scope": "所有汽车制造商",
      "code": "P018C",
      "zh-cn": "燃油压力传感器B电路低",
      "en-us": "Fuel Pressure Sensor B Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。电子控制单元（ECU）持续监测燃油压力传感器信号电压。如果这个电压在设定时间段里低于最低校准值，则该故障码会出现。"
    }
  ],
  "P013A": [
    {
      "scope": "所有汽车制造商",
      "code": "P013A",
      "zh-cn": "氧传感器慢响应 - （空燃比）浓到稀 （第1排，传感器 2）",
      "en-us": "O2 Sensor Slow Response - Rich to Lean (Bank 1, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。如果电子控制单元（ECU）发现在空燃比由浓变稀的过程中，没有监测到可以接受的氧传感器信号电压变化速率，该故障码就会出现。"
    }
  ],
  "P0823": [
    {
      "scope": "所有汽车制造商",
      "code": "P0823",
      "zh-cn": "变速杆X位置传感器电路间歇",
      "en-us": "Gear Lever X Position Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0333": [
    {
      "scope": "所有汽车制造商",
      "code": "P0333",
      "zh-cn": "爆震传感器2电路高（第2排）",
      "en-us": "Knock Sensor 2 Circuit High (Bank 2)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压高于校准的最高值，该故障码会出现。故障原因包括爆震传感器电路故障，爆震传感器松动，爆震传感器本身故障，所用燃油油号不正确，发动机的模部件松动，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P009B": [
    {
      "scope": "所有汽车制造商",
      "code": "P009B",
      "zh-cn": "燃油压力释放控制电路/开路",
      "en-us": "Fuel Pressure Relief Control Circuit/Open",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油系统过压释放阀的作用是在燃油管路因为滤清器太脏，管路阻塞等引起管路压力过大时，释放燃油管路压力。如果燃油压力释放控制电路出错，该故障码会出现。"
    }
  ],
  "P0B91": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B91",
      "zh-cn": "混合动力电池电压监控R电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense R Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0785": [
    {
      "scope": "所有汽车制造商",
      "code": "P0785",
      "zh-cn": "换档正时电磁阀A",
      "en-us": "Shift Timing Solenoid A",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0B1F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B1F",
      "zh-cn": "混合动力电池组电压监控D电路范围/性能",
      "en-us": "Hybrid Battery Pack Voltage Sense D Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0707": [
    {
      "scope": "所有汽车制造商",
      "code": "P0707",
      "zh-cn": "变速器档位传感器A电路低 （PRNDL输入）",
      "en-us": "Transmission Range Sensor A Circuit Low",
      "sys": "变速箱",
      "knowledge": "变速器挡位传感器负责将变速器杆的位置（PRNDL）以电信号的形式输送给电子控制单元（ECU）。如果ECU检测到变速器档位（TR）传感器电路在超过设定的时间段里电压低于校准最低值,该故障码会出现。故障原因包括变速器挡位（TR）传感器，其电路断路或短路到接地，接头故障，或电子控制模块（PCM或ECM）故障。"
    }
  ],
  "P0B66": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B66",
      "zh-cn": "混合动力电池电压监控I电路高",
      "en-us": "Hybrid Battery Voltage Sense I Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0318": [
    {
      "scope": "所有汽车制造商",
      "code": "P0318",
      "zh-cn": "恶劣路况传感器A信号电路",
      "en-us": "Rough Road Sensor A Signal Circuit",
      "sys": "点火系统",
      "knowledge": "电子控制模块通过监控曲轴旋转速度的变化来检测气缸失火。但恶劣路况导致的轮速变化也可能导致曲轴转速的变化，从而影响气缸失火的探测。防抱死刹车（ABS）和牵引力控制（TCS）系统可以通过轮速传感器的信号判断车辆是否在恶劣路况行驶。如果系统检测到严重的影响到失火探测的恶劣路况，便会通知电子控制模块关闭失火检测,以防止记录错误的故障信息。恶劣路况传感器信号一般是一个从ABS（防抱死刹车）系统/驱动防滑牵引力控制（TCS）系统的控制模块传递给动力总成控制模块（PCM）的方波。"
    }
  ],
  "P0993": [
    {
      "scope": "所有汽车制造商",
      "code": "P0993",
      "zh-cn": "变速器液压传感器/开关F电路范围/性能",
      "en-us": "Transmission Fluid Pressure Sensor/Switch F Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0528": [
    {
      "scope": "所有汽车制造商",
      "code": "P0528",
      "zh-cn": "风扇速度传感器电路没有信号",
      "en-us": "Fan Speed Sensor Circuit No Signal",
      "sys": "车速及怠速控制",
      "knowledge": "故障原因包括风扇速度传感器，其电路，接头，风扇电机机械故障，或电子控制单元（ECU）等。"
    }
  ],
  "P0032": [
    {
      "scope": "所有汽车制造商",
      "code": "P0032",
      "zh-cn": "热氧传感器加热器控制电路高 （第1排，传感器1）",
      "en-us": "HO2S Heater Control Circuit High (Bank 1, Sensor 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）通过控制氧传感器加热器的开/关来保持氧传感器780oC的温度。如果加热器的控制电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0038": [
    {
      "scope": "所有汽车制造商",
      "code": "P0038",
      "zh-cn": "热氧传感器加热器控制电路高 （第1排传感器 2）",
      "en-us": "HO2S Heater Control Circuit High (Bank 1, Sensor 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）通过控制氧传感器加热器的开/关来保持氧传感器780oC的温度。如果加热器的控制电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0A81": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A81",
      "zh-cn": "混合动力电池组冷却风扇1控制电路/开路",
      "en-us": "Hybrid Battery Pack Cooling Fan 1 Control Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": "电池组风扇电机控制器负责调节混合动力电池组冷却风扇的电压。如果冷却风扇1控制电路电压超出了目标电压的正常范围，该故障码会出现。"
    }
  ],
  "P0B54": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B54",
      "zh-cn": "混合动力电池电压监控F电路",
      "en-us": "Hybrid Battery Voltage Sense F Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0BFA": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BFA",
      "zh-cn": "驱动电机B，W相电流传感器电路范围/性能",
      "en-us": "Drive Motor B Phase W Current Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P069F": [
    {
      "scope": "所有汽车制造商",
      "code": "P069F",
      "zh-cn": "节气门执行器控制灯控制电路",
      "en-us": "Throttle Actuator Control Lamp Control Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。节气门执行器是一个步进电机，它负责按照节气门控制模块的指令来控制节气门的开度。"
    }
  ],
  "P0467": [
    {
      "scope": "所有汽车制造商",
      "code": "P0467",
      "zh-cn": "蒸发排放系统吹扫流量传感器电路低",
      "en-us": "EVAP Purge Flow Sensor Circuit Low",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。电子控制单元（ECU）检测到蒸发排放系统（EVAP）吹扫流量传感器信号电压低于校准的最低值。"
    }
  ],
  "P070D": [
    {
      "scope": "所有汽车制造商",
      "code": "P070D",
      "zh-cn": "变速器液位传感器电路高",
      "en-us": "Transmission Fluid Level Sensor Circuit High",
      "sys": "变速箱",
      "knowledge": "变速器液位传感器的作用是将变速器液液面以电信号的形式输送给电子控制单元（ECU）。该故障码表明变速器液位传感器信号电路电压高于校准的最高值。故障原因包括变速器液位传感器，电路，接头，或ECU。"
    }
  ],
  "P02F9": [
    {
      "scope": "所有汽车制造商",
      "code": "P02F9",
      "zh-cn": "喷油器电路范围/性能 - 气缸12",
      "en-us": "Cylinder 12 Injector Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第12缸喷油器电路出错，该故障码会出现。"
    }
  ],
  "P043A": [
    {
      "scope": "所有汽车制造商",
      "code": "P043A",
      "zh-cn": "催化转换器温度传感器电路 （第2排，传感器2）",
      "en-us": "Catalyst Temperature Sensor Circuit (Bank 2, Sensor 2)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器温度传感器电路发生故障。故障原因包括催化转换器温度传感器，其电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P024D": [
    {
      "scope": "所有汽车制造商",
      "code": "P024D",
      "zh-cn": "增压空气冷却器旁通阀位置传感器A电路范围/性能",
      "en-us": "Charge Air Cooler Bypass Position Sensor A Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。增压空气冷却器旁通阀的作用是将一部分空气绕开空气冷却器。这些空气随后再跟经过空气冷却器冷却过的空气混合后进入发动机，以保证进气温度高于露水温度。如果空气冷却器旁通阀位置传感器A电路电压出错，该故障码会出现。"
    }
  ],
  "P0ACD": [
    {
      "scope": "所有汽车制造商",
      "code": "P0ACD",
      "zh-cn": "混合动力电池温度传感器C电路高",
      "en-us": "Hybrid Battery Temperature Sensor C Circuit High",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0A3B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A3B",
      "zh-cn": "发电机温度过高",
      "en-us": "Generator Over Temperature",
      "sys": "混合动力系统",
      "knowledge": "发电机处于温度过高状态。"
    }
  ],
  "P067A": [
    {
      "scope": "所有汽车制造商",
      "code": "P067A",
      "zh-cn": "气缸4电热塞控制电路低",
      "en-us": "Cylinder 4 Glow Plug Control Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸4电热塞电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0A2D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A2D",
      "zh-cn": "驱动电机A温度传感器电路高",
      "en-us": "Drive Motor A Temperature Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "驱动电机A温度传感器电路发生故障。故障原因包括电路，接头，电子控制单元，驱动电机等。有些车辆的驱动电机温度传感器跟驱动电机是一体的。所以，如果确定是该温度传感器本身的问题，有可能需要换掉整个驱动电机。"
    }
  ],
  "P0326": [
    {
      "scope": "所有汽车制造商",
      "code": "P0326",
      "zh-cn": "爆震传感器1电路范围/性能（第1排或 单个传感器）",
      "en-us": "Knock Sensor 1 Circuit Range/Performance (Bank 1 or Single Sensor)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压出错，该故障码会出现。故障原因包括爆震传感器电路，接头，其本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0A77": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A77",
      "zh-cn": "发电机W相电流高",
      "en-us": "Generator Phase W Current High",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控发电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0A95": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A95",
      "zh-cn": "高压保险丝",
      "en-us": "High Voltage Fuse",
      "sys": "混合动力系统",
      "knowledge": "在联锁开关是开的情况下，VBB9和VBB10端子之间电压低于正常值。"
    }
  ],
  "P00B2": [
    {
      "scope": "所有汽车制造商",
      "code": "P00B2",
      "zh-cn": "（水箱）散热器冷却液温度传感器电路范围/性能",
      "en-us": "Radiator Coolant Temperature Sensor Circuit Range/Performance",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "（水箱）散热器冷却液温度传感器采用热敏电阻的原理将散热器温度信号以电压的形式传输到电子控制单元（ECU）。如果ECU检测到（水箱）散热器冷却液温度传感器信号电压出错，该故障码会出现。"
    }
  ],
  "P054A": [
    {
      "scope": "所有汽车制造商",
      "code": "P054A",
      "zh-cn": "冷车启动B凸轮轴位置正时过度超前 （第1排）",
      "en-us": "Cold Start B Camshaft Position Timing Over-Advanced (Bank 1)",
      "sys": "车速及怠速控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。冷车启动时，如果电子控制单元（ECU）检测到B（排气/右/后）凸轮轴正时超过最大设定值，或者一直处于超前状态，则该故障码会出现。"
    }
  ],
  "P060D": [
    {
      "scope": "所有汽车制造商",
      "code": "P060D",
      "zh-cn": "内部控制模块加速踏板位置（APP）性能",
      "en-us": "Internal Control Module Accelerator Pedal Position Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。"
    }
  ],
  "P0106": [
    {
      "scope": "所有汽车制造商",
      "code": "P0106",
      "zh-cn": "歧管绝对压力（传感器）/大气压力（传感器）电路范围/性能",
      "en-us": "Manifold Absolute Pressure/Barometric Pressure Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "歧管绝对压力（MAP）传感器的作用是测量进气歧管内的压力（真空度）。动力总成控制模块（PCM）然后会将进气歧管压力与大气压力之间的差值（跟发动机负荷成线性关系）作为确定喷油器基本喷油量的一个依据，以帮助发动机在不同负荷下达到最佳空燃比。大气压力传感器（有时候也叫高海拔补偿器，HAC）的作用是将大气压力以电信号的形式输送给电子控制模块。大气压力会随天气和海拔高度的变化而变化。压力越小，空气越稀薄。动力总成控制模块（PCM）会根据大气压力的数值来修正燃油供给，以帮助发动机达到最佳空燃比。如果电子控制单元（ECU）检测歧管绝对压力（MAP）传感器/气压传感器信号电压超出校准的正常范围，该故障码会出现。故障原因包括MAP传感器电路，接头或传感器本身故障；大气压力（BARO）传感器电路，接头或传感器本身故障；或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P07B0": [
    {
      "scope": "所有汽车制造商",
      "code": "P07B0",
      "zh-cn": "变速器摩擦衬片H性能/卡在关的位置",
      "en-us": "Transmission Friction Element H Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0845": [
    {
      "scope": "所有汽车制造商",
      "code": "P0845",
      "zh-cn": "变速器液压力（TFP）传感器/开关B电路",
      "en-us": "Transmission Fluid Pressure Sensor/Switch B Circuit",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0BC7": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BC7",
      "zh-cn": "混合动力电池组冷却风扇监控电路/开路",
      "en-us": "Hybrid Battery Pack Cooling Fan Sense Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0961": [
    {
      "scope": "所有汽车制造商",
      "code": "P0961",
      "zh-cn": "压力控制电磁阀A控制电路范围/性能",
      "en-us": "Pressure Control Solenoid A Control Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。该故障码的原因包括压力控制电磁阀本身，电路，接头等。同时要注意，变速箱控制电磁阀故障有些情况下并不并不是因为电子问题，而是由于管路阻塞或者是机械方面的问题。好多时候，仅仅因为变速箱油太脏就会造成很多这方面的故障。"
    }
  ],
  "P0414": [
    {
      "scope": "所有汽车制造商",
      "code": "P0414",
      "zh-cn": "二次空气喷射系统切换阀A电路短路",
      "en-us": "Secondary Air Injection System Switching Valve A Circuit Shorted",
      "sys": "排放控制",
      "knowledge": "在发动机刚刚启动时，二次空气喷射系统通过往排气歧管强制输入空气来氧化产生的碳氢化合物，一氧化碳等有害气体。这个过程也同时加速了催化转换器的暖化过程。如果电子控制单元（ECU）检测到二次空气喷射系统控制电磁阀电路有短路的情况，该故障码会出现。故障原因包括二次空气喷射执行器电路短路到正极，执行器故障，继电器故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0A15": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A15",
      "zh-cn": "发动机悬架（支架胶垫）控制电路低",
      "en-us": "Engine Mount A Control Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "汽车电控悬架可以根据行驶的需要对悬架硬度、阻尼、和车身高度进行调节，提高车辆的形式平稳性和操控性。如果控制模块检测到悬架系统的控制电路的电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0007": [
    {
      "scope": "所有汽车制造商",
      "code": "P0007",
      "zh-cn": "燃油切断阀A控制电路高",
      "en-us": "Fuel Shutoff Valve A Control Circuit High",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油切断阀的作用是在汽车发生紧急情况（例如翻车）的时候切断通往发动机的燃油供给。该故障码表明电子控制单元（ECU）检测到燃油切断阀A控制电路电压高于校准的最高值。"
    }
  ],
  "P070F": [
    {
      "scope": "所有汽车制造商",
      "code": "P070F",
      "zh-cn": "变速器液液面太低",
      "en-us": "Transmission Fluid Level Too Low",
      "sys": "变速箱",
      "knowledge": "变速器液位传感器显示变速器液液面太低。"
    }
  ],
  "P0136": [
    {
      "scope": "所有汽车制造商",
      "code": "P0136",
      "zh-cn": "氧传感器电路（第1排，传感器 2）",
      "en-us": "O2 Sensor Circuit (Bank 1, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。如果电子控制单元（ECU）检测到用于测定废气中氧含量电路有问题时，则该故障码会出现。故障原因包括排气管或排气歧管泄漏，氧传感器信号电路和地线电路交叉，氧传感器被燃油污染或失效，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0662": [
    {
      "scope": "所有汽车制造商",
      "code": "P0662",
      "zh-cn": "进气歧管调谐阀控制电路高（第1排）",
      "en-us": "Intake Manifold Tuning Valve Control Circuit High (Bank 1)",
      "sys": "计算机或辅助输出电路",
      "knowledge": "如果进气歧管通路（runner）的长度最佳，气门关闭所产生的压力波会帮助将油气混合物导入发动机。问题是发动机不同转速对应的最佳进气歧管通路长度也不同。歧管调谐阀（MTV）的作用就是根据发动机转速，将进气导入不同长度的进气歧管通路，以此来优化发动机在不同转速时的扭矩。如果电子控制单元（ECU）在自检时检测到进气歧管调谐阀控制电路电压高于校准的最高值，则该故障码会出现。"
    }
  ],
  "P0500": [
    {
      "scope": "所有汽车制造商",
      "code": "P0500",
      "zh-cn": "车速传感器（VSS）A",
      "en-us": "Vehicle Speed Sensor A",
      "sys": "车速及怠速控制",
      "knowledge": "车速传感器（VSS）的作用是将汽车的速度以电信号形式传输给电子控制单元（ECU），作为控制发动机怠速，自动变速器换档，液力变矩器器锁止，发动机冷却风扇的开闭，以及巡航定速等其它功能的参考依据。电子控制单元（ECU）认为如果发动机转速高于液力变矩器的失速速度（自动档变速器）并且发动机负载很高，那么车辆一定是在行驶中。如果在这样的情况下，车速传感器（VSS）显示零车速的话，该故障码会出现。"
    }
  ],
  "P06AE": [
    {
      "scope": "所有汽车制造商",
      "code": "P06AE",
      "zh-cn": "动力总成控制模块（PCM）/发动机控制模块（ECM）/变速器控制模块（TCU）内部温度传感器B电路高",
      "en-us": "PCM/ECM/TCU Internal Temperature Sensor B Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。该故障码表明控制模块内部温度传感器信号电路电压超出了校准的最大范围。故障原因内部温度传感器，电路，接头，或控制模块。"
    }
  ],
  "P002C": [
    {
      "scope": "所有汽车制造商",
      "code": "P002C",
      "zh-cn": "B 凸轮轴形面控制电路高 （第1排）",
      "en-us": "B Camshaft Profile Control Circuit High (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。该故障码表明B（排气/右/后）凸轮轴形面控制电路电压高于校准的最高值。"
    }
  ],
  "P0153": [
    {
      "scope": "所有汽车制造商",
      "code": "P0153",
      "zh-cn": "氧传感器电路反应太慢（第2排，传感器 1）",
      "en-us": "O2 Sensor Circuit Slow Response (Bank 2, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。当电压变化速率低于校准值时，电子控制单元（ECU）就会开始修改空燃比试图提高氧传感器的电压变化速率。如果ECU已经达到了可以接受的燃油修剪限制或者已超过了可接受的燃油修剪的时间长度，而仍然没有监测到可以接受的电压变化速率的话，该故障码就会出现。故障原因包括氧传感器由于燃油中含硅而被污染，氧传感器信号电路开路，氧传感器本身故障，排气管或排气歧管泄漏，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0319": [
    {
      "scope": "所有汽车制造商",
      "code": "P0319",
      "zh-cn": "恶劣路况传感器B信号电路",
      "en-us": "Rough Road Sensor B Signal Circuit",
      "sys": "点火系统",
      "knowledge": "电子控制模块通过监控曲轴旋转速度的变化来检测气缸失火。但恶劣路况导致的轮速变化也可能导致曲轴转速的变化，从而影响气缸失火的探测。防抱死刹车（ABS）和牵引力控制（TCS）系统可以通过轮速传感器的信号判断车辆是否在恶劣路况行驶。如果系统检测到严重的影响到失火探测的恶劣路况，便会通知电子控制模块关闭失火检测,以防止记录错误的故障信息。恶劣路况传感器信号一般是一个从ABS（防抱死刹车）系统/驱动防滑牵引力控制（TCS）系统的控制模块传递给动力总成控制模块（PCM）的方波。"
    }
  ],
  "P0C73": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C73",
      "zh-cn": "电机电子设备冷却液泵A控制性能",
      "en-us": "Motor Electronics Coolant Pump A Control Performance",
      "sys": "混合动力系统",
      "knowledge": "电机电子系统冷却系统（MECS）是一套独立的为变速箱（例如eCVT）电机，控制模块以及直流/直流转换器提供冷却的系统。它拥有自己的散热器，冷却液泵，冷却液温度传感器等。电机电子冷却系统冷却液泵是一个电子控制单元（ECU）控制的12伏电压电泵。"
    }
  ],
  "P02BF": [
    {
      "scope": "所有汽车制造商",
      "code": "P02BF",
      "zh-cn": "燃油（空燃比）修剪在最低限 - 气缸10",
      "en-us": "Cylinder 10 - Fuel Trim at Min Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最低极限超过一定时间，该故障码会出现。"
    }
  ],
  "P0BBF": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BBF",
      "zh-cn": "混合动力电池组冷却风扇供电电压电路/开路",
      "en-us": "Hybrid Battery Pack Cooling Fan Supply Voltage Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0021": [
    {
      "scope": "所有汽车制造商",
      "code": "P0021",
      "zh-cn": "A凸轮轴位置执行器 - 正时过前或系统性能 （第2排）",
      "en-us": "A Camshaft Position - Timing Over-Advanced or System Performance (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。P0021的故障原因包括A进气/左/前凸轮轴正时没有设定好，凸轮轴过前原理机械性卡住，或者是执行器阀门卡在开的位置。"
    }
  ],
  "P02B0": [
    {
      "scope": "所有汽车制造商",
      "code": "P02B0",
      "zh-cn": "喷油器受限制 - 气缸6",
      "en-us": "Cylinder 6 - Injector Restricted",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第6缸喷油器性能出错。"
    }
  ],
  "P07A0": [
    {
      "scope": "所有汽车制造商",
      "code": "P07A0",
      "zh-cn": "变速器摩擦衬片G检测到打滑",
      "en-us": "Transmission Friction Element G Slip Detected",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0B5C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B5C",
      "zh-cn": "混合动力电池电压监控G电路高",
      "en-us": "Hybrid Battery Voltage Sense G Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0198": [
    {
      "scope": "所有汽车制造商",
      "code": "P0198",
      "zh-cn": "机油温度传感器电路高",
      "en-us": "Engine Oil Temperature Sensor Circuit High",
      "sys": "燃油或空气",
      "knowledge": "机油温度（EOT）传感器依据热敏电阻的原理将机油温度以电信号的形式传送到电子控制单元（ECU）。如果电子控制单元（ECU）检测到机油温度传感器的信号电压在设定的时间段内持续高于校准的最高极限（低温度），该故障码会出现。故障原因包括机油温度传感器，其电路，或接头。"
    }
  ],
  "P0545": [
    {
      "scope": "所有汽车制造商",
      "code": "P0545",
      "zh-cn": "排气温度传感器电路低（第1排，传感器1）",
      "en-us": "Exhaust Gas Temperature Sensor Circuit Low (Bank 1, Sensor 1)",
      "sys": "车速及怠速控制",
      "knowledge": "排气温度传感器的作用是将排气温度以电信号的形式输送给电子控制单元（ECU）。正确的空燃比产生的排气温度比过浓或过稀空燃比产生的排气温度要低。过高排气温度（>160摄氏度）会对发动机造成破坏。如果电子控制单元（ECU）检测到排气温度传感器信号电压在设定的时间段（15秒）内低于0.1伏（也可能是0.2伏），该故障码会出现。"
    }
  ],
  "P0942": [
    {
      "scope": "所有汽车制造商",
      "code": "P0942",
      "zh-cn": "液压装置",
      "en-us": "Hydraulic Pressure Unit",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P06A7": [
    {
      "scope": "所有汽车制造商",
      "code": "P06A7",
      "zh-cn": "传感器参考电压B电路范围/性能",
      "en-us": "Sensor Reference Voltage B Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到5伏参考电压电路B出错。故障原因包括5伏参考电压电路到某个传感器的电路发生短路或短路，一个或多个传感器发生短路或开路，ECU等。"
    }
  ],
  "P0322": [
    {
      "scope": "所有汽车制造商",
      "code": "P0322",
      "zh-cn": "点火/分电器发动机转速输入电路没有讯号",
      "en-us": "Ignition/Distributor Engine Speed Input Circuit No Signal",
      "sys": "点火系统",
      "knowledge": "故障原因包括发动机转速传感器故障，传感器轮故障或不匹配，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P040C": [
    {
      "scope": "所有汽车制造商",
      "code": "P040C",
      "zh-cn": "废气再循环阀温度传感器A电路低",
      "en-us": "Exhaust Gas Recirculation Temperature Sensor A Circuit Low",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环阀（EGR）温度传感器的信号电压在指设定时间段内（5秒）低于校准的最低值（0.15伏），该故障码会出现。"
    }
  ],
  "P0017": [
    {
      "scope": "所有汽车制造商",
      "code": "P0017",
      "zh-cn": "曲轴位置/凸轮轴位置相关性 （第1排,传感器B）",
      "en-us": "Crankshaft Position - Camshaft Position Correlation (Bank 1, Sensor B)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。凸轮轴的作用是控制气门的开启和闭合。电子控制单元（ECU）会持续监控可变凸轮轴的正时位置，检查凸轮轴和曲轴之间的相对位置。如果相对位置错位超出了1个轮齿，则该故障码会出现。故障原因包括凸轮轴位置传感器本身或其电路故障，曲轴位置传感器本身或其电路故障，发动机速度传感器故障，机油被污染，可变凸轮轴电磁阀卡住等。"
    }
  ],
  "P0A8F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A8F",
      "zh-cn": "14伏电源模块系统性能",
      "en-us": "14 Volt Power Module System Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0392": [
    {
      "scope": "所有汽车制造商",
      "code": "P0392",
      "zh-cn": "凸轮轴位置（CMP）传感器B电路低 （第2排）",
      "en-us": "Camshaft Position Sensor B Circuit Low (Bank 2)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。如果电子控制单元（ECU）检测到凸轮轴传感器B电路电压低于校准的最低值，该故障码会出现。故障原因包括凸轮轴位置（CMP）传感器电路，接头，其本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0B12": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B12",
      "zh-cn": "混合动力电池组电流传感器B电路间歇/不稳定",
      "en-us": "Hybrid Battery Pack Current Sensor B Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块通过来自电池电流传感器的信号来监控电池的充电放电情况。如果控制模块发现电池电流传感器发生故障，该故障码会出现。"
    }
  ],
  "P0298": [
    {
      "scope": "所有汽车制造商",
      "code": "P0298",
      "zh-cn": "机油温度过高",
      "en-us": "Engine Oil Over Temperature",
      "sys": "燃油或空气",
      "knowledge": "电子控制单元（ECU）检测到发动机处于机油温度过高状态。这表示机油温度过高保护已被激活。ECU会通过禁用喷油器等来避免高发动机转速，以减少发动机因为机油温度过高而引起的破坏。"
    }
  ],
  "P0BF1": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BF1",
      "zh-cn": "驱动电机B，U相电流传感器电路",
      "en-us": "Drive Motor B Phase U Current Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0049": [
    {
      "scope": "所有汽车制造商",
      "code": "P0049",
      "zh-cn": "涡轮/超级增压器涡轮速度太快",
      "en-us": "Turbocharger/Supercharger Turbine Overspeed",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。该故障码表明涡轮转速快。可能原因包括增压控制器，废气门执行器等。"
    }
  ],
  "P0659": [
    {
      "scope": "所有汽车制造商",
      "code": "P0659",
      "zh-cn": "执行器电源电压A电路高",
      "en-us": "Actuator Supply Voltage A Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "动力总成控制模块（PCM）检测到变速器执行器供电A电路电压过高。故障原因包括电路或接头故障，自动变速器液压传感器故障，电磁阀故障，变速器控制模块故障，变速器输入速度（RPM）传感器故障，变速器输出速度（RPM）传感器故障等。"
    }
  ],
  "P0851": [
    {
      "scope": "所有汽车制造商",
      "code": "P0851",
      "zh-cn": "停车档（P）/空档（N）位置开关 输入电路低",
      "en-us": "Park/Neutral Switch Input Circuit Low",
      "sys": "变速箱",
      "knowledge": "驻车档/空档位置开关的作用是将自动变速器在驻车档/空档，还是其他挡位的信息输送给电子控制单元（ECU），作为决定发动机怠速，还是增加负荷的参考依据。该开关也被用在起动机继电器电路中，以防止汽车在驻车档/空档之外的其他挡位启动。"
    }
  ],
  "P001F": [
    {
      "scope": "所有汽车制造商",
      "code": "P001F",
      "zh-cn": "A凸轮轴形面控制电路高 （第2排）",
      "en-us": "A Camshaft Profile Control Circuit High (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。如果电子控制单元（ECU）检测到A（进气/左/前）凸轮轴形面控制电路电压在一段时间内高于校准的最高值，则该故障码会出现。"
    }
  ],
  "P0036": [
    {
      "scope": "所有汽车制造商",
      "code": "P0036",
      "zh-cn": "热氧传感器加热器控制电路 （第1排，传感器 2）",
      "en-us": "HO2S Heater Control Circuit (Bank 1, Sensor 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）通过控制氧传感器加热器的开/关来保持氧传感器780oC的温度。如果氧传感器在设定的时间内没有达到要求的温度，或ECU无法维持设定的温度，该故障码会出现。"
    }
  ],
  "P0B4F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B4F",
      "zh-cn": "混合动力电池电压监控E电路",
      "en-us": "Hybrid Battery Voltage Sense E Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0BB7": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BB7",
      "zh-cn": "混合动力电池电压监控Y电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense Y Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P06BB": [
    {
      "scope": "所有汽车制造商",
      "code": "P06BB",
      "zh-cn": "气缸3电热塞电路范围/性能",
      "en-us": "Cylinder 3 Glow Plug Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸3电热塞电路发生故障，则该故障码会出现。"
    }
  ],
  "P0A8B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A8B",
      "zh-cn": "14伏电源模块系统电压",
      "en-us": "14 Volt Power Module System Voltage",
      "sys": "混合动力系统",
      "knowledge": "控制模块检测到系统电压过高或过低。"
    }
  ],
  "P0A49": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A49",
      "zh-cn": "驱动电机B位置传感器电路间歇",
      "en-us": "Drive Motor B Position Sensor Circuit Intermittent",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括驱动电机B位置传感器电路，接头，或传感器本身；混合动力驱动电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P018D": [
    {
      "scope": "所有汽车制造商",
      "code": "P018D",
      "zh-cn": "燃油压力传感器B电路高",
      "en-us": "Fuel Pressure Sensor B Circuit High",
      "sys": "燃油或空气",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。电子控制单元（ECU）持续监测燃油压力传感器信号电压。如果这个电压在设定时间段里高于最高校准值，则该故障码会出现。"
    }
  ],
  "P000C": [
    {
      "scope": "所有汽车制造商",
      "code": "P000C",
      "zh-cn": "A凸轮轴位置执行器反应太慢 （第2排）",
      "en-us": "A Camshaft Position Slow Response (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。P000C的故障原因包括进气/左/前凸轮轴调节阀（机油控制阀），其电路，接头，机油太脏或ECU。"
    }
  ],
  "P0BA1": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BA1",
      "zh-cn": "混合动力电池电压监控U电路低",
      "en-us": "Hybrid Battery Voltage Sense U Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0624": [
    {
      "scope": "所有汽车制造商",
      "code": "P0624",
      "zh-cn": "油箱盖指示灯控制电路",
      "en-us": "Fuel Cap Lamp Control Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "故障原因包括油箱盖指示灯，电路，接头，或电子控制单元（ECU）"
    }
  ],
  "P06A1": [
    {
      "scope": "所有汽车制造商",
      "code": "P06A1",
      "zh-cn": "可变（排量）空调压缩机控制电路低",
      "en-us": "Variable A/C Compressor Control Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "可变（排量）空调压缩机通过改变冲溅板的角度来控制压缩机制冷剂被压缩的排量。该故障码表明可变（排量）空调压缩机控制电路电压低于校准的最低值。"
    }
  ],
  "P085E": [
    {
      "scope": "所有汽车制造商",
      "code": "P085E",
      "zh-cn": "换档控制模块B性能",
      "en-us": "Gear Shift Control Module B Performance",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0C17": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C17",
      "zh-cn": "驱动电机A位置传感器没有学会",
      "en-us": "Drive Motor A Position Sensor Not Learned",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P015A": [
    {
      "scope": "所有汽车制造商",
      "code": "P015A",
      "zh-cn": "氧传感器延迟响应 - （空燃比）浓到稀 （第1排，传感器 1）",
      "en-us": "O2 Sensor Delayed Response - Rich to Lean (Bank 1, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。如果电子控制单元（ECU）发现在空燃比由浓变稀的过程中，电压变化速率滞后，该故障码就会出现。"
    }
  ],
  "P0B45": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B45",
      "zh-cn": "混合动力电池电压监控C电路",
      "en-us": "Hybrid Battery Voltage Sense C Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0890": [
    {
      "scope": "所有汽车制造商",
      "code": "P0890",
      "zh-cn": "变速器控制模块（TCU）电源继电器监控电路低",
      "en-us": "TCU Power Relay Sense Circuit Low",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。控制模块继电器的作用是在点火开关关闭以后，继续保持控制模块的供电，直到控制模块完成关闭过程。"
    }
  ],
  "P02BE": [
    {
      "scope": "所有汽车制造商",
      "code": "P02BE",
      "zh-cn": "燃油（空燃比）修剪在最高限 - 气缸10",
      "en-us": "Cylinder 10 - Fuel Trim at Max Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最大极限超过一定时间，该故障码会出现。"
    }
  ],
  "P0185": [
    {
      "scope": "所有汽车制造商",
      "code": "P0185",
      "zh-cn": "燃油温度传感器B电路",
      "en-us": "Fuel Temperature Sensor B Circuit",
      "sys": "燃油或空气",
      "knowledge": "燃油温度传感器负责监控通往燃油泵的燃油温度，以避免因温度过高（120摄氏度）造成蒸气锁现象，而造成对燃油泵或喷油器的破坏。电子控制单元（ECU）持续监测燃油温度传感器信号电压。如果这个电压在设定时间段里超出了正常校准值，则该故障码会出现。"
    }
  ],
  "P051A": [
    {
      "scope": "所有汽车制造商",
      "code": "P051A",
      "zh-cn": "曲轴箱压力传感器电路",
      "en-us": "Crankcase Pressure Sensor Circuit",
      "sys": "车速及怠速控制",
      "knowledge": "曲轴箱压力传感器的作用是将曲轴箱内的压力以电信号的形式输送给电子控制单元（ECU），以检测曲轴箱强制通风系统的工作状态。该故障码表明ECU检测到曲轴箱压力传感器电路故障。"
    }
  ],
  "P0070": [
    {
      "scope": "所有汽车制造商",
      "code": "P0070",
      "zh-cn": "周围空气温度传感器电路",
      "en-us": "Ambient Air Temperature Sensor Circuit",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "周围空气温度传感器的作用是将外部空气温度以电信号的形式传输给电子控制单元（ECU），以帮助发动机实现最佳空燃比。该传感器一般位于水箱散热器的前边或两侧。该故障码表明周围空气温度传感器信号电压超出校准的正常范围。"
    }
  ],
  "P0C74": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C74",
      "zh-cn": "电机电子设备冷却液泵B控制性能",
      "en-us": "Motor Electronics Coolant Pump B Control Performance",
      "sys": "混合动力系统",
      "knowledge": "电机电子系统冷却系统（MECS）是一套独立的为变速箱（例如eCVT）电机，控制模块以及直流/直流转换器提供冷却的系统。它拥有自己的散热器，冷却液泵，冷却液温度传感器等。电机电子冷却系统冷却液泵是一个电子控制单元（ECU）控制的12伏电压电泵。"
    }
  ],
  "P02C1": [
    {
      "scope": "所有汽车制造商",
      "code": "P02C1",
      "zh-cn": "喷油器泄漏 - 气缸10",
      "en-us": "Cylinder 10 - Injector Leaking",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第10缸喷油器发生泄漏。"
    }
  ],
  "P0A68": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A68",
      "zh-cn": "驱动电机B，U相电流高",
      "en-us": "Drive Motor B Phase U Current High",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0633": [
    {
      "scope": "所有汽车制造商",
      "code": "P0633",
      "zh-cn": "防盗钥匙没有编程 - 发动机控制模块（ECM） / 动力总成控制模块（PCM）",
      "en-us": "Immobilizer Key Not Programmed - ECM/PCM",
      "sys": "计算机或辅助输出电路",
      "knowledge": "防盗控制模块的作用是保证汽车仅在专用钥匙存在并且它跟各类部件相匹配的时候才会允许汽车启动。发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P000F": [
    {
      "scope": "所有汽车制造商",
      "code": "P000F",
      "zh-cn": "燃油系统过压释放阀启动",
      "en-us": "Fuel System Over Pressure Relief Valve Activated",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油系统过压释放阀的作用是在燃油管路因为滤清器太脏，管路阻塞等引起管路压力过大时，释放燃油管路压力，以避免对管路的破坏。该故障码表明电子控制单元（ECU）检测到燃油系统处于压力过高状态，燃油系统过压释放阀启动。压力过高可能是燃油压力调节器，油路堵塞，燃油压力传感器，燃油泵控制模块等问题。"
    }
  ],
  "P0762": [
    {
      "scope": "所有汽车制造商",
      "code": "P0762",
      "zh-cn": "换档电磁阀C卡在开的位置",
      "en-us": "Shift Solenoid C Stuck On",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P072C": [
    {
      "scope": "所有汽车制造商",
      "code": "P072C",
      "zh-cn": "卡在1档",
      "en-us": "Stuck in Gear 1",
      "sys": "变速箱",
      "knowledge": "车辆行驶中，电子控制单元（ECU）检测到换档电磁阀发生发生故障（卡住）导致变速器卡在1档。故障原因包括换档电磁阀，输入轴速度传感器，输出轴速度传感器，电路，接头，控制模块，以及变速器机械故障等。"
    }
  ],
  "P0655": [
    {
      "scope": "所有汽车制造商",
      "code": "P0655",
      "zh-cn": "发动机过热告警灯输出控制电路",
      "en-us": "Engine Hot Lamp Output Control Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": ""
    }
  ],
  "P0083": [
    {
      "scope": "所有汽车制造商",
      "code": "P0083",
      "zh-cn": "进气阀门控制电磁阀电路高 （第2排）",
      "en-us": "Intake Valve Control Solenoid Circuit High (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。如果进气凸轮轴调节阀电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P02CD": [
    {
      "scope": "所有汽车制造商",
      "code": "P02CD",
      "zh-cn": "喷油器补偿学习在最高限气缸1",
      "en-us": "Cylinder 1 Fuel Injector Offset Learning At Max Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第1缸喷油器补偿学习已经达到了最高学习极限，该故障码会出现。"
    }
  ],
  "P0346": [
    {
      "scope": "所有汽车制造商",
      "code": "P0346",
      "zh-cn": "凸轮轴位置（CMP）传感器A电路范围/性能 （第2排）",
      "en-us": "Camshaft Position Sensor A Circuit Range/Performance (Bank 2)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。该故障码表明A（进气/左/前）凸轮轴位置（CMP）传感器电路错误。故障原因包括凸轮轴位置（CMP）传感器电路，接头，其本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P048A": [
    {
      "scope": "所有汽车制造商",
      "code": "P048A",
      "zh-cn": "排气压力控制阀门A卡在关的位置",
      "en-us": "Exhaust Pressure Control Valve A Stuck Closed",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。该故障码表明排气压力控制阀门A卡在关的位置。"
    }
  ],
  "P033E": [
    {
      "scope": "所有汽车制造商",
      "code": "P033E",
      "zh-cn": "爆震传感器4电路间歇 （第2排）",
      "en-us": "Knock Sensor 4 Circuit Intermittent (Bank 2)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压突然变化，该故障码会出现。"
    }
  ],
  "P0600": [
    {
      "scope": "所有汽车制造商",
      "code": "P0600",
      "zh-cn": "串行通讯链接",
      "en-us": "Serial Communication Link",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到一个涉及到串行通讯连接的内部错误。故障原因包括电子控制模块（PCM或ECM）故障，控制器局域网（CAN）数据连线短路。"
    }
  ],
  "P0A51": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A51",
      "zh-cn": "驱动电机A电流传感器电路",
      "en-us": "Drive Motor A Current Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）内部故障。"
    }
  ],
  "P0B73": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B73",
      "zh-cn": "混合动力电池电压监控L电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense L Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0A37": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A37",
      "zh-cn": "发电机温度传感器电路范围/性能",
      "en-us": "Generator Temperature Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车的起动机/发电机为同一个电机，一般位于变速器内。故障原因包括发电机温度传感器，电路，接头，控制模块等。"
    }
  ],
  "P0AC7": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AC7",
      "zh-cn": "混合动力电池温度传感器B电路低",
      "en-us": "Hybrid Battery Temperature Sensor B Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P003B": [
    {
      "scope": "所有汽车制造商",
      "code": "P003B",
      "zh-cn": "涡轮/超级增压器增压控制B位置超过学习极限",
      "en-us": "Turbocharger/Supercharger Boost Control B position Exceeded Learning Limit",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。涡轮/超级增压器增压控制器的作用是当增压压力达到设定值后，气压推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮速度，控制增压水平。该故障码表明涡轮/超级增压器增压控制B位置超过正常范围。"
    }
  ],
  "P02A6": [
    {
      "scope": "所有汽车制造商",
      "code": "P02A6",
      "zh-cn": "燃油（空燃比）修剪在最高限 - 气缸4",
      "en-us": "Cylinder 4 - Fuel Trim at Max Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最大极限超过一定时间，该故障码会出现。"
    }
  ],
  "P0B36": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B36",
      "zh-cn": "高压服务断开电路高",
      "en-us": "High Voltage Service Disconnect Circuit High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0564": [
    {
      "scope": "所有汽车制造商",
      "code": "P0564",
      "zh-cn": "定速巡航系统多功能输入A电路",
      "en-us": "Cruise Control Multi-Function Input A Circuit",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。故障原因包括多定速巡航功能开关，电路，接头等。"
    }
  ],
  "P0336": [
    {
      "scope": "所有汽车制造商",
      "code": "P0336",
      "zh-cn": "曲轴位置（CKP）传感器A电路范围/性能",
      "en-us": "Crankshaft Position Sensor A Circuit Range/Performance",
      "sys": "点火系统",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。曲轴位置（CKP）传感器(也叫上止点传感器），其作用是检测上止点（TDC）信号、曲轴转角信号和发动机转速信号，并将其输入计算机，从而使计算机能按气缸的点火顺序发出最佳点火时刻指令。如果电子控制单元（ECU）检测到曲轴传感器A电路电压出错，该故障码会出现。"
    }
  ],
  "P0814": [
    {
      "scope": "所有汽车制造商",
      "code": "P0814",
      "zh-cn": "档位显示电路",
      "en-us": "Transmission Range Display Circuit",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P06AD": [
    {
      "scope": "所有汽车制造商",
      "code": "P06AD",
      "zh-cn": "动力总成控制模块（PCM）/发动机控制模块（ECM）/变速器控制模块（TCU）内部温度传感器B电路低",
      "en-us": "PCM/ECM/TCU Internal Temperature Sensor B Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。该故障码表明控制模块内部温度传感器信号电路电压超出了校准的最大范围。故障原因内部温度传感器，电路，接头，或控制模块。"
    }
  ],
  "P0858": [
    {
      "scope": "所有汽车制造商",
      "code": "P0858",
      "zh-cn": "驱动防滑/牵引力控制（TCS）输入信号低",
      "en-us": "Traction Control Input Signal Low",
      "sys": "变速箱",
      "knowledge": "驱动防滑牵引力控制（TCS）系统的作用是是当感应到驱动轮打滑现象时，通过滞后点火时间等来控制扭力输出，提前升档，二档起步，防止液力变矩器锁定，和刹车等来防止打滑。"
    }
  ],
  "P0443": [
    {
      "scope": "所有汽车制造商",
      "code": "P0443",
      "zh-cn": "蒸发排放系统吹扫控制阀电路",
      "en-us": "Evaporative Emission System Purge Control Valve Circuit",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。如果电子控制单元（ECU）检测到蒸发排放系统吹扫电磁阀控制电路电压超出正常校准范围，则该故障码会出现。故障原因包括蒸发排放系统吹扫执行器电路故障，吹扫控制阀故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0328": [
    {
      "scope": "所有汽车制造商",
      "code": "P0328",
      "zh-cn": "爆震传感器1电路高（第1排或单个传感器）",
      "en-us": "Knock Sensor 1 Circuit High (Bank 1 or Single Sensor)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压高于校准的最高值，该故障码会出现。故障原因包括爆震传感器电路故障，爆震传感器松动，爆震传感器本身故障，所用燃油油号不正确，发动机的模部件松动，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0358": [
    {
      "scope": "所有汽车制造商",
      "code": "P0358",
      "zh-cn": "点火线圈H主/次电路",
      "en-us": "Ignition Coil H Primary/Secondary Circuit",
      "sys": "点火系统",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。电子控制单元（ECU）持续监测每个点火主电路。如果ECU没有收到有效的来自点火模块（集成在ECU）的点火诊断监控器（IDM）脉冲信号，该故障码会出现。故障原因包括点火启动/运行电路，点火线圈电路，点火线圈本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0177": [
    {
      "scope": "所有汽车制造商",
      "code": "P0177",
      "zh-cn": "燃油成分传感器电路范围/性能",
      "en-us": "Fuel Composition Sensor Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "燃油组分传感器的作用是将汽油中的乙醇含量以电信号的形式传输给电子控制单元（ECU），作为修改喷油器脉冲宽度和点火正时的依据。如果ECU检测到燃油成分传感器信号电压出错，该故障码会出现。"
    }
  ],
  "P0A7C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A7C",
      "zh-cn": "电机电子系统温度过高",
      "en-us": "Motor Electronics Over Temperature",
      "sys": "混合动力系统",
      "knowledge": "电机电子冷却液温度（MECT）传感器显示系统处于温度过高状态。故障原因包括MECT传感器电路，接头，或传感器本身故障；电机电子冷却系统故障；直流/直流转换器故障。"
    }
  ],
  "P0033": [
    {
      "scope": "所有汽车制造商",
      "code": "P0033",
      "zh-cn": "涡轮/超级增压器旁通阀门控制电路",
      "en-us": "Turbocharger/Supercharger Bypass Valve Control Circuit",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。增压器旁通阀的作用是当增压压力过大时，打开旁通阀将部分高压空气放掉，从而达到保护增压器和发动机的目的。该故障码表明涡轮/超级增压器旁通阀门控制电路电压超出校准的正常范围。"
    }
  ],
  "P0896": [
    {
      "scope": "所有汽车制造商",
      "code": "P0896",
      "zh-cn": "换档时间太长",
      "en-us": "Shift Time Too Long",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0164": [
    {
      "scope": "所有汽车制造商",
      "code": "P0164",
      "zh-cn": "氧传感器电路高电压（第2排，传感器 3）",
      "en-us": "O2 Sensor Circuit High Voltage (Bank 2, Sensor 3)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。当加热氧传感器信号的电压在设定的时间段内持续高于1.5伏时，该故障码就会出现。故障原因包括氧传感器信号电路短路到正极，氧传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0349": [
    {
      "scope": "所有汽车制造商",
      "code": "P0349",
      "zh-cn": "凸轮轴位置（CMP）传感器A电路间歇 （第2排）",
      "en-us": "Camshaft Position Sensor A Circuit Intermittent (Bank 2)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。如果电子控制单元（ECU）在设定的时间段内检测到A（进气/左/前）凸轮轴位置（CMP）传感器信号不稳定时，该故障码会出现。"
    }
  ],
  "P0771": [
    {
      "scope": "所有汽车制造商",
      "code": "P0771",
      "zh-cn": "换档电磁阀E性能问题或者卡在关的位置",
      "en-us": "Shift Solenoid E Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0048": [
    {
      "scope": "所有汽车制造商",
      "code": "P0048",
      "zh-cn": "涡轮/超级增压器增压控制A电路高",
      "en-us": "Turbocharger/Supercharger Boost Control A Circuit High",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。涡轮/超级增压器增压控制器的作用是当增压压力达到设定值后，气压推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮速度，控制增压水平。该故障码表明涡轮/超级增压器增压控制电路电压高于校准的最高值。"
    }
  ],
  "P054C": [
    {
      "scope": "所有汽车制造商",
      "code": "P054C",
      "zh-cn": "冷车启动B凸轮轴位置正时过度超前 （第2排）",
      "en-us": "Cold Start B Camshaft Position Timing Over-Advanced (Bank 2)",
      "sys": "车速及怠速控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。冷车启动时，如果电子控制单元（ECU）检测到B（排气/右/后）凸轮轴正时超过最大设定值，或者一直处于超前状态，则该故障码会出现。"
    }
  ],
  "P063F": [
    {
      "scope": "所有汽车制造商",
      "code": "P063F",
      "zh-cn": "自动配置发动机冷却液温度输入不存在",
      "en-us": "Auto Configuration Engine Coolant Temperature Input Not Present",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。"
    }
  ],
  "P0AD9": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AD9",
      "zh-cn": "混合动力电池正极接触器控制电路/开路",
      "en-us": "Hybrid Battery Positive Contactor Control Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果混合动力电子控制单元发现第2系统主继电器（SMR）发生故障，该故障码会出现。"
    }
  ],
  "P02A3": [
    {
      "scope": "所有汽车制造商",
      "code": "P02A3",
      "zh-cn": "燃油（空燃比）修剪在最低限 - 气缸3",
      "en-us": "Cylinder 3 - Fuel Trim at Min Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最低极限超过一定时间，该故障码会出现。"
    }
  ],
  "P0100": [
    {
      "scope": "所有汽车制造商",
      "code": "P0100",
      "zh-cn": "空气流量（MAF）传感器A电路",
      "en-us": "Mass or Volume Air Flow A Circuit",
      "sys": "燃油或空气",
      "knowledge": "空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。如果ECU检测空气流量（MAF）传感器信号电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P0257": [
    {
      "scope": "所有汽车制造商",
      "code": "P0257",
      "zh-cn": "喷油泵燃油计量控制B范围/性能（凸轮/转子/喷油器）",
      "en-us": "Injection Pump Fuel Metering Control B Range/Performance (Cam/Rotor/Injector)",
      "sys": "燃油或空气",
      "knowledge": "故障原因包括燃油控制执行器（FCA），其电路，喷油泵，或电子控制模块（ECU）等。燃油控制执行器（FCA）一般位于喷油泵的后侧，它是一个电控电磁阀门。ECU通过循环打开和关闭FCA来控制进入喷油泵的燃油量。"
    }
  ],
  "P0A38": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A38",
      "zh-cn": "发电机温度传感器电路低",
      "en-us": "Generator Temperature Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车的起动机/发电机为同一个电机，一般位于变速器内。故障原因包括发电机温度传感器，电路，接头，控制模块等。"
    }
  ],
  "P0AB9": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AB9",
      "zh-cn": "混合动力系统性能",
      "en-us": "Hybrid System Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P073E": [
    {
      "scope": "所有汽车制造商",
      "code": "P073E",
      "zh-cn": "不能挂倒档",
      "en-us": "Unable to Engage Reverse",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0394": [
    {
      "scope": "所有汽车制造商",
      "code": "P0394",
      "zh-cn": "凸轮轴位置（CMP）传感器B电路间歇 （第2排）",
      "en-us": "Camshaft Position Sensor B Circuit Intermittent (Bank 2)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。如果电子控制单元（ECU）检测到凸轮轴传感器B电路电压突然变化，该故障码会出现。"
    }
  ],
  "P063B": [
    {
      "scope": "所有汽车制造商",
      "code": "P063B",
      "zh-cn": "发电机电压监控电路范围/性能",
      "en-us": "Generator Voltage Sense Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发电机电压监控电路的作用是将发电机电压信号输送给电子控制单元（ECU），作为控制充电速度和判定发电机是否正常工作的参考依据。该故障码表明电子控制单元（ECU）检测到发电机电压监控电路出错。故障原因包括发电机电压监控电路，发电机，或ECU。"
    }
  ],
  "P0891": [
    {
      "scope": "所有汽车制造商",
      "code": "P0891",
      "zh-cn": "变速器控制模块（TCU）电源继电器监控电路高",
      "en-us": "TCU Power Relay Sense Circuit High",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。控制模块继电器的作用是在点火开关关闭以后，继续保持控制模块的供电，直到控制模块完成关闭过程。"
    }
  ],
  "P0366": [
    {
      "scope": "所有汽车制造商",
      "code": "P0366",
      "zh-cn": "凸轮轴位置（CMP）传感器B电路范围/性能 （第1排）",
      "en-us": "Camshaft Position Sensor B Circuit Range/Performance (Bank 1)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。该故障码表明B（排气/右/后）凸轮轴位置（CMP）传感器电路错误。故障原因包括凸轮轴位置（CMP）传感器电路，接头，其本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P02AB": [
    {
      "scope": "所有汽车制造商",
      "code": "P02AB",
      "zh-cn": "燃油（空燃比）修剪在最低限 - 气缸5",
      "en-us": "Cylinder 5 - Fuel Trim at Min Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最低极限超过一定时间，该故障码会出现。"
    }
  ],
  "P0105": [
    {
      "scope": "所有汽车制造商",
      "code": "P0105",
      "zh-cn": "歧管绝对压力（传感器）/大气压力（传感器）电路",
      "en-us": "Manifold Absolute Pressure/Barometric Pressure Circuit",
      "sys": "燃油或空气",
      "knowledge": "歧管绝对压力（MAP）传感器的作用是测量进气歧管内的压力（真空度）。动力总成控制模块（PCM）然后会将进气歧管压力与大气压力之间的差值（跟发动机负荷成线性关系）作为确定喷油器基本喷油量的一个依据，以帮助发动机在不同负荷下达到最佳空燃比。大气压力传感器（有时候也叫高海拔补偿器，HAC）的作用是将大气压力以电信号的形式输送给电子控制模块。大气压力会随天气和海拔高度的变化而变化。压力越小，空气越稀薄。动力总成控制模块（PCM）会根据大气压力的数值来修正燃油供给，以帮助发动机达到最佳空燃比。如果电子控制单元（ECU）检测歧管绝对压力（MAP）传感器/气压传感器信号电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P0671": [
    {
      "scope": "所有汽车制造商",
      "code": "P0671",
      "zh-cn": "气缸1电热塞电路/开路",
      "en-us": "Cylinder 1 Glow Plug Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸1电热塞电路发生故障，该故障码会出现。"
    }
  ],
  "P0952": [
    {
      "scope": "所有汽车制造商",
      "code": "P0952",
      "zh-cn": "自动换档手动（ASM）变速器控制电路低",
      "en-us": "Auto Shift Manual Control Circuit Low",
      "sys": "变速箱",
      "knowledge": "自动换档手动变速器允许司机将变速器打入手动模式，手动控制升档或降档。"
    }
  ],
  "P0A31": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A31",
      "zh-cn": "驱动电机B温度传感器电路范围/性能",
      "en-us": "Drive Motor B Temperature Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "驱动电机B温度传感器电路发生故障。故障原因包括电路，接头，电子控制单元，驱动电机等。有些车辆的驱动电机温度传感器跟驱动电机是一体的。所以，如果确定是该温度传感器本身的问题，有可能需要换掉整个驱动电机。"
    }
  ],
  "P0782": [
    {
      "scope": "所有汽车制造商",
      "code": "P0782",
      "zh-cn": "2-3档换档",
      "en-us": "2-3 Shift",
      "sys": "变速箱",
      "knowledge": "电子控制单元（ECU）指令2-3换档，但没有检测到相应的发动机转速下降。故障原因包括换档电磁阀1故障，换档电磁阀2故障，变速器摩擦材料故障，或其他变速器内部故障。"
    }
  ],
  "P0856": [
    {
      "scope": "所有汽车制造商",
      "code": "P0856",
      "zh-cn": "驱动防滑/牵引力控制（TCS）输入信号",
      "en-us": "Traction Control Input Signal",
      "sys": "变速箱",
      "knowledge": "驱动防滑牵引力控制（TCS）系统的作用是是当感应到驱动轮打滑现象时，通过滞后点火时间等来控制扭力输出，提前升档，二档起步，防止液力变矩器锁定，和刹车等来防止打滑。"
    }
  ],
  "P00BA": [
    {
      "scope": "所有汽车制造商",
      "code": "P00BA",
      "zh-cn": "低燃油压力被迫限制功率",
      "en-us": "Low Fuel Pressure - Forced Limited Power",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油系统需要保持恒定的压力，油压过低则喷油器喷油太弱或不喷油，油压太高则使油路损毁或喷油器损坏。该故障码表明电子控制单元（ECU）检测到燃油压力过低，发动机功率输出因此下降。压力过低可能是燃油泵，燃油泵控制模块，燃油压力调节器，燃油压力传感器，燃油泄漏等问题。"
    }
  ],
  "P0258": [
    {
      "scope": "所有汽车制造商",
      "code": "P0258",
      "zh-cn": "喷油泵燃油计量控制B低（凸轮/转子/喷油器）",
      "en-us": "Injection Pump Fuel Metering Control B Low (Cam/Rotor/Injector)",
      "sys": "燃油或空气",
      "knowledge": "故障原因包括燃油控制执行器（FCA），其电路，喷油泵，或电子控制模块（ECU）等。燃油控制执行器（FCA）一般位于喷油泵的后侧，它是一个电控电磁阀门。ECU通过循环打开和关闭FCA来控制进入喷油泵的燃油量。"
    }
  ],
  "P0223": [
    {
      "scope": "所有汽车制造商",
      "code": "P0223",
      "zh-cn": "节气门/踏板位置传感器/开关B电路高",
      "en-us": "Throttle/Pedal Position Sensor/Switch B Circuit High",
      "sys": "燃油或空气",
      "knowledge": "在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。该故障码表明节气门踏板位置传感器B电路电压在设定的时间段内持续高于校准的最高值（4.65伏）。故障原因包括传感器接口故障，电路短路到正极，传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0AD7": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AD7",
      "zh-cn": "混合动力电池组空气流量阀A控制电路低",
      "en-us": "Hybrid Battery Pack Air Flow Valve A Control Circuit Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P081A": [
    {
      "scope": "所有汽车制造商",
      "code": "P081A",
      "zh-cn": "起动机禁用电路低",
      "en-us": "Starter Disable Circuit Low",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0979": [
    {
      "scope": "所有汽车制造商",
      "code": "P0979",
      "zh-cn": "换档电磁阀C控制电路低",
      "en-us": "Shift Solenoid C Control Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0945": [
    {
      "scope": "所有汽车制造商",
      "code": "P0945",
      "zh-cn": "液压泵继电器电路/开路",
      "en-us": "Hydraulic Pump Relay Circuit/Open",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0287": [
    {
      "scope": "所有汽车制造商",
      "code": "P0287",
      "zh-cn": "第9缸贡献/平衡错误",
      "en-us": "Cylinder 9 Contribution/Balance",
      "sys": "燃油或空气",
      "knowledge": "电子控制单元（ECU）检测到第9缸的曲轴加速贡献低于校准值。故障原因包括第9缸喷油系统；或其它影响第9缸的发动机问题。"
    }
  ],
  "P0AC3": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AC3",
      "zh-cn": "混合动力电池组电流传感器A电路间歇/不稳定",
      "en-us": "Hybrid Battery Pack Current Sensor A Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块通过来自电池电流传感器的信号来监控电池的充电放电情况。如果控制模块发现电池电流传感器信号电路发生故障，该故障码会出现。"
    }
  ],
  "P0B3E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B3E",
      "zh-cn": "混合动力电池电压监控A电路高",
      "en-us": "Hybrid Battery Voltage Sense A Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0A9F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A9F",
      "zh-cn": "混合动力电池温度传感器A电路间歇/不稳定",
      "en-us": "Hybrid Battery Temperature Sensor A Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压突然变化，该故障码会出现。"
    }
  ],
  "P0462": [
    {
      "scope": "所有汽车制造商",
      "code": "P0462",
      "zh-cn": "燃油液位传感器A电路低",
      "en-us": "Fuel Level Sensor A Circuit Low",
      "sys": "排放控制",
      "knowledge": "燃油液位传感器利用油箱内的一个浮标和可变电阻的原理将油箱内的燃油液位以电信号的形式输送给电子控制模块。如果电子控制单元（ECU）发现燃油液位输入信号低于校准的最小值，该故障码会出现。"
    }
  ],
  "P011D": [
    {
      "scope": "所有汽车制造商",
      "code": "P011D",
      "zh-cn": "（涡轮增压器）增压空气温度（传感器）/进气温度（传感器）相关性 （第2排）",
      "en-us": "Charge Air Temperature/Intake Air Temperature Correlation (Bank 2)",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。如果ECU检测到增压空气温度传感器跟进气温度（IAT）传感器信号差超过了设定的最大值，该故障码会出现。"
    }
  ],
  "P07B2": [
    {
      "scope": "所有汽车制造商",
      "code": "P07B2",
      "zh-cn": "变速器驻车档位置传感器/开关A电路/开路",
      "en-us": "Transmission Park Position Sensor/Switch A Circuit/Open",
      "sys": "变速箱",
      "knowledge": "驻车档位置传感器的作用是将变速杆是否在驻车档的位置的信号输送给电子控制单元（ECU）。如果ECU检测到驻车档位置传感器电路电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P011B": [
    {
      "scope": "所有汽车制造商",
      "code": "P011B",
      "zh-cn": "发动机冷却液温度（传感器）/进气温度（传感器）相关性",
      "en-us": "Engine Coolant Temperature/Intake Air Temperature Correlation",
      "sys": "燃油或空气",
      "knowledge": "如果ECU检测到发动机冷却液温度（ECT）传感器跟进气温度（IAT）传感器信号差超过了设定的最大值，该故障码会出现。"
    }
  ],
  "P0807": [
    {
      "scope": "所有汽车制造商",
      "code": "P0807",
      "zh-cn": "离合器位置传感器电路低",
      "en-us": "Clutch Position Sensor Circuit Low",
      "sys": "变速箱",
      "knowledge": "离合器位置传感器的作用是将离合器是否踩下的信息以电信号的形式输送给电子控制单元，作为控制发动机启动和定速巡航系统的重要参数。"
    }
  ],
  "P0991": [
    {
      "scope": "所有汽车制造商",
      "code": "P0991",
      "zh-cn": "变速器液压传感器/开关E电路间歇",
      "en-us": "Transmission Fluid Pressure Sensor/Switch E Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P047B": [
    {
      "scope": "所有汽车制造商",
      "code": "P047B",
      "zh-cn": "排气压力传感器B电路范围/性能",
      "en-us": "Exhaust Pressure Sensor B Circuit Range/Performance",
      "sys": "排放控制",
      "knowledge": "排气压力传感器的作用是将排气系统压力以电信号的形式输送给电子控制单元（ECU）。如果ECU检测到排气压力传感器A电路电压出错，该故障码会出现。"
    }
  ],
  "P0651": [
    {
      "scope": "所有汽车制造商",
      "code": "P0651",
      "zh-cn": "传感器参考电压B电路/开路",
      "en-us": "Sensor Reference Voltage B Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到5伏参考电压电路B出错。故障原因包括5伏参考电压电路到某个传感器的电路发生短路或短路，一个或多个传感器发生短路或开路，自动变速器液压传感器故障，电磁阀故障，变速器控制模块故障，变速器输入速度（RPM）传感器故障，变速器输出速度（RPM）传感器故障等。"
    }
  ],
  "P0C13": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C13",
      "zh-cn": "驱动电机A换流器，W相温度过高",
      "en-us": "Drive Motor A Inverter Phase W Over Temperature",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P0606": [
    {
      "scope": "所有汽车制造商",
      "code": "P0606",
      "zh-cn": "控制模块处理器",
      "en-us": "Control Module Processor",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）出错。该故障码也可能是由于非原厂配件的改装引起。该故障码出现后，先删除看是否会再出现。如果很快再出现，的出现大多数情况下意味着电子控制模块需要更换。"
    }
  ],
  "P0B17": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B17",
      "zh-cn": "混合动力电池组电压监控B电路高",
      "en-us": "Hybrid Battery Pack Voltage Sense B Circuit High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0804": [
    {
      "scope": "所有汽车制造商",
      "code": "P0804",
      "zh-cn": "升档（跳档）指示灯控制电路",
      "en-us": "Upshift/Skip Shift Lamp Control Circuit",
      "sys": "变速箱",
      "knowledge": "对于一些大功率的汽车，为提高汽车的燃油效率和降低排放，当条件满足的时候（低速，小油门，车已预热等），跳档电磁阀会阻止挂入2，3档，相当于强制变速杆从1档直接换到4档。这个时候跳档指示灯会亮。P0804显示跳档指示灯控制电路故障。"
    }
  ],
  "P06C0": [
    {
      "scope": "所有汽车制造商",
      "code": "P06C0",
      "zh-cn": "气缸8电热塞电路范围/性能",
      "en-us": "Cylinder 8 Glow Plug Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸8电热塞电路发生故障，则该故障码会出现。"
    }
  ],
  "P06C8": [
    {
      "scope": "所有汽车制造商",
      "code": "P06C8",
      "zh-cn": "气缸4电热塞不正确",
      "en-us": "Cylinder 4 Glow Plug Incorrect",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。该故障码表明气缸4电热塞，其电路，接头，或电热赛控制模块（GPCM）出错。"
    }
  ],
  "P043C": [
    {
      "scope": "所有汽车制造商",
      "code": "P043C",
      "zh-cn": "催化转换器温度传感器电路低 （第2排，传感器2）",
      "en-us": "Catalyst Temperature Sensor Circuit Low (Bank 2, Sensor 2)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器温度传感器电路电压低于校准的最低值。故障原因包括催化转换器温度传感器，电路，接头，或电子控制单元（ECU）故障。"
    }
  ],
  "P069D": [
    {
      "scope": "所有汽车制造商",
      "code": "P069D",
      "zh-cn": "电热塞控制电路高气缸10",
      "en-us": "Cylinder 10 Glow Plug Control Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸10电热塞控制电路电压高于校准的最高值，则该故障码会出现。"
    }
  ],
  "P051F": [
    {
      "scope": "所有汽车制造商",
      "code": "P051F",
      "zh-cn": "曲轴箱强制通风系统过滤器不通畅",
      "en-us": "Positive Crankcase Ventilation Filter Restriction",
      "sys": "车速及怠速控制",
      "knowledge": "曲轴箱强制通风（PCV）系统的作用是将曲轴箱内的窜气（发动机作功燃烧过程的末端，一些未燃混合气在高压力下从活塞环漏入曲轴箱内，业内将这种泄漏称为窜气）通过发动机工作产生的真空导入进气歧管，然后窜气会随着新鲜的空气一起进入汽缸烧掉，从而降低污染提高发动机效率。该故障码表明曲轴箱强制通风系统过滤器阻塞。"
    }
  ],
  "P0283": [
    {
      "scope": "所有汽车制造商",
      "code": "P0283",
      "zh-cn": "第8缸喷油器电路高",
      "en-us": "Cylinder 8 Injector Circuit High",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第8缸喷油器控制电路电压高于校准的最高值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0481": [
    {
      "scope": "所有汽车制造商",
      "code": "P0481",
      "zh-cn": "风扇2控制电路",
      "en-us": "Fan 2 Control Circuit",
      "sys": "排放控制",
      "knowledge": "电子控制单元（ECU）如果发现高速风扇控制电路在接地（风扇开）的情况下，仍有明显电流消耗；或高速风扇控制电路没有接地（风扇关），而探测不到电压时；该故障码会出现。"
    }
  ],
  "P0065": [
    {
      "scope": "所有汽车制造商",
      "code": "P0065",
      "zh-cn": "空气辅助喷油器控制范围/性能",
      "en-us": "Air Assisted Injector Control Range/Performance",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "空气辅助喷油器通过将高压空气导入燃油喷射通道的方式来使喷出的汽油雾更加精细，从而优化汽油燃烧。如果电子控制单元（ECU）检测到空气辅助喷油器控制电路电压超出校准的正常范围，该故障码会出现。故障原因包括空气辅助喷油器电磁阀本身或其电路故障，氧传感器故障，或动力总成控制模块（PCM）故障等。"
    }
  ],
  "P02F1": [
    {
      "scope": "所有汽车制造商",
      "code": "P02F1",
      "zh-cn": "喷油器电路范围/性能 - 气缸4",
      "en-us": "Cylinder 4 Injector Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第4缸喷油器电路出错，该故障码会出现。"
    }
  ],
  "P010B": [
    {
      "scope": "所有汽车制造商",
      "code": "P010B",
      "zh-cn": "空气流量（MAF）传感器B电路范围/性能问题",
      "en-us": "Mass or Volume Air Flow B Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。如果ECU检测空气流量（MAF）传感器信号电压出错，该故障码会出现。"
    }
  ],
  "P0540": [
    {
      "scope": "所有汽车制造商",
      "code": "P0540",
      "zh-cn": "进气加热器A电路",
      "en-us": "Intake Air Heater A Circuit",
      "sys": "车速及怠速控制",
      "knowledge": "进气加热器，也叫歧管进气加热器，其作用是给预热空气进气，以帮助柴油机在寒冷天气的情况下易于启动。该故障码表明电子控制单元（ECU）检测到歧管进气加热器电路（MIAH）电路电压超出校准的正常值。"
    }
  ],
  "P0837": [
    {
      "scope": "所有汽车制造商",
      "code": "P0837",
      "zh-cn": "四轮驱动（4WD）开关电路范围/性能",
      "en-us": "Four Wheel Drive (4WD) Switch Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P063C": [
    {
      "scope": "所有汽车制造商",
      "code": "P063C",
      "zh-cn": "发电机电压监控电路低",
      "en-us": "Generator Voltage Sense Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发电机电压监控电路的作用是将发电机电压信号输送给电子控制单元（ECU），作为控制充电速度和判定发电机是否正常工作的参考依据。该故障码表明电子控制单元（ECU）检测到发电机电压监控电路出错。故障原因包括发电机电压监控电路，发电机，或ECU。"
    }
  ],
  "P0A32": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A32",
      "zh-cn": "驱动电机B温度传感器电路低",
      "en-us": "Drive Motor B Temperature Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "驱动电机B温度传感器电路发生故障。故障原因包括电路，接头，电子控制单元，驱动电机等。有些车辆的驱动电机温度传感器跟驱动电机是一体的。所以，如果确定是该温度传感器本身的问题，有可能需要换掉整个驱动电机。"
    }
  ],
  "P0400": [
    {
      "scope": "所有汽车制造商",
      "code": "P0400",
      "zh-cn": "废气再循环阀A流量",
      "en-us": "Exhaust Gas Recirculation A Flow",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。电子控制单元（ECU）会监控每一个驾驶循环中废气再循环系统（EGR）的工作情况。当电子控制单元（ECU）发现废气再循环（EGR）的流量比基于其他信息的估计值过高或过低时，该故障码会出现。故障原因包括EGR接头，电路故障，EGR阀本身故障，歧管绝对压力（MAP）传感器故障，电子控制模块（PCM或ECM）故障。"
    }
  ],
  "P0054": [
    {
      "scope": "所有汽车制造商",
      "code": "P0054",
      "zh-cn": "热氧传感器加热器电阻 （第1排，传感器2）",
      "en-us": "HO2S Heater Resistance (Bank 1, Sensor 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。该故障码表明加热氧传感器加热器控制电路的电流过低或过高。"
    }
  ],
  "P0215": [
    {
      "scope": "所有汽车制造商",
      "code": "P0215",
      "zh-cn": "发动机关闭电磁阀",
      "en-us": "Engine Shutoff Solenoid",
      "sys": "燃油或空气",
      "knowledge": "发动机断油电磁阀，其电路，接头，或电子控制单元故障。"
    }
  ],
  "P0A7E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A7E",
      "zh-cn": "混合动力电池组温度过高",
      "en-us": "Hybrid Battery Pack Over Temperature",
      "sys": "混合动力系统",
      "knowledge": "控制模块检测到混合动力电池组处于温度过高状态。"
    }
  ],
  "P0170": [
    {
      "scope": "所有汽车制造商",
      "code": "P0170",
      "zh-cn": "燃油修剪（空燃比） （第1排）",
      "en-us": "Fuel Trim (Bank 1)",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。故障原因包括空气流量（MAF）传感器之后的空气泄漏，PCV系统泄漏，氧传感器附近或之前的尾气泄漏，喷油器阻塞或其它燃油系统故障，EGR系统泄漏，MAF传感器受污染（导致电子控制模块低估空气流量），油箱油位太低，或机油标尺没有坐好等。"
    }
  ],
  "P0813": [
    {
      "scope": "所有汽车制造商",
      "code": "P0813",
      "zh-cn": "倒档输出电路",
      "en-us": "Reverse Output Circuit",
      "sys": "变速箱",
      "knowledge": "电子控制单元（ECU）发现当倒档被挂入，挂出时，倒档开关信号没有变化。"
    }
  ],
  "P02D9": [
    {
      "scope": "所有汽车制造商",
      "code": "P02D9",
      "zh-cn": "喷油器补偿学习在最高限气缸7",
      "en-us": "Cylinder 7 Fuel Injector Offset Learning At Max Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第7缸喷油器补偿学习已经达到了最高学习极限，该故障码会出现。"
    }
  ],
  "P0902": [
    {
      "scope": "所有汽车制造商",
      "code": "P0902",
      "zh-cn": "离合器执行器电路低",
      "en-us": "Clutch Actuator Circuit Low",
      "sys": "变速箱",
      "knowledge": "离合器执行器是离合器动作的执行者，其基本功能是分离和结合离合器。机电式离合器执行器以电动机作为动力源，通过控制转速和位置，实现对离合器执行结合过程的精确调节。"
    }
  ],
  "P0B86": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B86",
      "zh-cn": "混合动力电池电压监控P电路",
      "en-us": "Hybrid Battery Voltage Sense P Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P060F": [
    {
      "scope": "所有汽车制造商",
      "code": "P060F",
      "zh-cn": "内部控制模块冷却液温度性能",
      "en-us": "Internal Control Module Coolant Temperature Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。"
    }
  ],
  "P0847": [
    {
      "scope": "所有汽车制造商",
      "code": "P0847",
      "zh-cn": "变速器液压力（TFP）传感器/开关B电路低",
      "en-us": "Transmission Fluid Pressure Sensor/Switch B Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0C09": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C09",
      "zh-cn": "驱动电机B，U-V-W相电路低",
      "en-us": "Drive Motor B Phase U-V-W Circuit Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0795": [
    {
      "scope": "所有汽车制造商",
      "code": "P0795",
      "zh-cn": "压力控制电磁阀C",
      "en-us": "Pressure Control Solenoid C",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。故障原因包括变速器液液面太低，变速器液太脏，变速器液压力控制电磁阀，电路，接头，或控制模块等。"
    }
  ],
  "P0341": [
    {
      "scope": "所有汽车制造商",
      "code": "P0341",
      "zh-cn": "凸轮轴位置（CMP）传感器A电路范围/性能 （第1排或单个传感器）",
      "en-us": "Camshaft Position Sensor A Circuit Range/Performance  (Bank 1 or Single Sensor)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。该故障码表明A（进气/左/前）凸轮轴位置（CMP）传感器电路错误。故障原因包括凸轮轴位置（CMP）传感器电路，接头，其本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0A41": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A41",
      "zh-cn": "驱动电机A位置传感器电路低",
      "en-us": "Drive Motor A Position Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括驱动电机A位置传感器电路，接头，或传感器本身；混合动力驱动电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P07A8": [
    {
      "scope": "所有汽车制造商",
      "code": "P07A8",
      "zh-cn": "变速器摩擦衬片D性能/卡在关的位置",
      "en-us": "Transmission Friction Element D Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0168": [
    {
      "scope": "所有汽车制造商",
      "code": "P0168",
      "zh-cn": "燃油温度太高",
      "en-us": "Fuel Temperature Too High",
      "sys": "燃油或空气",
      "knowledge": "燃油温度传感器负责监控通往燃油泵的燃油温度，以避免因温度过高（120摄氏度）造成蒸气锁现象，而造成对燃油泵或喷油器的破坏。该故障码表明燃油温度在设定的时间段内高于允许的最大值。"
    }
  ],
  "P0679": [
    {
      "scope": "所有汽车制造商",
      "code": "P0679",
      "zh-cn": "气缸9电热塞电路/开路",
      "en-us": "Cylinder 9 Glow Plug Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸9电热塞电路发生故障，该故障码会出现。"
    }
  ],
  "P048F": [
    {
      "scope": "所有汽车制造商",
      "code": "P048F",
      "zh-cn": "排气压力控制阀门位置传感器/开关电路间歇/不稳定",
      "en-us": "Exhaust Pressure Control Valve Position Sensor/Switch Circuit Intermittent/Erratic",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。如果电子控制单元（ECU）检测到排气压力控制阀门位置传感器信号电压突然变化，该故障码会出现。"
    }
  ],
  "P0B2D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B2D",
      "zh-cn": "混合动力电池C电压低",
      "en-us": "Hybrid Battery C Voltage Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0892": [
    {
      "scope": "所有汽车制造商",
      "code": "P0892",
      "zh-cn": "变速器控制模块（TCU）电源继电器监控电路间歇",
      "en-us": "TCU Power Relay Sense Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。控制模块继电器的作用是在点火开关关闭以后，继续保持控制模块的供电，直到控制模块完成关闭过程。"
    }
  ],
  "P0A5C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A5C",
      "zh-cn": "发电机电流传感器电路高",
      "en-us": "Generator Current Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P023B": [
    {
      "scope": "所有汽车制造商",
      "code": "P023B",
      "zh-cn": "增压空气冷却器冷却液泵控制电路低",
      "en-us": "Charge Air Cooler Coolant Pump Control Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。如果增压空气冷却器的冷却液泵控制电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0142": [
    {
      "scope": "所有汽车制造商",
      "code": "P0142",
      "zh-cn": "氧传感器电路（第1排，传感器 3）",
      "en-us": "O2 Sensor Circuit (Bank 1, Sensor 3)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）监控加热氧传感器的电路。当ECU检测到用于测定废气中氧含量的电路有问题时，则该故障码会出现。"
    }
  ],
  "P0C7B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C7B",
      "zh-cn": "发电机换流器电压太高",
      "en-us": "Generator Inverter Voltage Too High",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P0376": [
    {
      "scope": "所有汽车制造商",
      "code": "P0376",
      "zh-cn": "点火正时参考高解析信号B太多脉冲",
      "en-us": "Timing Reference High Resolution Signal B Too Many Pulses",
      "sys": "点火系统",
      "knowledge": "光学传感器通过数位于喷射泵内的传感器盘上的脉冲来为动力总成控制模块（PCM）提供高解析信号。这个信号是PCM控制燃油和正时的一个重要参考依据之一。该故障码的原因包括光学传感器，其电路，接头或PCM."
    }
  ],
  "P0BD9": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BD9",
      "zh-cn": "驱动电机换流器温度传感器D电路高",
      "en-us": "Drive Motor Inverter Temperature Sensor D Circuit High",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P000B": [
    {
      "scope": "所有汽车制造商",
      "code": "P000B",
      "zh-cn": "B凸轮轴位置执行器反应太慢 （第1排）",
      "en-us": "B Camshaft Position Slow Response (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。P000B的故障原因包括排气/右/后凸轮轴调节阀（机油控制阀），其电路，接头，机油太脏或ECU。"
    }
  ],
  "P0988": [
    {
      "scope": "所有汽车制造商",
      "code": "P0988",
      "zh-cn": "变速器液压传感器/开关E电路范围/性能",
      "en-us": "Transmission Fluid Pressure Sensor/Switch E Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0280": [
    {
      "scope": "所有汽车制造商",
      "code": "P0280",
      "zh-cn": "第7缸喷油器电路高",
      "en-us": "Cylinder 7 Injector Circuit High",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第7缸喷油器控制电路电压高于校准的最高值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P012C": [
    {
      "scope": "所有汽车制造商",
      "code": "P012C",
      "zh-cn": "涡轮/超级增压器进口压力传感器 - 电路低",
      "en-us": "Turbocharger/Supercharger Inlet Pressure Sensor - Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。该故障码表明进口压力传感器（节气门阀下游）电路电压低于最低校准值（0.25伏）。该故障码对有些车辆可能是歧管绝对压力（MAP）传感器的问题。"
    }
  ],
  "P0025": [
    {
      "scope": "所有汽车制造商",
      "code": "P0025",
      "zh-cn": "B 凸轮轴位置执行器 - 正时滞后 （第2排）",
      "en-us": "B Camshaft Position - Timing Over-Retarded (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。P0025的故障原因包括B排气/右/后凸轮轴正时没有设定好，凸轮轴过前原理机械性卡住，或者是执行器阀门卡在开的位置。"
    }
  ],
  "P0824": [
    {
      "scope": "所有汽车制造商",
      "code": "P0824",
      "zh-cn": "变速杆Y位置传感器电路间歇",
      "en-us": "Gear Lever Y Position Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0BFE": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BFE",
      "zh-cn": "驱动电机B，U-V-W相电流传感器相关性",
      "en-us": "Drive Motor B Phase U-V-W Current Sensor Correlation",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0188": [
    {
      "scope": "所有汽车制造商",
      "code": "P0188",
      "zh-cn": "燃油温度传感器B电路高",
      "en-us": "Fuel Temperature Sensor B Circuit High",
      "sys": "燃油或空气",
      "knowledge": "燃油温度传感器负责监控通往燃油泵的燃油温度，以避免因温度过高（120摄氏度）造成蒸气锁现象，而造成对燃油泵或喷油器的破坏。电子控制单元（ECU）持续监测燃油温度传感器信号电压。如果这个电压在设定时间段里高于最高校准值（4.5伏或-43摄氏度），则该故障码会出现。"
    }
  ],
  "P0BDF": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BDF",
      "zh-cn": "驱动电机换流器温度传感器E电路间歇/不稳定",
      "en-us": "Drive Motor Inverter Temperature Sensor E Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0351": [
    {
      "scope": "所有汽车制造商",
      "code": "P0351",
      "zh-cn": "点火线圈A主/次电路",
      "en-us": "Ignition Coil A Primary/Secondary Circuit",
      "sys": "点火系统",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。电子控制单元（ECU）持续监测每个点火主电路。如果ECU没有收到有效的来自点火模块（集成在ECU）的点火诊断监控器（IDM）脉冲信号，该故障码会出现。故障原因包括点火启动/运行电路，点火线圈电路，点火线圈本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P02DB": [
    {
      "scope": "所有汽车制造商",
      "code": "P02DB",
      "zh-cn": "喷油器补偿学习在最高限气缸8",
      "en-us": "Cylinder 8 Fuel Injector Offset Learning At Max Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第8缸喷油器补偿学习已经达到了最高学习极限，该故障码会出现。"
    }
  ],
  "P0833": [
    {
      "scope": "所有汽车制造商",
      "code": "P0833",
      "zh-cn": "离合器踏板开关B电路",
      "en-us": "Clutch Pedal Switch B Circuit",
      "sys": "变速箱",
      "knowledge": "离合器踏板开关的作用是将离合器是否踩下的信息以电信号的形式输送给电子控制单元，作为控制发动机启动和定速巡航系统的重要参数。"
    }
  ],
  "P0BA2": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BA2",
      "zh-cn": "混合动力电池电压监控U电路高",
      "en-us": "Hybrid Battery Voltage Sense U Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0992": [
    {
      "scope": "所有汽车制造商",
      "code": "P0992",
      "zh-cn": "变速器液压传感器/开关F电路",
      "en-us": "Transmission Fluid Pressure Sensor/Switch F Circuit",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0AF8": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AF8",
      "zh-cn": "混合动力电池系统电压",
      "en-us": "Hybrid Battery System Voltage",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0A84": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A84",
      "zh-cn": "混合动力电池组冷却风扇1控制电路控制电路低",
      "en-us": "Hybrid Battery Pack Cooling Fan 1 Control Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "风扇电机控制器负责调节混合动力电池组冷却风扇的电压。如果冷却风扇1控制电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0676": [
    {
      "scope": "所有汽车制造商",
      "code": "P0676",
      "zh-cn": "气缸6电热塞电路/开路",
      "en-us": "Cylinder 6 Glow Plug Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸6电热塞电路发生故障，该故障码会出现。"
    }
  ],
  "P0A76": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A76",
      "zh-cn": "发电机W相电流低",
      "en-us": "Generator Phase W Current Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控发电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P047E": [
    {
      "scope": "所有汽车制造商",
      "code": "P047E",
      "zh-cn": "排气压力传感器B电路间歇/不稳定",
      "en-us": "Exhaust Pressure Sensor B Circuit Intermittent/Erratic",
      "sys": "排放控制",
      "knowledge": "排气压力传感器的作用是将排气系统压力以电信号的形式输送给电子控制单元（ECU）。如果ECU检测到排气压力传感器A信号电路电压突然变化，该故障码会出现。"
    }
  ],
  "P0C11": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C11",
      "zh-cn": "驱动电机A换流器，U相温度过高",
      "en-us": "Drive Motor A Inverter Phase U Over Temperature",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P04A6": [
    {
      "scope": "所有汽车制造商",
      "code": "P04A6",
      "zh-cn": "排气压力控制阀门B位置传感器/开关电路",
      "en-us": "Exhaust Pressure Control Valve B Position Sensor/Switch Circuit",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。如果电子控制单元（ECU）检测到排气压力控制阀门位置传感器信号电压超出校准的正常值，该故障码会出现。"
    }
  ],
  "P0446": [
    {
      "scope": "所有汽车制造商",
      "code": "P0446",
      "zh-cn": "蒸发排放系统通风控制电路",
      "en-us": "Evaporative Emission System Vent Control Circuit",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。如果电子控制单元（ECU）检测到蒸发排放系统通风电磁阀控制电路电压超出正常校准范围，则该故障码会出现。"
    }
  ],
  "P0368": [
    {
      "scope": "所有汽车制造商",
      "code": "P0368",
      "zh-cn": "凸轮轴位置（CMP）传感器B电路高 （第1排）",
      "en-us": "Camshaft Position Sensor B Circuit High (Bank 1)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。该故障码表明B（排气/右/后）凸轮轴位置（CMP）传感器信号电压高于校准的最高值。故障原因包括凸轮轴位置（CMP）传感器电路，接头，其本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0393": [
    {
      "scope": "所有汽车制造商",
      "code": "P0393",
      "zh-cn": "凸轮轴位置（CMP）传感器B电路高 （第2排）",
      "en-us": "Camshaft Position Sensor B Circuit High (Bank 2)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。如果电子控制单元（ECU）检测到凸轮轴传感器B电路电压高于校准的最高值，该故障码会出现。故障原因包括凸轮轴位置（CMP）传感器电路，接头，其本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0596": [
    {
      "scope": "所有汽车制造商",
      "code": "P0596",
      "zh-cn": "定速巡航系统伺服控制电路高",
      "en-us": "Cruise Control Servo Control Circuit High",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航伺服器的作用是按照巡航控制模块的指令控制节气门的开度（车速低于设定值，加大节气门开度；车速高于设定值，减小节气门开度），从而实现定速巡航功能。该故障码表明定速巡航系统伺服控制电路电压高于校准的最高值。故障原因包括伺服控制电磁阀，电路，接头等。"
    }
  ],
  "P0523": [
    {
      "scope": "所有汽车制造商",
      "code": "P0523",
      "zh-cn": "机油压力传感器/开关电路高",
      "en-us": "Engine Oil Pressure Sensor/Switch High",
      "sys": "车速及怠速控制",
      "knowledge": "机油压力传感器的作用是将机油压力以电信号的形式输送给电子控制单元（ECU），在压力不够的情况下，ECU会在仪表盘发出报警信号。如果电子控制单元（ECU）检测到机油压力传感器信号电压高于4.9伏，该故障码会出现。故障原因包括机油压力传感器，其电路，接头，电子控制单元（ECU）。"
    }
  ],
  "P0965": [
    {
      "scope": "所有汽车制造商",
      "code": "P0965",
      "zh-cn": "压力控制电磁阀B控制电路范围/性能",
      "en-us": "Pressure Control Solenoid B Control Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。该故障码的原因包括压力控制电磁阀本身，电路，接头等。同时要注意，变速箱控制电磁阀故障有些情况下并不并不是因为电子问题，而是由于管路阻塞或者是机械方面的问题。好多时候，仅仅因为变速箱油太脏就会造成很多这方面的故障。"
    }
  ],
  "P02EF": [
    {
      "scope": "所有汽车制造商",
      "code": "P02EF",
      "zh-cn": "喷油器电路范围/性能 - 气缸2",
      "en-us": "Cylinder 2 Injector Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第2缸喷油器电路出错，该故障码会出现。"
    }
  ],
  "P065B": [
    {
      "scope": "所有汽车制造商",
      "code": "P065B",
      "zh-cn": "发电机控制电路范围/性能",
      "en-us": "Generator Control Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）通过发电机开启信号电路来控制发电机。当需要发电机运转的时候，ECU会通过发电机开启信号电路来发送1个5伏的信号到电压调节器。电压调节器收到这个信号后便会开始控制发电机磁场电路。如果故障检测电路发现发电机开启电路电压不正确，该故障码会出现。电压调节器也可能检测到错误而显示该故障码。故障原因包括发电机，电路，接头，或电子控制单元。"
    }
  ],
  "P0668": [
    {
      "scope": "所有汽车制造商",
      "code": "P0668",
      "zh-cn": "动力总成控制模块（PCM）/发动机控制模块（ECM）/变速器控制模块（TCU）内部温度传感器A电路低",
      "en-us": "PCM/ECM/TCU Internal Temperature Sensor A Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。该故障码表明控制模块内部温度传感器信号电路电压低于校准的最低值。故障原因内部温度传感器，电路，接头，或控制模块。"
    }
  ],
  "P0690": [
    {
      "scope": "所有汽车制造商",
      "code": "P0690",
      "zh-cn": "发动机控制模块（ECM）/动力总成控制模块（PCM）电源继电器监控电路高",
      "en-us": "ECM/PCM Power Relay Sense Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。发动机控制模块继电器的作用是在点火开关关闭以后，继续保持发动机控制模块的供电，直到发动机控制模块完成关闭过程。被动防盗系统（PATS）显示钥匙处于OFF（关），ACC（附件），LOCK（锁）的位置，而点火开关位置运行（ISP-R）电路显示ON（运行）或START（启动）."
    }
  ],
  "P0687": [
    {
      "scope": "所有汽车制造商",
      "code": "P0687",
      "zh-cn": "发动机控制模块（ECM）/动力总成控制模块（PCM）电源继电器控制电路高",
      "en-us": "ECM/PCM Power Relay Control Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。发动机控制模块继电器的作用是在点火开关关闭以后，继续保持发动机控制模块的供电，直到发动机控制模块完成关闭过程。如果电子控制单元（ECU）检测到ECU电源继电器控制电路电压高于校准的最高值，该故障码会出现。故障原因包括ECU继电器控制电路，ECU继电器，ECU等。"
    }
  ],
  "P0554": [
    {
      "scope": "所有汽车制造商",
      "code": "P0554",
      "zh-cn": "动力转向压力传感器/开关电路间歇",
      "en-us": "Power Steering Pressure Sensor/Switch Circuit Intermittent",
      "sys": "车速及怠速控制",
      "knowledge": "动力转向压力（PSP）传感器根据电位器的原理将动力转向负载压力以电压信号的形式传输给电子控制单元（ECU）。如果负载压力过大，必要的时候ECU会提高发动机怠速，关闭空调压缩机，以防止发动机死火。如果电子控制单元（ECU）检测到动力转向压力传感器信号电压突然变化，该故障码会出现。"
    }
  ],
  "P0AC5": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AC5",
      "zh-cn": "混合动力电池温度传感器B电路",
      "en-us": "Hybrid Battery Temperature Sensor B Circuit",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压超出正常范围，该故障码会出现。"
    }
  ],
  "P0B32": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B32",
      "zh-cn": "混合动力电池D电压高",
      "en-us": "Hybrid Battery D Voltage High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0169": [
    {
      "scope": "所有汽车制造商",
      "code": "P0169",
      "zh-cn": "不正确的燃油组分",
      "en-us": "Incorrect Fuel Composition",
      "sys": "燃油或空气",
      "knowledge": "燃油组分传感器的作用是将汽油中的乙醇含量以电信号的形式传输给电子控制单元（ECU），作为修改喷油器脉冲宽度和点火正时的依据。"
    }
  ],
  "P0175": [
    {
      "scope": "所有汽车制造商",
      "code": "P0175",
      "zh-cn": "系统（空燃比）太浓 （第2排）",
      "en-us": "System Too Rich (Bank 2)",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果自适应燃油控制系统已经达到了补偿极限，而空燃比仍然很浓的话，该故障码就会出现。故障原因包括进气流量传感器或歧管绝对压力（MAP）传感器故障，燃油压力太高，燃油压力调节器故障，喷油器故障，氧传感器故障，凸轮轴正时错误，机油过满，蒸发排放系统错误，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0BDC": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BDC",
      "zh-cn": "驱动电机换流器温度传感器E电路范围/性能",
      "en-us": "Drive Motor Inverter Temperature Sensor E Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0B61": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B61",
      "zh-cn": "混合动力电池电压监控H电路高",
      "en-us": "Hybrid Battery Voltage Sense H Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0C3B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C3B",
      "zh-cn": "直流/直流换流器温度传感器A电路高",
      "en-us": "DC/DC Converter Temperature Sensor A High",
      "sys": "混合动力系统",
      "knowledge": "直流/直流转换器将HV电池的直流高压（200-400伏特）转化成12伏特电压，从而可以给辅助电池充电并给车内附件供电。"
    }
  ],
  "P0941": [
    {
      "scope": "所有汽车制造商",
      "code": "P0941",
      "zh-cn": "液压油温度传感器电路间歇",
      "en-us": "Hydraulic Oil Temperature Sensor Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0882": [
    {
      "scope": "所有汽车制造商",
      "code": "P0882",
      "zh-cn": "变速器控制模块（TCU）电源输入信号低",
      "en-us": "TCU Power Input Signal Low",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。"
    }
  ],
  "P0A5F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A5F",
      "zh-cn": "驱动电机A，U相电流高",
      "en-us": "Drive Motor A Phase U Current High",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0912": [
    {
      "scope": "所有汽车制造商",
      "code": "P0912",
      "zh-cn": "门选择执行器电路低",
      "en-us": "Gate Select Actuator Circuit Low",
      "sys": "变速箱",
      "knowledge": "门选择执行器（监控换档杆左/右位置）电路故障。"
    }
  ],
  "P0385": [
    {
      "scope": "所有汽车制造商",
      "code": "P0385",
      "zh-cn": "曲轴位置（CKP）传感器B电路 （第1排）",
      "en-us": "Crankshaft Position Sensor B Circuit",
      "sys": "点火系统",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。曲轴位置（CKP）传感器(也叫上止点传感器），其作用是检测上止点（TDC）信号、曲轴转角信号和发动机转速信号，并将其输入计算机，从而使计算机能按气缸的点火顺序发出最佳点火时刻指令。如果电子控制单元（ECU）检测到曲轴传感器B电路电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P0A0A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A0A",
      "zh-cn": "高压系统联锁电路",
      "en-us": "High Voltage System Interlock Circuit",
      "sys": "混合动力系统",
      "knowledge": "高压系统联锁的功能是：在当车辆静止时，如果安全装置有问题（举例说，充电接头或转化器没有盖好），就会关闭系统主继电器。如果控制模块检测到高压联锁电路故障，该故障码会出现。"
    }
  ],
  "P065D": [
    {
      "scope": "所有汽车制造商",
      "code": "P065D",
      "zh-cn": "还原剂系统故障指示灯控制电路",
      "en-us": "Reductant System Malfunction Lamp Control Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "还原剂系统故障指示灯，电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P02CE": [
    {
      "scope": "所有汽车制造商",
      "code": "P02CE",
      "zh-cn": "喷油器补偿学习在最低限气缸2",
      "en-us": "Cylinder 2 Fuel Injector Offset Learning At Min Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第2缸喷油器补偿学习已经达到了最低学习极限，该故障码会出现。"
    }
  ],
  "P0A0E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A0E",
      "zh-cn": "高压系统联锁电路间歇",
      "en-us": "High Voltage System Interlock Circuit Intermittent",
      "sys": "混合动力系统",
      "knowledge": "高压系统联锁的功能是：在当车辆静止时，如果安全装置有问题（举例说，充电接头或转化器没有盖好），就会关闭系统主继电器。如果控制模块检测到高压联锁电路故障，该故障码会出现。"
    }
  ],
  "P0818": [
    {
      "scope": "所有汽车制造商",
      "code": "P0818",
      "zh-cn": "传动线断开开关输入电路",
      "en-us": "Driveline Disconnect Switch Input Circuit",
      "sys": "变速箱",
      "knowledge": "电子控制模块（ECU）从传输空档位置开关检测到该信号。该故障码表明传输空档位置开关卡在开的位置。故障原因包括传输空档位置开关电路短路，传输空档位置开关本身，电子控制模块等。"
    }
  ],
  "P0524": [
    {
      "scope": "所有汽车制造商",
      "code": "P0524",
      "zh-cn": "机油压力太低",
      "en-us": "Engine Oil Pressure Too Low",
      "sys": "车速及怠速控制",
      "knowledge": "机油压力传感器的作用是将机油压力以电信号的形式输送给电子控制单元（ECU），在压力不够的情况下，ECU会在仪表盘发出报警信号。该故障码表明机油压力没有达到基于机油温度和发动机速度预期的压力值。故障原因包括机油泵，机油太少等。"
    }
  ],
  "P0910": [
    {
      "scope": "所有汽车制造商",
      "code": "P0910",
      "zh-cn": "门选择执行器电路/开路",
      "en-us": "Gate Select Actuator Circuit/Open",
      "sys": "变速箱",
      "knowledge": "门选择执行器（监控换档杆左/右位置）电路故障。"
    }
  ],
  "P02BA": [
    {
      "scope": "所有汽车制造商",
      "code": "P02BA",
      "zh-cn": "燃油（空燃比）修剪在最高限 - 气缸9",
      "en-us": "Cylinder 9 - Fuel Trim at Max Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最大极限超过一定时间，该故障码会出现。"
    }
  ],
  "P070E": [
    {
      "scope": "所有汽车制造商",
      "code": "P070E",
      "zh-cn": "变速器液位传感器电路间歇/不稳定",
      "en-us": "Transmission Fluid Level Sensor Circuit intermittent/Erratic",
      "sys": "变速箱",
      "knowledge": "变速器液位传感器的作用是将变速器液液面以电信号的形式输送给电子控制单元（ECU）。该故障码表明变速器液位传感器信号电路电压突然变化。故障原因包括变速器液位传感器，电路，接头，或ECU。"
    }
  ],
  "P0BE6": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BE6",
      "zh-cn": "驱动电机A，U相电流传感器电路范围/性能",
      "en-us": "Drive Motor A Phase U Current Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0B7B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B7B",
      "zh-cn": "混合动力电池电压监控M电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense M Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0061": [
    {
      "scope": "所有汽车制造商",
      "code": "P0061",
      "zh-cn": "热氧传感器加热器电阻 （第2排，传感器3）",
      "en-us": "HO2S Heater Resistance (Bank 2, Sensor 3)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。如果加热氧传感器加热器控制电路的电流过低或过高，该故障码会出现。"
    }
  ],
  "P0570": [
    {
      "scope": "所有汽车制造商",
      "code": "P0570",
      "zh-cn": "定速巡航系统 - ACCEL（加速） - 信号故障",
      "en-us": "Cruise Control Accelerate Signal",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。故障原因包括定速巡航加速开关，电路，接头，以及电子控制单元（ECU）。"
    }
  ],
  "P0A30": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A30",
      "zh-cn": "驱动电机B温度传感器电路",
      "en-us": "Drive Motor B Temperature Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "驱动电机B温度传感器电路发生故障。故障原因包括电路，接头，电子控制单元，驱动电机等。有些车辆的驱动电机温度传感器跟驱动电机是一体的。所以，如果确定是该温度传感器本身的问题，有可能需要换掉整个驱动电机。"
    }
  ],
  "P013C": [
    {
      "scope": "所有汽车制造商",
      "code": "P013C",
      "zh-cn": "氧传感器慢响应 - （空燃比）浓到稀 （第2排，传感器 2）",
      "en-us": "O2 Sensor Slow Response - Rich to Lean (Bank 2, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。如果电子控制单元（ECU）发现在空燃比由浓变稀的过程中，没有监测到可以接受的电压变化速率的话，该故障码就会出现。"
    }
  ],
  "P0B92": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B92",
      "zh-cn": "混合动力电池电压监控R电路低",
      "en-us": "Hybrid Battery Voltage Sense R Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0235": [
    {
      "scope": "所有汽车制造商",
      "code": "P0235",
      "zh-cn": "涡轮/超级增压器增压传感器A电路",
      "en-us": "Turbocharger/Supercharger Boost Sensor A Circuit",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。增压传感器，也叫增压压力传感器（BPS），其作用是将增压压力以电信号的形式传输给电子控制单元（ECU）。如果ECU检测到增压传感器（BPS）信号超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P012D": [
    {
      "scope": "所有汽车制造商",
      "code": "P012D",
      "zh-cn": "涡轮/超级增压器进口压力传感器- 电路高",
      "en-us": "Turbocharger/Supercharger Inlet Pressure Sensor - Circuit High",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。该故障码表明进口压力传感器（节气门阀下游）电路电压高于最高校准值（5.0伏）。该故障码对有些车辆可能是歧管绝对压力（MAP）传感器的问题。"
    }
  ],
  "P083D": [
    {
      "scope": "所有汽车制造商",
      "code": "P083D",
      "zh-cn": "变速器液压力（TFP）传感器/开关G电路高",
      "en-us": "Transmission Fluid Pressure Sensor/Switch G Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P02E3": [
    {
      "scope": "所有汽车制造商",
      "code": "P02E3",
      "zh-cn": "柴油机进气流量控制电路高",
      "en-us": "Diesel Intake Air Flow Control Circuit High",
      "sys": "燃油或空气",
      "knowledge": "柴油机进气流量控制系统通过对节气门开启角度的自动控制并与切向气道或螺旋气道的配合使用来形成有效的进气涡流，同时对进气涡流的强度进行自动控制，有效地改善了发动机的燃烧，从而优化了发动机动力性，经济性等性能指标。"
    }
  ],
  "P0611": [
    {
      "scope": "所有汽车制造商",
      "code": "P0611",
      "zh-cn": "喷油器控制模块性能",
      "en-us": "Fuel Injector Control Module Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "喷油嘴控制模块（FICM）负责根据来自电子控制模块（ECU）的燃油和正时信息来控制喷油嘴电磁阀。电子控制单元（ECU）通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。P0611表明喷油器控制模块（FICM）发生故障。"
    }
  ],
  "P0714": [
    {
      "scope": "所有汽车制造商",
      "code": "P0714",
      "zh-cn": "变速器液温传感器A电路间歇",
      "en-us": "Transmission Fluid Temperature Sensor A Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "变速器液温度（TFT）传感器依据热敏电阻的原理将变速器液温度以电信号的形式传送到电子控制单元（ECU）。其主要作用是当温度过高时，变速器控制模块（TCU）会降挡减速。对于有些新型汽车，TCU运用此温度信号判断变速器液粘度，从而调整管路压力和电磁阀压力。如果电子控制单元（ECU）检测到变速器液温度（TFT）传感器信号电压突然变化，该故障码会出现。故障原因包括TFT传感器本身或其电路或接头故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0097": [
    {
      "scope": "所有汽车制造商",
      "code": "P0097",
      "zh-cn": "进气温度（IAT）传感器2电路低 （第1排）",
      "en-us": "Intake Air Temperature Sensor 2 Circuit Low (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。如果电子控制单元（ECU）检测到进气温度（IAT）传感器信号电压低于自检的最小值（0.2伏或121摄氏度），该故障码会出现。"
    }
  ],
  "P0020": [
    {
      "scope": "所有汽车制造商",
      "code": "P0020",
      "zh-cn": "A 凸轮轴位置执行器电路/开路 （第2排）",
      "en-us": "A Camshaft Position Actuator Circuit/Open (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。P0020的故障原因包括A进气/左/前凸轮轴调节阀（机油控制阀），其电路，接头，机油太脏，或ECU。"
    }
  ],
  "P062E": [
    {
      "scope": "所有汽车制造商",
      "code": "P062E",
      "zh-cn": "喷油器驱动器电路性能（第2排）",
      "en-us": "Fuel Injector Driver Circuit Performance (Bank 2)",
      "sys": "计算机或辅助输出电路",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器驱动器电路短路到接地或短路到正极，该故障码会出现。"
    }
  ],
  "P0A5B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A5B",
      "zh-cn": "发电机电流传感器电路低",
      "en-us": "Generator Current Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0184": [
    {
      "scope": "所有汽车制造商",
      "code": "P0184",
      "zh-cn": "燃油温度传感器A电路间歇",
      "en-us": "Fuel Temperature Sensor A Circuit Intermittent",
      "sys": "燃油或空气",
      "knowledge": "燃油温度传感器负责监控通往燃油泵的燃油温度，以避免因温度过高（120摄氏度）造成蒸气锁现象，而造成对燃油泵或喷油器的破坏。电子控制单元（ECU）持续监测燃油温度传感器信号电压。如果这个值发生间歇性故障，则检测失败。"
    }
  ],
  "P069C": [
    {
      "scope": "所有汽车制造商",
      "code": "P069C",
      "zh-cn": "电热塞控制电路低气缸10",
      "en-us": "Cylinder 10 Glow Plug Control Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸10电热塞控制电路电压低于校准的最低值，则该故障码会出现。"
    }
  ],
  "P0415": [
    {
      "scope": "所有汽车制造商",
      "code": "P0415",
      "zh-cn": "二次空气喷射系统切换阀B电路故障",
      "en-us": "Secondary Air Injection System Switching Valve B Circuit",
      "sys": "排放控制",
      "knowledge": "在发动机刚刚启动时，二次空气喷射系统通过往排气歧管强制输入空气来氧化产生的碳氢化合物，一氧化碳等有害气体。这个过程也同时加速了催化转换器的暖化过程。如果电子控制单元（ECU）检测到二次空气喷射系统控制电磁阀电路有开路或短路的情况，该故障码会出现。"
    }
  ],
  "P0267": [
    {
      "scope": "所有汽车制造商",
      "code": "P0267",
      "zh-cn": "第3缸喷油器电路低",
      "en-us": "Cylinder 3 Injector Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第3缸喷油器控制电路电压低于校准的最低值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0650": [
    {
      "scope": "所有汽车制造商",
      "code": "P0650",
      "zh-cn": "故障指示灯（MIL）控制电路",
      "en-us": "Malfunction Indicator Lamp (MIL) Control Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "故障指示灯（MIL）也叫检查引擎灯，其作用是当控制模块检测到故障时，点亮仪表盘上的一个黄色或红色的发动机符号。故障原因包括故障指示灯（MIL），电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P0930": [
    {
      "scope": "所有汽车制造商",
      "code": "P0930",
      "zh-cn": "换档锁止电磁阀/执行器控制电路A低",
      "en-us": "Gear Shift Lock Solenoid/Actuator Control Circuit A Low",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P06B9": [
    {
      "scope": "所有汽车制造商",
      "code": "P06B9",
      "zh-cn": "气缸1电热塞电路范围/性能",
      "en-us": "Cylinder 1 Glow Plug Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸1电热塞电路发生故障，则该故障码会出现。"
    }
  ],
  "P0C87": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C87",
      "zh-cn": "混合动力电池温度传感器G/H相关性",
      "en-us": "Hybrid Battery Temperature Sensor G/H Correlation",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器G/H的信号差超出了校准的最大极限，该故障码会出现。"
    }
  ],
  "P0BE7": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BE7",
      "zh-cn": "驱动电机A，U相电流传感器电路低",
      "en-us": "Drive Motor A Phase U Current Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P051D": [
    {
      "scope": "所有汽车制造商",
      "code": "P051D",
      "zh-cn": "曲轴箱压力传感器电路高",
      "en-us": "Crankcase Pressure Sensor Circuit High",
      "sys": "车速及怠速控制",
      "knowledge": "曲轴箱压力传感器的作用是将曲轴箱内的压力以电信号的形式输送给电子控制单元（ECU），以检测曲轴箱强制通风系统的工作状态。如果ECU检测到曲轴箱压力传感器信号电路电压高于校准的最高，该故障码会出现。"
    }
  ],
  "P0967": [
    {
      "scope": "所有汽车制造商",
      "code": "P0967",
      "zh-cn": "压力控制电磁阀B控制电路高",
      "en-us": "Pressure Control Solenoid B Control Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。该故障码的原因包括压力控制电磁阀本身，电路，接头等。同时要注意，变速箱控制电磁阀故障有些情况下并不并不是因为电子问题，而是由于管路阻塞或者是机械方面的问题。好多时候，仅仅因为变速箱油太脏就会造成很多这方面的故障。"
    }
  ],
  "P0ADC": [
    {
      "scope": "所有汽车制造商",
      "code": "P0ADC",
      "zh-cn": "混合动力电池正极接触器控制电路高",
      "en-us": "Hybrid Battery Positive Contactor Control Circuit High",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果混合动力电子控制单元发现第2系统主继电器（SMR）发生故障，该故障码会出现。"
    }
  ],
  "P002E": [
    {
      "scope": "所有汽车制造商",
      "code": "P002E",
      "zh-cn": "B 凸轮轴形面控制电路低 （第2排）",
      "en-us": "B  Camshaft Profile Control Circuit Low (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。该故障码表明B（排气/右/后）凸轮轴形面控制电路电压低于校准的最低值。"
    }
  ],
  "P0913": [
    {
      "scope": "所有汽车制造商",
      "code": "P0913",
      "zh-cn": "门选择执行器电路高",
      "en-us": "Gate Select Actuator Circuit High",
      "sys": "变速箱",
      "knowledge": "门选择执行器（监控换档杆左/右位置）电路故障。"
    }
  ],
  "P092D": [
    {
      "scope": "所有汽车制造商",
      "code": "P092D",
      "zh-cn": "换档锁止电磁阀/执行器控制电路B高",
      "en-us": "Gear Shift Lock Solenoid/Actuator Control Circuit B High",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P065E": [
    {
      "scope": "所有汽车制造商",
      "code": "P065E",
      "zh-cn": "进气歧管调谐阀性能 （第1排）",
      "en-us": "Intake Manifold Tuning Valve Performance (Bank 1)",
      "sys": "计算机或辅助输出电路",
      "knowledge": "如果进气歧管通路（runner）的长度最佳，气门关闭所产生的压力波会帮助将油气混合物导入发动机。问题是发动机不同转速对应的最佳进气歧管通路长度也不同。歧管调谐阀（MTV）的作用就是根据发动机转速，将进气导入不同长度的进气歧管通路，以此来优化发动机在不同转速时的扭矩。该故障码表明进气歧管调谐阀故障。"
    }
  ],
  "P07B6": [
    {
      "scope": "所有汽车制造商",
      "code": "P07B6",
      "zh-cn": "变速器驻车档位置传感器/开关A电路性能/高",
      "en-us": "Transmission Park Position Sensor/Switch A Circuit Performance/High",
      "sys": "变速箱",
      "knowledge": "驻车档位置传感器的作用是将变速杆是否在驻车档的位置的信号输送给电子控制单元（ECU）。如果ECU检测到驻车档位置传感器电路出错，该故障码会出现。"
    }
  ],
  "P0664": [
    {
      "scope": "所有汽车制造商",
      "code": "P0664",
      "zh-cn": "进气歧管调谐阀控制电路低（第2排）",
      "en-us": "Intake Manifold Tuning Valve Control Circuit Low (Bank 2)",
      "sys": "计算机或辅助输出电路",
      "knowledge": "如果进气歧管通路（runner）的长度最佳，气门关闭所产生的压力波会帮助将油气混合物导入发动机。问题是发动机不同转速对应的最佳进气歧管通路长度也不同。歧管调谐阀（MTV）的作用就是根据发动机转速，将进气导入不同长度的进气歧管通路，以此来优化发动机在不同转速时的扭矩。如果电子控制单元（ECU）在自检时检测到进气歧管调谐阀控制电路电压低于校准的最低值，则该故障码会出现。"
    }
  ],
  "P0709": [
    {
      "scope": "所有汽车制造商",
      "code": "P0709",
      "zh-cn": "变速器档位传感器A电路间歇 （PRNDL输入）",
      "en-us": "Transmission Range Sensor A Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "变速器挡位传感器负责将变速器杆的位置（PRNDL）以电信号的形式输送给电子控制单元（ECU）。如果ECU检测到变速器档位（TR）传感器信号间歇，该故障码会出现。造成该故障码最常见的原因往往是变速器档位传感器接头，电路，或本身的问题。"
    }
  ],
  "P0384": [
    {
      "scope": "所有汽车制造商",
      "code": "P0384",
      "zh-cn": "电热塞控制模块控制电路高",
      "en-us": "Glow Plug Control Module Control Circuit High",
      "sys": "点火系统",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到电热塞控制模块电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P04A1": [
    {
      "scope": "所有汽车制造商",
      "code": "P04A1",
      "zh-cn": "排气压力控制阀门B低",
      "en-us": "Exhaust Pressure Control Valve B Low",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。电子控制单元（ECU）检测到排气压力控制阀A电路电压低于校准的最低值。故障原因包括排气翻板阀或其电路。"
    }
  ],
  "P061C": [
    {
      "scope": "所有汽车制造商",
      "code": "P061C",
      "zh-cn": "内部控制模块-发动机转速性能",
      "en-us": "Internal Control Module Engine RPM Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P0291": [
    {
      "scope": "所有汽车制造商",
      "code": "P0291",
      "zh-cn": "第11缸喷油器电路低",
      "en-us": "Cylinder 11 Injector Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第11缸喷油器控制电路电压低于校准的最低值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P065F": [
    {
      "scope": "所有汽车制造商",
      "code": "P065F",
      "zh-cn": "进气歧管调谐阀性能 （第2排）",
      "en-us": "Intake Manifold Tuning Valve Performance (Bank 2)",
      "sys": "计算机或辅助输出电路",
      "knowledge": "如果进气歧管通路（runner）的长度最佳，气门关闭所产生的压力波会帮助将油气混合物导入发动机。问题是发动机不同转速对应的最佳进气歧管通路长度也不同。歧管调谐阀（MTV）的作用就是根据发动机转速，将进气导入不同长度的进气歧管通路，以此来优化发动机在不同转速时的扭矩。该故障码表明进气歧管调谐阀故障。"
    }
  ],
  "P0914": [
    {
      "scope": "所有汽车制造商",
      "code": "P0914",
      "zh-cn": "换档位置电路",
      "en-us": "Gear Shift Position Circuit",
      "sys": "变速箱",
      "knowledge": "换档位置（监控换档杆向前/向后的位置，奇/偶档位）电路故障。"
    }
  ],
  "P0C0F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C0F",
      "zh-cn": "驱动电机B换流器电源供应 - 电路低",
      "en-us": "Drive Motor B Inverter Power Supply Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P0075": [
    {
      "scope": "所有汽车制造商",
      "code": "P0075",
      "zh-cn": "进气阀门控制电磁阀电路 （第1排）",
      "en-us": "Intake Valve Control Solenoid Circuit (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。该故障码表明进气凸轮轴调节阀发生故障。"
    }
  ],
  "P0886": [
    {
      "scope": "所有汽车制造商",
      "code": "P0886",
      "zh-cn": "变速器控制模块（TCU）电源继电器控制电路低",
      "en-us": "TCU Power Relay Control Circuit Low",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。控制模块继电器的作用是在点火开关关闭以后，继续保持控制模块的供电，直到控制模块完成关闭过程。"
    }
  ],
  "P025C": [
    {
      "scope": "所有汽车制造商",
      "code": "P025C",
      "zh-cn": "燃油泵模块控制电路低",
      "en-us": "Fuel Pump Module Control Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "燃油泵控制模块（FPM，or FPCM）是一个通过控制通往燃油泵（一般位于油箱内）电压的方式以实现电子控制模块（ECU）所需的最佳燃油压力的电脑微处理器。"
    }
  ],
  "P0431": [
    {
      "scope": "所有汽车制造商",
      "code": "P0431",
      "zh-cn": "催化转换器暖化过程中效能低于阈值（第2排）",
      "en-us": "Warm Up Catalyst Efficiency Below Threshold (Bank 2)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明电子控制单元（ECU）检测到未达到工作温度之前，催化转换器系统效率低于可以接受的最低值。故障原因包括排气歧管或排气管泄漏，催化转换器自身故障，发动机冷却液温度（ECT）或缸盖温度（CHT）传感器故障，发动机失火或点火正时过于滞后，机油太脏，前部或后部氧传感器故障，燃油系统压力太高等。"
    }
  ],
  "P0BAC": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BAC",
      "zh-cn": "混合动力电池电压监控W电路高",
      "en-us": "Hybrid Battery Voltage Sense W Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P069E": [
    {
      "scope": "所有汽车制造商",
      "code": "P069E",
      "zh-cn": "燃油泵控制模块请求故障指示灯启动",
      "en-us": "Fuel Pump Control Module Requested MIL Illumination",
      "sys": "计算机或辅助输出电路",
      "knowledge": "燃油泵控制模块（FPM，or FPCM）是一个通过控制通往燃油泵（一般位于油箱内）电压的方式以实现电子控制模块（ECU）所需的最佳燃油压力的电脑微处理器。故障指示灯（MIL）也叫检查引擎灯，其作用是当控制模块检测到故障时，点亮仪表盘上的一个黄色或红色的发动机符号。故障原因包括燃油泵，燃油泵控制模块（FPCM），电路，接头，电子控制单元（ECU）等"
    }
  ],
  "P0B7D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B7D",
      "zh-cn": "混合动力电池电压监控N电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense N Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0884": [
    {
      "scope": "所有汽车制造商",
      "code": "P0884",
      "zh-cn": "变速器控制模块（TCU）电源输入信号间歇",
      "en-us": "TCU Power Input Signal Intermittent",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。"
    }
  ],
  "P0B7C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B7C",
      "zh-cn": "混合动力电池电压监控N电路",
      "en-us": "Hybrid Battery Voltage Sense N Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P068B": [
    {
      "scope": "所有汽车制造商",
      "code": "P068B",
      "zh-cn": "发动机控制模块（ECM）/动力总成控制模块（PCM）电源继电器去能性能 - 太晚",
      "en-us": "ECM/PCM Power Relay De-Energized Performance - Too Late",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。发动机控制模块继电器的作用是在点火开关关闭以后，继续保持发动机控制模块的供电，直到发动机控制模块完成关闭过程。"
    }
  ],
  "P0183": [
    {
      "scope": "所有汽车制造商",
      "code": "P0183",
      "zh-cn": "燃油温度传感器A电路高",
      "en-us": "Fuel Temperature Sensor A Circuit High",
      "sys": "燃油或空气",
      "knowledge": "燃油温度传感器负责监控通往燃油泵的燃油温度，以避免因温度过高（120摄氏度）造成蒸气锁现象，而造成对燃油泵或喷油器的破坏。电子控制单元（ECU）持续监测燃油温度传感器信号电压。如果这个电压在设定时间段里高于最高校准值（4.5伏或-43摄氏度），则该故障码会出现。"
    }
  ],
  "P0948": [
    {
      "scope": "所有汽车制造商",
      "code": "P0948",
      "zh-cn": "液压泵继电器电路高",
      "en-us": "Hydraulic Pump Relay Circuit High",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P06A4": [
    {
      "scope": "所有汽车制造商",
      "code": "P06A4",
      "zh-cn": "传感器参考电压D电路低",
      "en-us": "Sensor Reference Voltage D Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到5伏参考电压电路D出错。故障原因包括5伏参考电压电路到某个传感器的电路发生短路或短路，一个或多个传感器发生短路或开路，ECU等。"
    }
  ],
  "P0067": [
    {
      "scope": "所有汽车制造商",
      "code": "P0067",
      "zh-cn": "空气辅助喷油器控制电路高",
      "en-us": "Air Assisted Injector Control Circuit High",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "空气辅助喷油器通过将高压空气导入燃油喷射通道的方式来使喷出的汽油雾更加精细，从而优化汽油燃烧。如果电子控制单元（ECU）检测到空气辅助喷油器控制电路电压高于校准的最高值，该故障码会出现。故障原因包括空气辅助喷油器电磁阀本身或其电路故障，氧传感器故障，或动力总成控制模块（PCM）故障等。"
    }
  ],
  "P0563": [
    {
      "scope": "所有汽车制造商",
      "code": "P0563",
      "zh-cn": "系统电压太高",
      "en-us": "System Voltage High",
      "sys": "车速及怠速控制",
      "knowledge": "电子控制单元发现系统电压在多达5秒的时间内持续高于16伏。故障原因包括发电机故障，电压调节器故障等。"
    }
  ],
  "P0C65": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C65",
      "zh-cn": "发电机位置传感器电路A范围/性能",
      "en-us": "Generator Position Sensor Circuit A Range/Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0C26": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C26",
      "zh-cn": "辅助变速器液泵电机电流",
      "en-us": "Auxiliary Transmission Fluid Pump Motor Current",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0AFD": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AFD",
      "zh-cn": "混合动力电池组温度太低",
      "en-us": "Hybrid Battery Pack Temperature Too Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0389": [
    {
      "scope": "所有汽车制造商",
      "code": "P0389",
      "zh-cn": "曲轴位置（CKP）传感器B电路间歇",
      "en-us": "Crankshaft Position Sensor B Circuit Intermittent",
      "sys": "点火系统",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。曲轴位置（CKP）传感器(也叫上止点传感器），其作用是检测上止点（TDC）信号、曲轴转角信号和发动机转速信号，并将其输入计算机，从而使计算机能按气缸的点火顺序发出最佳点火时刻指令。如果电子控制单元（ECU）检测到曲轴传感器B电路电压突然变化，该故障码会出现。"
    }
  ],
  "P067C": [
    {
      "scope": "所有汽车制造商",
      "code": "P067C",
      "zh-cn": "气缸5电热塞控制电路低",
      "en-us": "Cylinder 5 Glow Plug Control Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸5电热塞电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0AF9": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AF9",
      "zh-cn": "混合动力电池系统电压不稳定",
      "en-us": "Hybrid Battery System Voltage Unstable",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0AB0": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AB0",
      "zh-cn": "混合动力电池组空气温度传感器A电路间歇/不稳定",
      "en-us": "Hybrid Battery Pack Air Temperature Sensor A Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车的进气温度（IAT）传感器位于电池总成之内。该故障码的故障原因包括混合动力电池（进气温度（IAT）传感器），电池组控制模块等。"
    }
  ],
  "P014E": [
    {
      "scope": "所有汽车制造商",
      "code": "P014E",
      "zh-cn": "氧传感器反应太慢 - （空燃比）浓到稀（第2排，传感器 1）",
      "en-us": "O2 Sensor Slow Response - Rich to Lean (Bank 2, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。如果电子控制单元（ECU）发现在空燃比由浓变稀的过程中，没有监测到可以接受的电压变化速率的话，该故障码就会出现。"
    }
  ],
  "P0245": [
    {
      "scope": "所有汽车制造商",
      "code": "P0245",
      "zh-cn": "涡轮/超级增压器废气门电磁阀A低",
      "en-us": "Turbocharger/Supercharger Wastegate Solenoid A Low",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。废气门电磁阀的作用是通过控制进入涡轮的尾气流量（将其余尾气绕开），来调整涡轮转速，从而调整最大增压压力。如果电子控制单元（ECU）检测到废气门电磁阀A电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0487": [
    {
      "scope": "所有汽车制造商",
      "code": "P0487",
      "zh-cn": "废气再循环节气门控制电路A/开路",
      "en-us": "Exhaust Gas Recirculation Throttle Control Circuit A /Open",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环传感器A信号电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P0456": [
    {
      "scope": "所有汽车制造商",
      "code": "P0456",
      "zh-cn": "蒸发排放系统检测到泄漏（少量泄漏）",
      "en-us": "Evaporative Emission System Leak Detected (very small leak)",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。如果电子控制模块检测到直径小于0.04英寸的泄露，该故障码会出现。故障原因包括油箱盖没拧紧，蒸发排放系统管路泄露，蒸发排放系统垫钱间隙，炭罐通风口（CV）电磁阀关闭不紧等。"
    }
  ],
  "P0502": [
    {
      "scope": "所有汽车制造商",
      "code": "P0502",
      "zh-cn": "车速传感器（VSS）A电路低",
      "en-us": "Vehicle Speed Sensor A Circuit Low",
      "sys": "车速及怠速控制",
      "knowledge": "车速传感器（VSS）的作用是将汽车的速度以电信号形式传输给电子控制单元（ECU），作为控制发动机怠速，自动变速器换档，液力变矩器器锁止，发动机冷却风扇的开闭，以及巡航定速等其它功能的参考依据。如果电子控制单元（ECU）检测到车速信号电路过低，该故障码会出现。"
    }
  ],
  "P064B": [
    {
      "scope": "所有汽车制造商",
      "code": "P064B",
      "zh-cn": "（为附件提供动力的）动力输出控制模块",
      "en-us": "PTO Control Module",
      "sys": "计算机或辅助输出电路",
      "knowledge": "PTO是power take-off 的简称。它通常指为额外部件提供动力的装置。故障原因包括附件动力输出（PTO）控制模块，电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P0226": [
    {
      "scope": "所有汽车制造商",
      "code": "P0226",
      "zh-cn": "节气门/踏板位置传感器/开关C电路范围/性能",
      "en-us": "Throttle/Pedal Position Sensor/Switch C Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。该故障码表明节气门踏板位置传感器C电路电压在节气门关闭或节气门全开时超出正常范围。"
    }
  ],
  "P0652": [
    {
      "scope": "所有汽车制造商",
      "code": "P0652",
      "zh-cn": "传感器参考电压B电路低",
      "en-us": "Sensor Reference Voltage B Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到5伏参考电压电路B出错。故障原因包括5伏参考电压电路到某个传感器的电路发生短路或短路，一个或多个传感器发生短路或开路，自动变速器液压传感器故障，电磁阀故障，变速器控制模块故障，变速器输入速度（RPM）传感器故障，变速器输出速度（RPM）传感器故障等。"
    }
  ],
  "P02DE": [
    {
      "scope": "所有汽车制造商",
      "code": "P02DE",
      "zh-cn": "喷油器补偿学习在最低限气缸10",
      "en-us": "Cylinder 10 Fuel Injector Offset Learning At Min Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第10缸喷油器补偿学习已经达到了最低学习极限，该故障码会出现。"
    }
  ],
  "P0473": [
    {
      "scope": "所有汽车制造商",
      "code": "P0473",
      "zh-cn": "排气压力传感器A电路高",
      "en-us": "Exhaust Pressure Sensor A Circuit High",
      "sys": "排放控制",
      "knowledge": "排气压力传感器的作用是将排气系统压力以电信号的形式输送给电子控制单元（ECU）。如果ECU检测到排气压力传感器A信号电路电压在设定的时间段内（2.5秒）高于4.95伏，该故障码会出现。"
    }
  ],
  "P044B": [
    {
      "scope": "所有汽车制造商",
      "code": "P044B",
      "zh-cn": "废气再循环传感器C电路范围/性能",
      "en-us": "Exhaust Gas Recirculation Sensor C Circuit Range/Performance",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环（EGR）传感器信号电压出错，该故障码会出现。"
    }
  ],
  "P006F": [
    {
      "scope": "所有汽车制造商",
      "code": "P006F",
      "zh-cn": "涡轮/超级增压器增压控制A供电电压电路高",
      "en-us": "Turbocharger/Supercharger Boost Control A Supply Voltage Circuit High",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。涡轮/超级增压器增压控制器的作用是当增压压力达到设定值后，气压推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮速度，控制增压水平。该故障码表明涡轮/超级增压器增压控制A供电电压高于校准的最高值。"
    }
  ],
  "P025B": [
    {
      "scope": "所有汽车制造商",
      "code": "P025B",
      "zh-cn": "燃油泵模块控制电路范围/性能",
      "en-us": "Fuel Pump Module Control Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "燃油泵控制模块（FPM，or FPCM）是一个通过控制通往燃油泵（一般位于油箱内）电压的方式以实现电子控制模块（ECU）所需的最佳燃油压力的电脑微处理器。"
    }
  ],
  "P060E": [
    {
      "scope": "所有汽车制造商",
      "code": "P060E",
      "zh-cn": "内部控制模块节气门位置性能",
      "en-us": "Internal Control Module Throttle Position Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。节气门位置（TP）传感器的作用是将节气门开度以电信号的形式输送给电子控制单元（ECU），作为控制发动机喷油的基本参数之一。"
    }
  ],
  "P0034": [
    {
      "scope": "所有汽车制造商",
      "code": "P0034",
      "zh-cn": "涡轮/超级增压器旁通阀门控制电路低",
      "en-us": "Turbocharger/Supercharger Bypass Valve Control Circuit Low",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。增压器旁通阀的作用是当增压压力过大时，打开旁通阀将部分高压空气放掉，从而达到保护增压器和发动机的目的。该故障码表明涡轮/超级增压器旁通阀门控制电路电压低于校准的最低值。"
    }
  ],
  "P0A0F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A0F",
      "zh-cn": "发动机未能成功启动",
      "en-us": "Engine Failed to Start",
      "sys": "混合动力系统",
      "knowledge": "可能是电子控制单元（ECU）和序列多通道喷油系统（SFI）的问题。"
    }
  ],
  "P0295": [
    {
      "scope": "所有汽车制造商",
      "code": "P0295",
      "zh-cn": "第12缸喷油器电路高",
      "en-us": "Cylinder 12 Injector Circuit High",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第12缸喷油器控制电路电压高于校准的最高值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P067F": [
    {
      "scope": "所有汽车制造商",
      "code": "P067F",
      "zh-cn": "气缸6电热塞控制电路高",
      "en-us": "Cylinder 6 Glow Plug Control Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸6电热塞电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0761": [
    {
      "scope": "所有汽车制造商",
      "code": "P0761",
      "zh-cn": "换档电磁阀C性能问题或者卡在关的位置",
      "en-us": "Shift Solenoid C Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P02B2": [
    {
      "scope": "所有汽车制造商",
      "code": "P02B2",
      "zh-cn": "燃油（空燃比）修剪在最高限 - 气缸7",
      "en-us": "Cylinder 7 - Fuel Trim at Max Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最大极限超过一定时间，该故障码会出现。"
    }
  ],
  "P0733": [
    {
      "scope": "所有汽车制造商",
      "code": "P0733",
      "zh-cn": "3档齿轮比不正确",
      "en-us": "Gear 3 Incorrect Ratio",
      "sys": "变速箱",
      "knowledge": "车辆在1档指令打开的情况下运行，电子控制单元（ECU）检测到3档齿轮比不正确。故障原因包括变速器液液位太低，换档电磁阀，变速器液压传感器，阀体内的电磁阀故障，输入轴速度传感器，输出轴速度传感器，电路，接头，变速器控制模块故障等。"
    }
  ],
  "P0076": [
    {
      "scope": "所有汽车制造商",
      "code": "P0076",
      "zh-cn": "进气阀门控制电磁阀电路低 （第1排）",
      "en-us": "Intake Valve Control Solenoid Circuit Low (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。如果进气凸轮轴调节阀电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0A08": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A08",
      "zh-cn": "直流/直流转换器状态电路",
      "en-us": "DC/DC Converter Status Circuit",
      "sys": "混合动力系统",
      "knowledge": "直流/直流转换器将HV电池的直流高压（200-400伏特）转化成12伏特电压，从而可以给辅助电池充电并给车内附件供电。如果电子控制单元（ECU）检测到直流/直流转换器发生内部电路故障，并进入安全模式；从而导致辅助电池电压降低到11伏特以下，则该故障码会出现。"
    }
  ],
  "P0B94": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B94",
      "zh-cn": "混合动力电池电压监控R电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense R Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P02EE": [
    {
      "scope": "所有汽车制造商",
      "code": "P02EE",
      "zh-cn": "喷油器电路范围/性能 - 气缸1",
      "en-us": "Cylinder 1 Injector Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第1缸喷油器电路出错，该故障码会出现。"
    }
  ],
  "P023F": [
    {
      "scope": "所有汽车制造商",
      "code": "P023F",
      "zh-cn": "燃油泵二级电路/开路",
      "en-us": "Fuel Pump Secondary Circuit/Open",
      "sys": "燃油或空气",
      "knowledge": "燃油泵电路分为主电路和二级电路。主电路负责控制燃油泵，燃油泵继电器利用来自电子控制单元（ECU）的低电流控制电磁线圈，从而接通燃油泵高电流。二级电路指的是燃油泵监控器（FPM）电路，负责监控燃油泵的电路反馈。"
    }
  ],
  "P0C06": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C06",
      "zh-cn": "驱动电机A，U-V-W相电路低",
      "en-us": "Drive Motor A Phase U-V-W Circuit Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0B26": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B26",
      "zh-cn": "混合动力电池A电压高",
      "en-us": "Hybrid Battery A Voltage High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0A2A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A2A",
      "zh-cn": "驱动电机A温度传感器电路",
      "en-us": "Drive Motor A Temperature Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "驱动电机A温度传感器电路发生故障。故障原因包括电路，接头，电子控制单元，驱动电机等。有些车辆的驱动电机温度传感器跟驱动电机是一体的。所以，如果确定是该温度传感器本身的问题，有可能需要换掉整个驱动电机。"
    }
  ],
  "P0426": [
    {
      "scope": "所有汽车制造商",
      "code": "P0426",
      "zh-cn": "催化转换器温度传感器电路范围/性能 （第1排，传感器1）",
      "en-us": "Catalyst Temperature Sensor Circuit Range/Performance (Bank 1, Sensor 1)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器温度传感器电路出错。故障原因包括催化转换器温度传感器，电路，接头，或电子控制单元（ECU）故障。"
    }
  ],
  "P0360": [
    {
      "scope": "所有汽车制造商",
      "code": "P0360",
      "zh-cn": "点火线圈J主/次电路",
      "en-us": "Ignition Coil J Primary/Secondary Circuit",
      "sys": "点火系统",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。电子控制单元（ECU）持续监测每个点火主电路。如果ECU没有收到有效的来自点火模块（集成在ECU）的点火诊断监控器（IDM）脉冲信号，该故障码会出现。故障原因包括点火启动/运行电路，点火线圈电路，点火线圈本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P046B": [
    {
      "scope": "所有汽车制造商",
      "code": "P046B",
      "zh-cn": "催化转换器温度传感器1/2相关性 （第2排）",
      "en-us": "Catalyst Temperature Sensor 1/2 Correlation (Bank 2)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器温度传感器1/2的信号差超过了设定的最大极限。"
    }
  ],
  "P0895": [
    {
      "scope": "所有汽车制造商",
      "code": "P0895",
      "zh-cn": "换档时间太短",
      "en-us": "Shift Time Too Short",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0C18": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C18",
      "zh-cn": "驱动电机B位置传感器没有学会",
      "en-us": "Drive Motor B Position Sensor Not Learned",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P050C": [
    {
      "scope": "所有汽车制造商",
      "code": "P050C",
      "zh-cn": "冷车启动发动机冷却液温度（传感器）性能",
      "en-us": "Cold Start Engine Coolant Temperature Performance",
      "sys": "车速及怠速控制",
      "knowledge": "发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。该故障码表明冷车启动时，发动机冷却液温度（ECT）传感器故障。"
    }
  ],
  "P0C1D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C1D",
      "zh-cn": "辅助变速器液泵控制模块内部温度传感器电路范围/性能",
      "en-us": "Auxiliary Transmission Fluid Pump Control Module Internal Temperature Sensor Circuit Range/Performan",
      "sys": "混合动力系统",
      "knowledge": "该故障码表明控制模块内部温度传感器信号电路电压超出了校准的最大范围。故障原因内部温度传感器，电路，接头，或控制模块。"
    }
  ],
  "P013E": [
    {
      "scope": "所有汽车制造商",
      "code": "P013E",
      "zh-cn": "氧传感器延迟响应 - （空燃比）浓到稀 （第1排，传感器 2）",
      "en-us": "O2 Sensor Delayed Response - Rich to Lean (Bank 1, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。如果电子控制单元（ECU）发现在空燃比由浓变稀的过程中，没有监测到可以接受的电压变化速率的话，该故障码就会出现。"
    }
  ],
  "P0BDA": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BDA",
      "zh-cn": "驱动电机换流器温度传感器D电路间歇/不稳定",
      "en-us": "Drive Motor Inverter Temperature Sensor D Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0107": [
    {
      "scope": "所有汽车制造商",
      "code": "P0107",
      "zh-cn": "歧管绝对压力（传感器）/大气压力（传感器）电路低",
      "en-us": "Manifold Absolute Pressure/Barometric Pressure Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "歧管绝对压力（MAP）传感器的作用是测量进气歧管内的压力（真空度）。动力总成控制模块（PCM）然后会将进气歧管压力与大气压力之间的差值（跟发动机负荷成线性关系）作为确定喷油器基本喷油量的一个依据，以帮助发动机在不同负荷下达到最佳空燃比。大气压力传感器（有时候也叫高海拔补偿器，HAC）的作用是将大气压力以电信号的形式输送给电子控制模块。大气压力会随天气和海拔高度的变化而变化。压力越小，空气越稀薄。动力总成控制模块（PCM）会根据大气压力的数值来修正燃油供给，以帮助发动机达到最佳空燃比。如果电子控制单元（ECU）检测歧管绝对压力（MAP）传感器/气压传感器信号电压低于校准的低值，该故障码会出现。故障原因包括MAP或大气压力（BARO）传感器信号电路开路或短路到接地，参考电压（VREF）电路开路，传感器故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0A3A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A3A",
      "zh-cn": "发电机温度传感器电路间歇",
      "en-us": "Generator Temperature Sensor Circuit Intermittent",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车的起动机/发电机为同一个电机，一般位于变速器内。故障原因包括发电机温度传感器，电路，接头，控制模块等。"
    }
  ],
  "P0634": [
    {
      "scope": "所有汽车制造商",
      "code": "P0634",
      "zh-cn": "动力总成控制模块（PCM） /发动机控制模块（ECM）/变速器控制模块（TCU）内部温度A过高",
      "en-us": "PCM/ECM/TCU Internal Temperature A Too High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。该故障码表明电子控制单元（ECU） /发动机控制模块（ECM）/变速器控制模块（TCU）温度传感器信号高于校准的最高值。该控制模块已被暂时关闭，以为避免因过热造成的破坏。"
    }
  ],
  "P014C": [
    {
      "scope": "所有汽车制造商",
      "code": "P014C",
      "zh-cn": "氧传感器反应太慢 - （空燃比）浓到稀（第1排，传感器 1）",
      "en-us": "O2 Sensor Slow Response - Rich to Lean (Bank 1, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。如果电子控制单元（ECU）发现在空燃比由浓变稀的过程中，没有监测到可以接受的电压变化速率的话，该故障码就会出现。"
    }
  ],
  "P0AAB": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AAB",
      "zh-cn": "混合动力电池电压隔离传感器电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Isolation Sensor Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0713": [
    {
      "scope": "所有汽车制造商",
      "code": "P0713",
      "zh-cn": "变速器液温传感器A电路高",
      "en-us": "Transmission Fluid Temperature Sensor A Circuit High",
      "sys": "变速箱",
      "knowledge": "变速器液温度（TFT）传感器依据热敏电阻的原理将变速器液温度以电信号的形式传送到电子控制单元（ECU）。其主要作用是当温度过高时，变速器控制模块（TCU）会降挡减速。对于有些新型汽车，TCU运用此温度信号判断变速器液粘度，从而调整管路压力和电磁阀压力。如果电子控制单元（ECU）检测到变速器液温度（TFT）传感器信号电压持续高于校准最高值（温度低于-40摄氏度），该故障码会出现。故障原因包括TFT传感器电路短路到正极，接头短路，TFT传感器校准失调或本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0C5E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C5E",
      "zh-cn": "驱动电机A位置传感器电路B间歇/不稳定",
      "en-us": "Drive Motor A Position Sensor Circuit B Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0186": [
    {
      "scope": "所有汽车制造商",
      "code": "P0186",
      "zh-cn": "燃油温度传感器B电路范围/性能",
      "en-us": "Fuel Temperature Sensor B Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "燃油温度传感器负责监控通往燃油泵的燃油温度，以避免因温度过高（120摄氏度）造成蒸气锁现象，而造成对燃油泵或喷油器的破坏。电子控制单元（ECU）持续监测燃油温度传感器信号电压。如果这个电压在设定时间段里超出了正常校准值，则该故障码会出现。"
    }
  ],
  "P0A07": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A07",
      "zh-cn": "电机电子系统冷却液泵A控制电路高",
      "en-us": "Motor Electronics Coolant Pump A Control Circuit High",
      "sys": "混合动力系统",
      "knowledge": "电机电子系统冷却系统（MECS）是一套独立的为变速箱（例如eCVT）电机，控制模块以及直流/直流转换器提供冷却的系统。它拥有自己的散热器，冷却液泵，冷却液温度传感器等。电机电子冷却系统冷却液泵是一个电子控制单元（ECU）控制的12伏电压电泵。如果控制模块检测到电机电子冷却系统冷却液泵控制电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0139": [
    {
      "scope": "所有汽车制造商",
      "code": "P0139",
      "zh-cn": "氧传感器电路慢响应（第1排，传感器 2）",
      "en-us": "O2 Sensor Circuit Slow Response (Bank 1, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。当电压变化速率低于校准值时，电子控制单元（ECU）就会开始修改空燃比试图提高氧传感器的电压变化速率。如果ECU已经达到了可以接受的燃油修剪限制或者已超过了可接受的燃油修剪的时间长度，而仍然没有监测到可以接受的电压变化速率的话，该故障码就会出现。故障原因包括氧传感器由于燃油中含硅而被污染，氧传感器信号电路开路，氧传感器本身故障，排气管或排气歧管泄漏，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0ABF": [
    {
      "scope": "所有汽车制造商",
      "code": "P0ABF",
      "zh-cn": "混合动力电池组电流传感器A电路",
      "en-us": "Hybrid Battery Pack Current Sensor A Circuit",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块通过来自电池电流传感器的信号来监控电池的充电放电情况。如果控制模块发现电池电流传感器信号电路发生故障，该故障码会出现。"
    }
  ],
  "P0B8D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B8D",
      "zh-cn": "混合动力电池电压监控Q电路低",
      "en-us": "Hybrid Battery Voltage Sense Q Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0974": [
    {
      "scope": "所有汽车制造商",
      "code": "P0974",
      "zh-cn": "换档电磁阀A控制电路高",
      "en-us": "Shift Solenoid A Control Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0232": [
    {
      "scope": "所有汽车制造商",
      "code": "P0232",
      "zh-cn": "燃油泵二级电路高",
      "en-us": "Fuel Pump Secondary Circuit High",
      "sys": "燃油或空气",
      "knowledge": "燃油泵电路分为主电路和二级电路。主电路负责控制燃油泵，燃油泵继电器利用来自电子控制单元（ECU）的低电流控制电磁线圈，从而接通燃油泵高电流。二级电路指的是燃油泵监控器（FPM）电路，负责监控燃油泵的电路反馈。P0232的故障原因包括包括燃惯性燃油关闭阀（IFS）没有重置，油泵监控器（FPM）到燃油泵继电器的电路，燃油泵继电器电路，燃油泵继电器，电子控制单元（ECU）等。"
    }
  ],
  "P050B": [
    {
      "scope": "所有汽车制造商",
      "code": "P050B",
      "zh-cn": "冷车启动点火正时性能",
      "en-us": "Cold Start Ignition Timing Performance",
      "sys": "车速及怠速控制",
      "knowledge": "冷车启动排放削减监控器会经常测试每个部件的合理性。在测试时，电子控制单元（ECU）会请求滞后点火正时。点火正时监控器然后会拿实际测得的点火正时跟ECU请求的空气流量比较。如果实际点火正时在4秒钟内连续超前于设定点火正时5度的话，该故障码会出现。"
    }
  ],
  "P0723": [
    {
      "scope": "所有汽车制造商",
      "code": "P0723",
      "zh-cn": "输出轴速度传感器电路间歇",
      "en-us": "Output Speed Sensor Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "输出速度传感器（OSS）的任务是将变速器输出轴的速度信号传送给电子控制单元（ECU）。如果ECU检测到OSS信号间歇，不规则，则该故障码会出现。故障原因包括OSS传感器受到非标准配件的干扰，OSS传感器本身故障，电路，接头故障等。"
    }
  ],
  "P0647": [
    {
      "scope": "所有汽车制造商",
      "code": "P0647",
      "zh-cn": "空调离合器继电器控制电路高",
      "en-us": "A/C Clutch Relay Control Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "空调的皮带轮在空调关闭的时候只是空转，只有当空调离合器（在电磁阀的作用下）结合时，才会带动压缩机运转。空调离合器继电器的作用就是控制离合器的分离和结合。该故障码表明空调离合器被指令开启的时候，电子控制单元（ECU）在空调继电器控制电路上检测到高电压。"
    }
  ],
  "P0AB6": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AB6",
      "zh-cn": "发动机悬架B控制电路/开路",
      "en-us": "Engine Mount B Control Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": "汽车电控悬架可以根据行驶的需要对悬架硬度、阻尼、和车身高度进行调节，提高车辆的形式平稳性和操控性。"
    }
  ],
  "P0770": [
    {
      "scope": "所有汽车制造商",
      "code": "P0770",
      "zh-cn": "换档电磁阀E",
      "en-us": "Shift Solenoid E",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0BB3": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BB3",
      "zh-cn": "混合动力电池电压监控Y电路",
      "en-us": "Hybrid Battery Voltage Sense Y Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P002F": [
    {
      "scope": "所有汽车制造商",
      "code": "P002F",
      "zh-cn": "B 凸轮轴形面控制电路高 （第2排）",
      "en-us": "B Camshaft Profile Control Circuit High (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。该故障码表明B（排气/右/后）凸轮轴形面控制电路电压高于校准的最高值。"
    }
  ],
  "P0885": [
    {
      "scope": "所有汽车制造商",
      "code": "P0885",
      "zh-cn": "变速器控制模块（TCU）电源继电器控制电路/开路",
      "en-us": "TCU Power Relay Control Circuit/Open",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。控制模块继电器的作用是在点火开关关闭以后，继续保持控制模块的供电，直到控制模块完成关闭过程。"
    }
  ],
  "P020F": [
    {
      "scope": "所有汽车制造商",
      "code": "P020F",
      "zh-cn": "喷油器正时 - 第6缸",
      "en-us": "Cylinder 6 Injection Timing",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器实际正时跟理想喷油正时偏差超过最大极限，该故障码会出现。"
    }
  ],
  "P078E": [
    {
      "scope": "所有汽车制造商",
      "code": "P078E",
      "zh-cn": "换档正时电磁阀B间歇",
      "en-us": "Shift Timing Solenoid B Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P047D": [
    {
      "scope": "所有汽车制造商",
      "code": "P047D",
      "zh-cn": "排气压力传感器B电路高",
      "en-us": "Exhaust Pressure Sensor B Circuit High",
      "sys": "排放控制",
      "knowledge": "排气压力传感器的作用是将排气系统压力以电信号的形式输送给电子控制单元（ECU）。如果ECU检测到排气压力传感器A信号电路电压在设定的时间段内（2.5秒）高于4.95伏，该故障码会出现。"
    }
  ],
  "P0A7B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A7B",
      "zh-cn": "电池能量控制模块请求点亮故障指示灯（MIL）",
      "en-us": "Battery Energy Control Module Requested MIL Illumination",
      "sys": "混合动力系统",
      "knowledge": "故障指示灯（MIL）也叫检查引擎灯，其作用是当控制模块检测到故障时，点亮仪表盘上的一个黄色或红色的发动机符号。"
    }
  ],
  "P0302": [
    {
      "scope": "所有汽车制造商",
      "code": "P0302",
      "zh-cn": "第2缸检测到失火",
      "en-us": "Cylinder 2 Misfire Detected",
      "sys": "点火系统",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。如果电子控制单元（ECU）检测到可能会对催化转换器造成破坏的失火，故障指示灯会闪烁，此时应立即关闭发动机。该故障码表明电子控制单元（ECU）检测到气缸2失火。故障原因包括点火系统故障，燃油输送故障，进气歧管或EGR，PCV的空气泄漏，机械性气缸故障等。"
    }
  ],
  "P0B6D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B6D",
      "zh-cn": "混合动力电池电压监控K电路",
      "en-us": "Hybrid Battery Voltage Sense K Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0C6C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C6C",
      "zh-cn": "发电机位置传感器电路B高",
      "en-us": "Generator Position Sensor Circuit B High",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括发电机位置传感器电路，接头，或传感器本身；混合动力车辆发电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P06D0": [
    {
      "scope": "所有汽车制造商",
      "code": "P06D0",
      "zh-cn": "气缸12电热塞不正确",
      "en-us": "Cylinder 12 Glow Plug Incorrect",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。该故障码表明气缸12电热塞，其电路，接头，或电热赛控制模块（GPCM）出错。"
    }
  ],
  "P0AB7": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AB7",
      "zh-cn": "发动机悬架B控制电路低",
      "en-us": "Engine Mount B Control Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "汽车电控悬架可以根据行驶的需要对悬架硬度、阻尼、和车身高度进行调节，提高车辆的形式平稳性和操控性。"
    }
  ],
  "P0BA4": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BA4",
      "zh-cn": "混合动力电池电压监控V电路",
      "en-us": "Hybrid Battery Voltage Sense V Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P005D": [
    {
      "scope": "所有汽车制造商",
      "code": "P005D",
      "zh-cn": "B凸轮轴形面控制卡在开的位置 （第2排）",
      "en-us": "B Camshaft Profile Control Stuck On (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。该故障码表明B（排气/右/后）凸轮轴形面控制发生故障或卡在打开位置 。"
    }
  ],
  "P0698": [
    {
      "scope": "所有汽车制造商",
      "code": "P0698",
      "zh-cn": "传感器参考电压C电路低",
      "en-us": "Sensor Reference Voltage C Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到5伏参考电压电路C出错。故障原因包括5伏参考电压电路到某个传感器的电路发生短路或短路，一个或多个传感器发生短路或开路，ECU等。"
    }
  ],
  "P0918": [
    {
      "scope": "所有汽车制造商",
      "code": "P0918",
      "zh-cn": "换档位置电路间歇",
      "en-us": "Gear Shift Position Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "换档位置（监控换档杆向前/向后的位置，奇/偶档位）电路故障。"
    }
  ],
  "P0118": [
    {
      "scope": "所有汽车制造商",
      "code": "P0118",
      "zh-cn": "发动机冷却液温度（ECT）传感器1电路高",
      "en-us": "Engine Coolant Temperature Sensor 1 Circuit High",
      "sys": "燃油或空气",
      "knowledge": "发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。如果ECU检测到发动机冷却液温度（ECT）传感器信号高于自检的最大值（4.6伏或-50摄氏度），该故障码会出现。故障原因包括ECT传感器短路到正极，传感器故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0631": [
    {
      "scope": "所有汽车制造商",
      "code": "P0631",
      "zh-cn": "车辆识别码（VIN）未编程或不匹配 - 变速器控制模块（TCU）",
      "en-us": "VIN Not Programmed or Incompatible - TCU",
      "sys": "计算机或辅助输出电路",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。"
    }
  ],
  "P0172": [
    {
      "scope": "所有汽车制造商",
      "code": "P0172",
      "zh-cn": "系统（空燃比）太浓 （第1排）",
      "en-us": "System Too Rich (Bank 1)",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果自适应燃油控制系统已经达到了补偿极限，而空燃比仍然很浓的话，该故障码就会出现。故障原因包括进气流量传感器或歧管绝对压力（MAP）传感器故障，燃油压力太高，燃油压力调节器故障，喷油器故障，氧传感器故障，凸轮轴正时错误，机油过满，蒸发排放系统错误，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0AA3": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AA3",
      "zh-cn": "混合动力电池负极接触器电路",
      "en-us": "Hybrid Battery Negative Contactor Circuit",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果第3系统主继电器（SMR）卡住，有可能会导致高压系统不能关闭。所以，混合动力汽车电子控制单元如果一旦发现其中的任何一个继电器发生故障，便会终止整个系统。"
    }
  ],
  "P0191": [
    {
      "scope": "所有汽车制造商",
      "code": "P0191",
      "zh-cn": "燃油分供管压力传感器A电路范围/性能",
      "en-us": "Fuel Rail Pressure Sensor A Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。电子控制单元（ECU）监控燃油分供管压力传感器的参考电压。如果这个电压在设定的时间段内超出正常范围，则该故障码会出现。"
    }
  ],
  "P06B2": [
    {
      "scope": "所有汽车制造商",
      "code": "P06B2",
      "zh-cn": "传感器供电电源A电路高",
      "en-us": "Sensor Power Supply A Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": ""
    }
  ],
  "P008E": [
    {
      "scope": "所有汽车制造商",
      "code": "P008E",
      "zh-cn": "燃油冷却器泵控制电路高",
      "en-us": "Fuel Cooler Pump Control Circuit High",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油冷却器的作用是降低燃油温度从而提高低硫柴油的粘度。该故障码表明燃油冷却器泵控制电路电压高于校准的最高值。"
    }
  ],
  "P06AA": [
    {
      "scope": "所有汽车制造商",
      "code": "P06AA",
      "zh-cn": "动力总成控制模块（PCM）/发动机控制模块（ECM）/变速器控制模块（TCU）内部温度B太高",
      "en-us": "PCM/ECM/TCU Internal Temperature B Too High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。"
    }
  ],
  "P0726": [
    {
      "scope": "所有汽车制造商",
      "code": "P0726",
      "zh-cn": "发动机转速输入电路范围/性能",
      "en-us": "Engine Speed Input Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "发动机转速（也称为输入轴转速）是变速器控制模块（TCU）测定齿轮比和换档等的一个重要依据。发动机运转过程中，电子控制单元（ECU）或变速器控制模块（TCU）在CAN高速传输网络上检测到无效发动机转速输入信号。故障原因包括发动机转速传感器，电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P0417": [
    {
      "scope": "所有汽车制造商",
      "code": "P0417",
      "zh-cn": "二次空气喷射系统切换阀B电路短路",
      "en-us": "Secondary Air Injection System Switching Valve B Circuit Shorted",
      "sys": "排放控制",
      "knowledge": "在发动机刚刚启动时，二次空气喷射系统通过往排气歧管强制输入空气来氧化产生的碳氢化合物，一氧化碳等有害气体。这个过程也同时加速了催化转换器的暖化过程。如果电子控制单元（ECU）检测到二次空气喷射系统控制电磁阀电路有短路的情况，该故障码会出现。故障原因包括二次空气喷射执行器电路开路或短路到正极，切换阀故障，二次空气喷射泵故障，继电器故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P00BB": [
    {
      "scope": "所有汽车制造商",
      "code": "P00BB",
      "zh-cn": "喷油器流量不足 - 被迫限制功率",
      "en-us": "Fuel Injector Insufficient Flow - Forced Limited Power",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明发动机因为燃油供给不足，而功率降低。故障原因包括燃油泵、油压调节器、燃油泄漏，喷油器等问题。"
    }
  ],
  "P0337": [
    {
      "scope": "所有汽车制造商",
      "code": "P0337",
      "zh-cn": "曲轴位置（CKP）传感器A电路低",
      "en-us": "Crankshaft Position Sensor A Circuit Low",
      "sys": "点火系统",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。曲轴位置（CKP）传感器(也叫上止点传感器），其作用是检测上止点（TDC）信号、曲轴转角信号和发动机转速信号，并将其输入计算机，从而使计算机能按气缸的点火顺序发出最佳点火时刻指令。如果电子控制单元（ECU）检测到曲轴传感器A电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0827": [
    {
      "scope": "所有汽车制造商",
      "code": "P0827",
      "zh-cn": "升档和降挡开关电路低",
      "en-us": "Up and Down Shift Switch Circuit Low",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P02CF": [
    {
      "scope": "所有汽车制造商",
      "code": "P02CF",
      "zh-cn": "喷油器补偿学习在最高限气缸2",
      "en-us": "Cylinder 2 Fuel Injector Offset Learning At Max Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第2缸喷油器补偿学习已经达到了最高学习极限，该故障码会出现。"
    }
  ],
  "P0561": [
    {
      "scope": "所有汽车制造商",
      "code": "P0561",
      "zh-cn": "系统电压不稳定",
      "en-us": "System Voltage Unstable",
      "sys": "车速及怠速控制",
      "knowledge": "电子控制单元检测到系统电压突然变化。"
    }
  ],
  "P045B": [
    {
      "scope": "所有汽车制造商",
      "code": "P045B",
      "zh-cn": "废气再循环B控制电路范围/性能",
      "en-us": "Exhaust Gas Recirculation B Control Circuit Range/Performance",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环（EGR）阀控制电路电压出错，该故障码会出现。"
    }
  ],
  "P0B63": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B63",
      "zh-cn": "混合动力电池电压监控I电路",
      "en-us": "Hybrid Battery Voltage Sense I Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0553": [
    {
      "scope": "所有汽车制造商",
      "code": "P0553",
      "zh-cn": "动力转向压力传感器/开关电路高",
      "en-us": "Power Steering Pressure Sensor/Switch Circuit High",
      "sys": "车速及怠速控制",
      "knowledge": "动力转向压力（PSP）传感器根据电位器的原理将动力转向负载压力以电压信号的形式传输给电子控制单元（ECU）。如果负载压力过大，必要的时候ECU会提高发动机怠速，关闭空调压缩机，以防止发动机死火。如果电子控制单元（ECU）检测到动力转向压力传感器信号电压高于自检的最高值，该故障码会出现。故障原因包括PSP传感器电路或短路到正极，PSP传感器故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0B6B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B6B",
      "zh-cn": "混合动力电池电压监控J电路高",
      "en-us": "Hybrid Battery Voltage Sense J Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0A1E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A1E",
      "zh-cn": "起动机/发电机控制模块",
      "en-us": "Starter/Generator Control Module",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车的起动机/发电机为同一个电机，一般位于变速器内。该故障码表明起动机/发电机控制模块发生内部故障。"
    }
  ],
  "P0A7F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A7F",
      "zh-cn": "混合动力电池组恶化",
      "en-us": "Hybrid Battery Pack Deterioration",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块通过测量电池组的电压与电流来计算电池组电阻，并通过测量进入电池组的安培数来估计充电状态。如果电池控制模块发现：1）混合动力电池组的电阻超过正常值；或者2）最大最小充电值的差超过正常值，则该故障码会出现。"
    }
  ],
  "P0471": [
    {
      "scope": "所有汽车制造商",
      "code": "P0471",
      "zh-cn": "排气压力传感器A电路范围/性能",
      "en-us": "Exhaust Pressure Sensor A Circuit Range/Performance",
      "sys": "排放控制",
      "knowledge": "排气压力传感器的作用是将排气系统压力以电信号的形式输送给电子控制单元（ECU）。如果ECU检测到排气压力传感器A电路电压出错，该故障码会出现。"
    }
  ],
  "P0C01": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C01",
      "zh-cn": "驱动电机A电流高",
      "en-us": "Drive Motor A Current High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0BCC": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BCC",
      "zh-cn": "发电机换流器温度传感器电路",
      "en-us": "Generator Inverter Temperature Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P0877": [
    {
      "scope": "所有汽车制造商",
      "code": "P0877",
      "zh-cn": "变速器液压力（TFP）传感器/开关D电路低",
      "en-us": "Transmission Fluid Pressure Sensor/Switch D Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0504": [
    {
      "scope": "所有汽车制造商",
      "code": "P0504",
      "zh-cn": "刹车开关A/B的相关性",
      "en-us": "Brake Switch A/B Correlation",
      "sys": "车速及怠速控制",
      "knowledge": "刹车开关的作用是将刹车踏板踩下与否的信息以电信号的形式传送给电子控制单元（ECU），作为停止定速巡航和分离液力变矩器的重要依据。电子控制单元（ECU）检测到刹车踏板开关与刹车踏板位置开关信号之间错误的相关性。"
    }
  ],
  "P0B84": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B84",
      "zh-cn": "混合动力电池电压监控O电路高",
      "en-us": "Hybrid Battery Voltage Sense O Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0C0A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C0A",
      "zh-cn": "驱动电机B，U-V-W相电路高",
      "en-us": "Drive Motor B Phase U-V-W Circuit High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P07AD": [
    {
      "scope": "所有汽车制造商",
      "code": "P07AD",
      "zh-cn": "变速器摩擦衬片F卡在开的位置",
      "en-us": "Transmission Friction Element F Stuck On",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0162": [
    {
      "scope": "所有汽车制造商",
      "code": "P0162",
      "zh-cn": "氧传感器电路（第2排，传感器 3）",
      "en-us": "O2 Sensor Circuit (Bank 2, Sensor 3)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。如果电子控制单元（ECU）检测到用于测定废气中氧含量的电路有问题时，则该故障码会出现。"
    }
  ],
  "P0626": [
    {
      "scope": "所有汽车制造商",
      "code": "P0626",
      "zh-cn": "发电机磁场/F-端子电路高",
      "en-us": "Generator Field/F Terminal Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）通过发电机开启信号电路来控制发电机。当需要发电机运转的时候，ECU会通过发电机开启信号电路来发送1个5伏的信号到电压调节器。电压调节器收到这个信号后便会开始控制发电机磁场电路。电子控制单元（ECU）如果发现发电机负载高于正常值，该故障码会出现。最大的可能是发电机对地短路。"
    }
  ],
  "P02CC": [
    {
      "scope": "所有汽车制造商",
      "code": "P02CC",
      "zh-cn": "喷油器补偿学习在最低限气缸1",
      "en-us": "Cylinder 1 Fuel Injector Offset Learning At Min Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第1缸喷油器补偿学习已经达到了最低学习极限，该故障码会出现。"
    }
  ],
  "P0A1C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A1C",
      "zh-cn": "驱动电机B控制模块",
      "en-us": "Drive Motor B Control Module",
      "sys": "混合动力系统",
      "knowledge": "驱动电机控制模块（MCM）发生内部故障。可能故障原因包括MCM处理器，模拟转数字转化器，供电电压，串行通讯等。"
    }
  ],
  "P052D": [
    {
      "scope": "所有汽车制造商",
      "code": "P052D",
      "zh-cn": "冷车启动A凸轮轴位置正时过于滞后 （第2排）",
      "en-us": "Cold Start A Camshaft Position Timing Over-Retarded (Bank 2)",
      "sys": "车速及怠速控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。冷车启动时，如果电子控制单元（ECU）检测到A（进气/左/前）凸轮轴正时超过最大设定值，或者一直处于滞后状态，则该故障码会出现。"
    }
  ],
  "P02E1": [
    {
      "scope": "所有汽车制造商",
      "code": "P02E1",
      "zh-cn": "柴油机进气流量控制范围/性能",
      "en-us": "Diesel Intake Air Flow Control Performance",
      "sys": "燃油或空气",
      "knowledge": "柴油机进气流量控制系统通过对节气门开启角度的自动控制并与切向气道或螺旋气道的配合使用来形成有效的进气涡流，同时对进气涡流的强度进行自动控制，有效地改善了发动机的燃烧，从而优化了发动机动力性，经济性等性能指标。"
    }
  ],
  "P0C0D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C0D",
      "zh-cn": "驱动电机A换流器电源供应 - 电路高",
      "en-us": "Drive Motor A Inverter Power Supply Circuit High",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P0751": [
    {
      "scope": "所有汽车制造商",
      "code": "P0751",
      "zh-cn": "换档电磁阀A性能/卡在全关位置",
      "en-us": "Shift Solenoid A Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0589": [
    {
      "scope": "所有汽车制造商",
      "code": "P0589",
      "zh-cn": "定速巡航系统多功能输入B电路",
      "en-us": "Cruise Control Multi-Function Input B Circuit",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。故障原因包括定速巡航多功能输入开关，电路，接头等。"
    }
  ],
  "P0953": [
    {
      "scope": "所有汽车制造商",
      "code": "P0953",
      "zh-cn": "自动换档手动（ASM）变速器控制电路高",
      "en-us": "Auto Shift Manual Control Circuit High",
      "sys": "变速箱",
      "knowledge": "自动换档手动变速器允许司机将变速器打入手动模式，手动控制升档或降档。"
    }
  ],
  "P0AF6": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AF6",
      "zh-cn": "驱动电机换流器温度传感器B电路间歇/不稳定",
      "en-us": "Drive Motor Inverter Temperature Sensor B Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0AD2": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AD2",
      "zh-cn": "混合动力电池组冷却风扇3控制电路低",
      "en-us": "Hybrid Battery Pack Cooling Fan 3 Control Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "风扇电机控制器负责调节混合动力电池组冷却风扇的电压。如果冷却风扇1控制电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0325": [
    {
      "scope": "所有汽车制造商",
      "code": "P0325",
      "zh-cn": "爆震传感器1电路（第1排或单个传感器）",
      "en-us": "Knock Sensor 1 Circuit (Bank 1 or Single Sensor)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压超出了校准范围，该故障码会出现。故障原因包括爆震传感器电路，接头，其本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0265": [
    {
      "scope": "所有汽车制造商",
      "code": "P0265",
      "zh-cn": "第2缸喷油器电路高",
      "en-us": "Cylinder 2 Injector Circuit High",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第2缸喷油器控制电路电压高于校准的最高值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0B2B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B2B",
      "zh-cn": "混合动力电池C电压",
      "en-us": "Hybrid Battery C Voltage",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P06CA": [
    {
      "scope": "所有汽车制造商",
      "code": "P06CA",
      "zh-cn": "气缸6电热塞不正确",
      "en-us": "Cylinder 6 Glow Plug Incorrect",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。该故障码表明气缸6电热塞，其电路，接头，或电热赛控制模块（GPCM）出错。"
    }
  ],
  "P0744": [
    {
      "scope": "所有汽车制造商",
      "code": "P0744",
      "zh-cn": "液力变矩器离合器电路间歇",
      "en-us": "Torque Converter Clutch Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "液力变矩器的作用就像手动变速器里的离合器，允许来自发动机的扭力跟变速器暂时断开，从而实现平稳换档。但不同的是，液力变矩器可以起到像降挡一样的增加力扭力的作用。液力变矩器离合器（TCC）电磁阀电路，接头，或电磁阀本身故障。控制模块故障也可能导致该故障码出现。"
    }
  ],
  "P075C": [
    {
      "scope": "所有汽车制造商",
      "code": "P075C",
      "zh-cn": "换档电磁阀G卡在开的位置",
      "en-us": "Shift Solenoid G Stuck On",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0201": [
    {
      "scope": "所有汽车制造商",
      "code": "P0201",
      "zh-cn": "喷油器电路/开路 - 第1缸",
      "en-us": "Injector Circuit/Open - Cylinder 1",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器控制电路该高的时候低，或者该低的时候高，该故障码会出现。故障原因包括喷油器接口，电路故障，喷油器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0834": [
    {
      "scope": "所有汽车制造商",
      "code": "P0834",
      "zh-cn": "离合器踏板开关B电路低",
      "en-us": "Clutch Pedal Switch B Circuit Low",
      "sys": "变速箱",
      "knowledge": "离合器踏板开关的作用是将离合器是否踩下的信息以电信号的形式输送给电子控制单元，作为控制发动机启动和定速巡航系统的重要参数。"
    }
  ],
  "P02F4": [
    {
      "scope": "所有汽车制造商",
      "code": "P02F4",
      "zh-cn": "喷油器电路范围/性能 - 气缸7",
      "en-us": "Cylinder 7 Injector Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第7缸喷油器电路出错，该故障码会出现。"
    }
  ],
  "P0C52": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C52",
      "zh-cn": "驱动电机A位置传感器电路A低",
      "en-us": "Drive Motor A Position Sensor Circuit A Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0674": [
    {
      "scope": "所有汽车制造商",
      "code": "P0674",
      "zh-cn": "气缸4电热塞电路/开路",
      "en-us": "Cylinder 4 Glow Plug Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸4电热塞电路发生故障，该故障码会出现。"
    }
  ],
  "P020D": [
    {
      "scope": "所有汽车制造商",
      "code": "P020D",
      "zh-cn": "喷油器正时 - 第4缸",
      "en-us": "Cylinder 4 Injection Timing",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器实际正时跟理想喷油正时偏差超过最大极限，该故障码会出现。"
    }
  ],
  "P0306": [
    {
      "scope": "所有汽车制造商",
      "code": "P0306",
      "zh-cn": "第6缸检测到失火",
      "en-us": "Cylinder 6 Misfire Detected",
      "sys": "点火系统",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。如果电子控制单元（ECU）检测到可能会对催化转换器造成破坏的失火，故障指示灯会闪烁，此时应立即关闭发动机。该故障码表明电子控制单元（ECU）检测到气缸6失火。故障原因包括点火系统故障，燃油输送故障，进气歧管或EGR，PCV的空气泄漏，机械性气缸故障等。"
    }
  ],
  "P033B": [
    {
      "scope": "所有汽车制造商",
      "code": "P033B",
      "zh-cn": "爆震传感器4电路范围/性能 （第2排）",
      "en-us": "Knock Sensor 4 Circuit Range/Performance (Bank 2)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压出错，该故障码会出现。"
    }
  ],
  "P0059": [
    {
      "scope": "所有汽车制造商",
      "code": "P0059",
      "zh-cn": "热氧传感器加热器电阻 （第2排，传感器1）",
      "en-us": "HO2S Heater Resistance (Bank 2, Sensor 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。如果电子控制单元（ECU）监测到加热氧传感器加热器控制电路的电流过低或过高，该故障码会出现。"
    }
  ],
  "P0028": [
    {
      "scope": "所有汽车制造商",
      "code": "P0028",
      "zh-cn": "进气阀门控制电磁阀电路范围/性能 （第2排）",
      "en-us": "Intake Valve Control Solenoid Circuit Range/Performance (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。如果A（进气）凸轮轴的实际位置跟理想位置相差超过20度，该故障码会出现。"
    }
  ],
  "P061A": [
    {
      "scope": "所有汽车制造商",
      "code": "P061A",
      "zh-cn": "内部控制模块-扭矩性能",
      "en-us": "Internal Control Module Torque Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P0AEA": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AEA",
      "zh-cn": "混合动力电池温度传感器D电路低",
      "en-us": "Hybrid Battery Temperature Sensor D Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P041F": [
    {
      "scope": "所有汽车制造商",
      "code": "P041F",
      "zh-cn": "二次空气喷射系统切换阀门A电路低",
      "en-us": "Secondary Air Injection System Switching Valve A Circuit Low",
      "sys": "排放控制",
      "knowledge": "在发动机刚刚启动时，二次空气喷射系统通过往排气歧管强制输入空气来氧化产生的碳氢化合物，一氧化碳等有害气体。这个过程也同时加速了催化转换器的暖化过程。如果二次空气喷射系统切换阀门A控制电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0846": [
    {
      "scope": "所有汽车制造商",
      "code": "P0846",
      "zh-cn": "变速器液压力（TFP）传感器/开关B电路范围/性能",
      "en-us": "Transmission Fluid Pressure Sensor/Switch B Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0B00": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B00",
      "zh-cn": "辅助变速器液泵电机U相电流",
      "en-us": "Auxiliary Transmission Fluid Pump Motor Phase U Current",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0A56": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A56",
      "zh-cn": "驱动电机B电流传感器电路范围/性能",
      "en-us": "Drive Motor B Current Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）内部故障。"
    }
  ],
  "P06B1": [
    {
      "scope": "所有汽车制造商",
      "code": "P06B1",
      "zh-cn": "传感器供电电源A电路低",
      "en-us": "Sensor Power Supply A Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": ""
    }
  ],
  "P0A00": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A00",
      "zh-cn": "电机电子系统冷却液温度传感器电路",
      "en-us": "Motor Electronics Coolant Temperature Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "电机电子系统冷却系统（MECS）是一套独立的为变速箱（例如eCVT）电机，控制模块以及直流/直流转换器提供冷却的系统。它拥有自己的散热器，冷却液泵，冷却液温度传感器等。电机电子系统冷却液温度（MECT）传感器运用热敏电阻的原理将电机电子系统冷却液的温度以电子形式输送给电子控制单元（ECU）。如果控制模块检测到电机电子系统冷却液温度（MECT）传感器信号跟基于其他其它信号计算的温度信号不吻合，该故障码会出现。"
    }
  ],
  "P0989": [
    {
      "scope": "所有汽车制造商",
      "code": "P0989",
      "zh-cn": "变速器液压传感器/开关E电路低",
      "en-us": "Transmission Fluid Pressure Sensor/Switch E Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0763": [
    {
      "scope": "所有汽车制造商",
      "code": "P0763",
      "zh-cn": "换档电磁阀C电子问题",
      "en-us": "Shift Solenoid C Electrical",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0440": [
    {
      "scope": "所有汽车制造商",
      "code": "P0440",
      "zh-cn": "蒸发排放系统",
      "en-us": "Evaporative Emission System",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。如果蒸发排放系统发生故障，该故障码会出现。故障原因包括EVAP炭罐吹扫阀故障，EVAP炭罐垫钱不严，EVAP管路故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0C31": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C31",
      "zh-cn": "换流器B冷却系统性能",
      "en-us": "Inverter B Cooling System Performance",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P0181": [
    {
      "scope": "所有汽车制造商",
      "code": "P0181",
      "zh-cn": "燃油温度传感器A电路范围/性能",
      "en-us": "Fuel Temperature Sensor A Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "燃油温度传感器负责监控通往燃油泵的燃油温度，以避免因温度过高（120摄氏度）造成蒸气锁现象，而造成对燃油泵或喷油器的破坏。如果电子控制单元（ECU）持续监测燃油温度传感器信号电压在设定时间段里超出了校准的正常值，则该故障码会出现。"
    }
  ],
  "P0A33": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A33",
      "zh-cn": "驱动电机B温度传感器电路高",
      "en-us": "Drive Motor B Temperature Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "驱动电机B温度传感器电路发生故障。故障原因包括电路，接头，电子控制单元，驱动电机等。有些车辆的驱动电机温度传感器跟驱动电机是一体的。所以，如果确定是该温度传感器本身的问题，有可能需要换掉整个驱动电机。"
    }
  ],
  "P0547": [
    {
      "scope": "所有汽车制造商",
      "code": "P0547",
      "zh-cn": "排气温度传感器电路（第2排，传感器1）",
      "en-us": "Exhaust Gas Temperature Sensor Circuit (Bank 2, Sensor 1)",
      "sys": "车速及怠速控制",
      "knowledge": "排气温度传感器的作用是将排气温度以电信号的形式输送给电子控制单元（ECU）。正确的空燃比产生的排气温度比过浓或过稀空燃比产生的排气温度要低。过高排气温度（>160摄氏度）会对发动机造成破坏。如果发动机冷启动10分钟后，电子控制单元（ECU）发现排气温度传感器变化小于40摄氏度，该故障码会出现。"
    }
  ],
  "P0A58": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A58",
      "zh-cn": "驱动电机B电流传感器电路高",
      "en-us": "Drive Motor B Current Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）内部故障。"
    }
  ],
  "P0B99": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B99",
      "zh-cn": "混合动力电池电压监控S电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense S Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0614": [
    {
      "scope": "所有汽车制造商",
      "code": "P0614",
      "zh-cn": "发动机控制模块（ECM）/变速器控制模块（TCU）不兼容",
      "en-us": "ECM/TCU Incompatible",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。故障原因包括发动机控制模块故障，或变速器控制模块故障，发动机控制模块与变速器控制模块之间短路等。"
    }
  ],
  "P0560": [
    {
      "scope": "所有汽车制造商",
      "code": "P0560",
      "zh-cn": "系统电压",
      "en-us": "System Voltage",
      "sys": "车速及怠速控制",
      "knowledge": "电子控制单元检测到系统电压在至少5秒的时间里低于10伏或高于16伏。故障原因包括发电机故障，电池故障，电池电极锈蚀，保险丝坏掉，电压调节器故障等。"
    }
  ],
  "P0769": [
    {
      "scope": "所有汽车制造商",
      "code": "P0769",
      "zh-cn": "换档电磁阀D间歇",
      "en-us": "Shift Solenoid D Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0071": [
    {
      "scope": "所有汽车制造商",
      "code": "P0071",
      "zh-cn": "周围空气温度传感器范围/性能",
      "en-us": "Ambient Air Temperature Sensor Range/Performance",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "周围空气温度传感器的作用是将外部空气温度以电信号的形式传输给电子控制单元（ECU），以帮助发动机实现最佳空燃比。该故障码表明周围空气温度传感器信号电路出错。"
    }
  ],
  "P0112": [
    {
      "scope": "所有汽车制造商",
      "code": "P0112",
      "zh-cn": "进气温度（IAT）传感器1电路低 （第1排）",
      "en-us": "Intake Air Temperature Sensor 1 Circuit Low (Bank 1)",
      "sys": "燃油或空气",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。如果电子控制单元（ECU）检测到进气温度（IAT）传感器信号电压低于自检的最小值（0.2伏或121摄氏度），该故障码会出现。故障原因包括传感器电路短路到接地，传感器故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0957": [
    {
      "scope": "所有汽车制造商",
      "code": "P0957",
      "zh-cn": "自动换档手动（ASM）变速器模式（动力/冬季/运动/等）电路低",
      "en-us": "Auto Shift Manual Mode Circuit Low",
      "sys": "变速箱",
      "knowledge": "自动换档手动变速器允许司机将变速器打入手动模式，手动控制升档或降档。"
    }
  ],
  "P0A9C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A9C",
      "zh-cn": "混合动力电池温度传感器A范围/性能",
      "en-us": "Hybrid Battery Temperature Sensor A Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路出错，该故障码会出现。"
    }
  ],
  "P0268": [
    {
      "scope": "所有汽车制造商",
      "code": "P0268",
      "zh-cn": "第3缸喷油器电路高",
      "en-us": "Cylinder 3 Injector Circuit High",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第3缸喷油器控制电路电压高于校准的最高值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P085A": [
    {
      "scope": "所有汽车制造商",
      "code": "P085A",
      "zh-cn": "换档控制模块B通讯电路",
      "en-us": "Gear Shift Control Module B Communication Circuit",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0347": [
    {
      "scope": "所有汽车制造商",
      "code": "P0347",
      "zh-cn": "凸轮轴位置（CMP）传感器A电路低 （第2排）",
      "en-us": "Camshaft Position Sensor A Circuit Low (Bank 2)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。该故障码表明A（进气/左/前）凸轮轴位置（CMP）传感器信号电压低于校准的最低值。故障原因包括凸轮轴位置（CMP）传感器电路，接头，其本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0703": [
    {
      "scope": "所有汽车制造商",
      "code": "P0703",
      "zh-cn": "刹车开关B电路",
      "en-us": "Brake Switch B Circuit",
      "sys": "变速箱",
      "knowledge": "刹车开关的作用是将刹车踏板踩下与否的信息以电信号的形式传送给电子控制单元（ECU），作为停止定速巡航和分离液力变矩器的重要依据。电子控制单元（ECU）没有收到刹车踏板位置（BPP）传感器的输入信号变化。故障原因包括BPA/BPP开关故障，校准错误，电路，接头故障，或者是连接到BPA或BPP的电子模块故障。"
    }
  ],
  "P0465": [
    {
      "scope": "所有汽车制造商",
      "code": "P0465",
      "zh-cn": "蒸发排放系统吹扫流量传感器电路",
      "en-us": "EVAP Purge Flow Sensor Circuit",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。如果电子控制单元（ECU）检测到蒸发排放系统（EVAP）吹扫流量传感器信号电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P0508": [
    {
      "scope": "所有汽车制造商",
      "code": "P0508",
      "zh-cn": "怠速空气控制系统电路低",
      "en-us": "Idle Air Control System Circuit Low",
      "sys": "车速及怠速控制",
      "knowledge": "怠速空气控制（IAC）阀带有一个由准确移动步进电机控制的可移动针阀。在节气门关闭的情况下，IAC阀通过改变旁通管路的空气流量，对怠速进行控制，以适应不同条件下的怠速。如果电子控制单元（ECU）检测到怠速空气控制系统电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0798": [
    {
      "scope": "所有汽车制造商",
      "code": "P0798",
      "zh-cn": "压力控制电磁阀C电子问题",
      "en-us": "Pressure Control Solenoid C Electrical",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。故障原因包括变速器液液面太低，变速器液太脏，变速器液压力控制电磁阀，电路，接头，或控制模块等。"
    }
  ],
  "P0773": [
    {
      "scope": "所有汽车制造商",
      "code": "P0773",
      "zh-cn": "换档电磁阀E电子问题",
      "en-us": "Shift Solenoid E Electrical",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0623": [
    {
      "scope": "所有汽车制造商",
      "code": "P0623",
      "zh-cn": "发电机指示灯控制电路",
      "en-us": "Generator Lamp Control Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "故障原因包括发电机指示灯，电路，接头，或电子控制单元（ECU）"
    }
  ],
  "P006A": [
    {
      "scope": "所有汽车制造商",
      "code": "P006A",
      "zh-cn": "歧管绝对压力（MAP）/空气流量相关性 （第1排）",
      "en-us": "MAP - Mass or Volume Air Flow Correlation (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "歧管绝对压力（MAP）传感器的作用是测量进气歧管内的压力（真空度）。动力总成控制模块（PCM）然后会将进气歧管压力与大气压力之间的差值（跟发动机负荷成线性关系）作为确定喷油器基本喷油量的一个依据，以帮助发动机在不同负荷下达到最佳空燃比。如果ECU发现歧管绝对压力（MAP）传感器跟空气流量（MAF）传感器推算的负载相差太大，则该故障码会出现。"
    }
  ],
  "P0576": [
    {
      "scope": "所有汽车制造商",
      "code": "P0576",
      "zh-cn": "定速巡航系统输入电路低",
      "en-us": "Cruise Control Input Circuit Low",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。"
    }
  ],
  "P0748": [
    {
      "scope": "所有汽车制造商",
      "code": "P0748",
      "zh-cn": "压力控制电磁阀A电子问题",
      "en-us": "Pressure Control Solenoid A Electrical",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。故障原因包括压力控制（PC）电磁阀电路，接头，或电磁阀本身。控制模块故障也可能导致该故障码出现。"
    }
  ],
  "P0057": [
    {
      "scope": "所有汽车制造商",
      "code": "P0057",
      "zh-cn": "热氧传感器加热器控制电路低 （第2排，传感器2）",
      "en-us": "HO2S Heater Control Circuit Low (Bank 2, Sensor 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）通过控制氧传感器加热器的开/关来保持氧传感器780oC的温度。如果加热器的控制电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P07AF": [
    {
      "scope": "所有汽车制造商",
      "code": "P07AF",
      "zh-cn": "变速器摩擦衬片G卡在开的位置",
      "en-us": "Transmission Friction Element G Stuck On",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0947": [
    {
      "scope": "所有汽车制造商",
      "code": "P0947",
      "zh-cn": "液压泵继电器电路低",
      "en-us": "Hydraulic Pump Relay Circuit Low",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P050E": [
    {
      "scope": "所有汽车制造商",
      "code": "P050E",
      "zh-cn": "冷车启动发动机排气温度超出范围",
      "en-us": "Cold Start Engine Exhaust Temperature Out of Range",
      "sys": "车速及怠速控制",
      "knowledge": "电子控制单元（ECU）可以估算冷车启动时催化转换器的温度变化情况。如果ECU发现催化转换器的实际温度跟估算温度的比值超出了校准的正常范围时，该故障码会出现。故障原因包括排气温度传感器，其电路，接头，ECU等。"
    }
  ],
  "P0292": [
    {
      "scope": "所有汽车制造商",
      "code": "P0292",
      "zh-cn": "第11缸喷油器电路高",
      "en-us": "Cylinder 11 Injector Circuit High",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第11缸喷油器控制电路电压高于校准的最高值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0327": [
    {
      "scope": "所有汽车制造商",
      "code": "P0327",
      "zh-cn": "爆震传感器1电路低（第1排或单个传感器）",
      "en-us": "Knock Sensor 1 Circuit Low (Bank 1 or Single Sensor)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压低于校准的最低值，该故障码会出现。故障原因包括爆震传感器电路故障，爆震传感器松动，爆震传感器本身故障，所用燃油油号不正确，发动机的模部件松动，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0BAB": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BAB",
      "zh-cn": "混合动力电池电压监控W电路低",
      "en-us": "Hybrid Battery Voltage Sense W Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P07B5": [
    {
      "scope": "所有汽车制造商",
      "code": "P07B5",
      "zh-cn": "变速器驻车档位置传感器/开关A电路性能/低",
      "en-us": "Transmission Park Position Sensor/Switch A Circuit Performance/Low",
      "sys": "变速箱",
      "knowledge": "驻车档位置传感器的作用是将变速杆是否在驻车档的位置的信号输送给电子控制单元（ECU）。如果ECU检测到驻车档位置传感器电路出错，该故障码会出现。"
    }
  ],
  "P0831": [
    {
      "scope": "所有汽车制造商",
      "code": "P0831",
      "zh-cn": "离合器踏板开关A电路低",
      "en-us": "Clutch Pedal Switch A Circuit Low",
      "sys": "变速箱",
      "knowledge": "离合器踏板开关的作用是将离合器是否踩下的信息以电信号的形式输送给电子控制单元，作为控制发动机启动和定速巡航系统的重要参数。"
    }
  ],
  "P0530": [
    {
      "scope": "所有汽车制造商",
      "code": "P0530",
      "zh-cn": "空调制冷剂压力传感器A电路",
      "en-us": "A/C Refrigerant Pressure Sensor A Circuit",
      "sys": "车速及怠速控制",
      "knowledge": "空调制冷剂压力传感器的作用是将空调制冷剂压力以电信号的形式传送给电子控制单元（ECU），作为控制冷却风扇开关和压缩机继电器的依据。该故障码表明空调制冷剂压力传感器本身或其电路故障，动力总成控制模块（PCM）故障等。"
    }
  ],
  "P032A": [
    {
      "scope": "所有汽车制造商",
      "code": "P032A",
      "zh-cn": "爆震传感器3电路 （第1排）",
      "en-us": "Knock Sensor 3 Circuit (Bank 1)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压超出了校准范围，该故障码会出现。"
    }
  ],
  "P0BDD": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BDD",
      "zh-cn": "驱动电机换流器温度传感器E电路低",
      "en-us": "Drive Motor Inverter Temperature Sensor E Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P033A": [
    {
      "scope": "所有汽车制造商",
      "code": "P033A",
      "zh-cn": "爆震传感器4电路 （第2排）",
      "en-us": "Knock Sensor 4 Circuit (Bank 2)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压超出了校准范围，该故障码会出现。"
    }
  ],
  "P0146": [
    {
      "scope": "所有汽车制造商",
      "code": "P0146",
      "zh-cn": "氧传感器电路无作用（第1排，传感器 3）",
      "en-us": "O2 Sensor Circuit No Activity Detected (Bank 1, Sensor 3)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）持续监控加热氧传感器已确定氧传感器在工作。如果加热氧传感器信号值持续停留在默认值，电子控制单元（ECU）就会命令振荡的空气/燃油比以试图监测到信号值的一些变化。如果这时候ECU依然无法检测传感器的信号的变化，该故障码就会出现。"
    }
  ],
  "P0B0E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B0E",
      "zh-cn": "混合动力电池组电流传感器B电路",
      "en-us": "Hybrid Battery Pack Current Sensor B Circuit",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块通过来自电池电流传感器的信号来监控电池的充电放电情况。如果控制模块发现电池电流传感器发生故障，该故障码会出现。"
    }
  ],
  "P0039": [
    {
      "scope": "所有汽车制造商",
      "code": "P0039",
      "zh-cn": "涡轮/超级增压器旁通阀门控制电路范围/性能",
      "en-us": "Turbocharger/Supercharger Bypass Valve Control Circuit Range/Performance",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。增压器旁通阀的作用是当增压压力过大时，打开旁通阀将部分高压空气放掉，从而达到保护增压器和发动机的目的。该故障码表明涡轮/超级增压器旁通阀门控制电路出错。"
    }
  ],
  "P0261": [
    {
      "scope": "所有汽车制造商",
      "code": "P0261",
      "zh-cn": "第1缸喷油器电路低",
      "en-us": "Cylinder 1 Injector Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第1缸喷油器控制电路电压低于校准的最低值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0AF3": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AF3",
      "zh-cn": "驱动电机换流器温度传感器B电路范围/性能",
      "en-us": "Drive Motor Inverter Temperature Sensor B Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0778": [
    {
      "scope": "所有汽车制造商",
      "code": "P0778",
      "zh-cn": "压力控制电磁阀B电子问题",
      "en-us": "Pressure Control Solenoid B Electrical",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。故障原因包括压力控制电磁阀控制电路，接头，或电磁阀本身。控制模块故障也会导致该故障码出现。"
    }
  ],
  "P0AC1": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AC1",
      "zh-cn": "混合动力电池组电流传感器A电路低",
      "en-us": "Hybrid Battery Pack Current Sensor A Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块通过来自电池电流传感器的信号来监控电池的充电放电情况。如果控制模块发现电池电流传感器信号电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P023A": [
    {
      "scope": "所有汽车制造商",
      "code": "P023A",
      "zh-cn": "增压空气冷却器冷却液泵控制电路/开路",
      "en-us": "Charge Air Cooler Coolant Pump Control Circuit/Open",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。如果增压空气冷却器的冷却液泵控制电路发生故障，该故障码会出现。"
    }
  ],
  "P0455": [
    {
      "scope": "所有汽车制造商",
      "code": "P0455",
      "zh-cn": "蒸发排放系统检测到泄漏（大量泄漏）",
      "en-us": "Evaporative Emission System Leak Detected (large leak)",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。发动机正常运转，但不在怠速。如果电子控制单元（ECU）检测到蒸发排放（EVAP）系统没有吹扫流量，一般是由于燃油蒸汽管路阻塞，大的燃油蒸汽泄漏，或多个小的燃油蒸汽泄漏而造成。"
    }
  ],
  "P0689": [
    {
      "scope": "所有汽车制造商",
      "code": "P0689",
      "zh-cn": "发动机控制模块（ECM）/动力总成控制模块（PCM）电源继电器监控电路低",
      "en-us": "ECM/PCM Power Relay Sense Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。发动机控制模块继电器的作用是在点火开关关闭以后，继续保持发动机控制模块的供电，直到发动机控制模块完成关闭过程。如果被动防盗系统（PATS）显示钥匙处于ON（运行）或START（启动）的位置，而点火开关位置（ISP-R）电路显示OFF（关），ACC（附件），LOCK（锁），该故障码会出现。故障原因包括点火电路保险丝，点火开关，ISP-R电路，ECU继电器，被动防盗系统，ECU等。"
    }
  ],
  "P0AA1": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AA1",
      "zh-cn": "混合动力电池正极接触器电路卡在关的位置",
      "en-us": "Hybrid Battery Positive Contactor Circuit Stuck Closed",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果第1和第2系统主继电器（SMR）中的一个卡住，有可能会导致高压系统不能关闭。所以，混合动力汽车电子控制单元如果一旦发现其中的任何一个继电器发生故障，便会终止整个系统。"
    }
  ],
  "P0488": [
    {
      "scope": "所有汽车制造商",
      "code": "P0488",
      "zh-cn": "废气再循环节气门控制电路A范围/性能",
      "en-us": "Exhaust Gas Recirculation Throttle Control Circuit A Range/Performance",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）收到进气节气门执行器的错误信息，比如实际节气门位置与理想节气门位置有较大偏差，回位弹簧出错，错误的输入信号等，该故障码会出现。"
    }
  ],
  "P0601": [
    {
      "scope": "所有汽车制造商",
      "code": "P0601",
      "zh-cn": "内部控制模块存储器检查错误",
      "en-us": "Internal Control Module Memory Check Sum Error",
      "sys": "计算机或辅助输出电路",
      "knowledge": "故障原因包括电池电极锈蚀（导致电压不稳），电子控制模块电路故障，重新编程化故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0580": [
    {
      "scope": "所有汽车制造商",
      "code": "P0580",
      "zh-cn": "定速巡航系统多功能输入A电路低",
      "en-us": "Cruise Control Multi-Function Input A Circuit Low",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。电子控制单元（ECU）检测到定速巡航多功能输入开关A电路电压低于校准的最低值。故障原因包括多功能开关，电路，接头，机械故障等。"
    }
  ],
  "P0128": [
    {
      "scope": "所有汽车制造商",
      "code": "P0128",
      "zh-cn": "冷却液节温器（冷却液温度低于节温器调节温度）",
      "en-us": "Coolant Thermostat (Coolant Temperature Below Thermostat Regulating Temperature)",
      "sys": "燃油或空气",
      "knowledge": "节温器的作用是当冷却液温度低的时候关闭，仅允许冷却液在发动机内循环，提高热车速度；当水温超过设定温度的时候，节温器打开，允许冷却液循环到水箱散热器，有效提高降温效率。该故障码表明节温器在发动机启动后的设定时间内没有达到所需的发动机工作温度。故障原因包括节温器卡在打开的位置，发动机冷却液温度（ECT）传感器故障等。"
    }
  ],
  "P00A8": [
    {
      "scope": "所有汽车制造商",
      "code": "P00A8",
      "zh-cn": "进气温度（IAT）传感器2电路高 （第2排）",
      "en-us": "Intake Air Temperature Sensor 2 Circuit High (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。如果电子控制单元（ECU）检测到进气温度（IAT）传感器信号电压高于自检的最大值（4.6伏或-50摄氏度），该故障码会出现。"
    }
  ],
  "P0AB2": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AB2",
      "zh-cn": "混合动力电池组空气温度传感器B电路范围/性能",
      "en-us": "Hybrid Battery Pack Air Temperature Sensor B Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车的进气温度（IAT）传感器位于电池总成之内。该故障码的故障原因包括混合动力电池（进气温度（IAT）传感器），电池组控制模块等。"
    }
  ],
  "P0BC3": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BC3",
      "zh-cn": "混合动力电池温度传感器E电路范围/性能",
      "en-us": "Hybrid Battery Temperature Sensor E Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路出错，该故障码会出现。"
    }
  ],
  "P006E": [
    {
      "scope": "所有汽车制造商",
      "code": "P006E",
      "zh-cn": "涡轮/超级增压器增压控制A供电电压电路低",
      "en-us": "Turbocharger/Supercharger Boost Control A Supply Voltage Circuit Low",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。涡轮/超级增压器增压控制器的作用是当增压压力达到设定值后，气压推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮速度，控制增压水平。该故障码表明涡轮/超级增压器增压控制A供电电压低于校准的最低值。"
    }
  ],
  "P00AE": [
    {
      "scope": "所有汽车制造商",
      "code": "P00AE",
      "zh-cn": "进气温度（IAT）传感器1电路间歇 /不稳定 （第2排）",
      "en-us": "Intake Air Temperature Sensor 1 Circuit Intermittent (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。如果电子控制单元（ECU）检测到进气温度（IAT）传感器信号电压突然变化，该故障码会出现。"
    }
  ],
  "P0263": [
    {
      "scope": "所有汽车制造商",
      "code": "P0263",
      "zh-cn": "第1缸贡献/平衡",
      "en-us": "Cylinder 1 Contribution/Balance",
      "sys": "燃油或空气",
      "knowledge": "电子控制单元（ECU）检测到第1缸的曲轴加速贡献低于校准值。故障原因包括第1缸喷油系统；或其它影响第1缸的发动机问题。"
    }
  ],
  "P0430": [
    {
      "scope": "所有汽车制造商",
      "code": "P0430",
      "zh-cn": "催化转换器系统效能低于阈值 （第2排）",
      "en-us": "Catalyst System Efficiency Below Threshold (Bank 2)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明电子控制单元（ECU）检测到催化转换器系统效率低于可以接受的最低值。故障原因包括排气管或排气歧管附近尾气泄漏，催化箱失效，发动机冷却液温度（ECT）传感器故障，发动机失火或正时滞后，机油太脏，氧传感器故障，燃油系统压力太高等。"
    }
  ],
  "P0658": [
    {
      "scope": "所有汽车制造商",
      "code": "P0658",
      "zh-cn": "执行器电源电压A电路低",
      "en-us": "Actuator Supply Voltage A Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "动力总成控制模块（PCM）检测到变速器执行器供电A电路电压过低。故障原因包括电路或接头故障，自动变速器液压传感器故障，电磁阀故障，变速器控制模块故障，变速器输入速度（RPM）传感器故障，变速器输出速度（RPM）传感器故障等。"
    }
  ],
  "P0474": [
    {
      "scope": "所有汽车制造商",
      "code": "P0474",
      "zh-cn": "排气压力传感器A电路间歇/不稳定",
      "en-us": "Exhaust Pressure Sensor A Circuit Intermittent/Erratic",
      "sys": "排放控制",
      "knowledge": "排气压力传感器的作用是将排气系统压力以电信号的形式输送给电子控制单元（ECU）。如果ECU检测到排气压力传感器A信号电路电压突然变化，该故障码会出现。"
    }
  ],
  "P0079": [
    {
      "scope": "所有汽车制造商",
      "code": "P0079",
      "zh-cn": "排气阀门控制电磁阀电路低 （第1排）",
      "en-us": "Exhaust Valve Control Solenoid Circuit Low (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。如果排气凸轮轴调节阀电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P066D": [
    {
      "scope": "所有汽车制造商",
      "code": "P066D",
      "zh-cn": "气缸2电热塞控制电路高",
      "en-us": "Cylinder 2 Glow Plug Control Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸2电热塞电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P02D7": [
    {
      "scope": "所有汽车制造商",
      "code": "P02D7",
      "zh-cn": "喷油器补偿学习在最高限气缸6",
      "en-us": "Cylinder 6 Fuel Injector Offset Learning At Max Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第6缸喷油器补偿学习已经达到了最高学习极限，该故障码会出现。"
    }
  ],
  "P0685": [
    {
      "scope": "所有汽车制造商",
      "code": "P0685",
      "zh-cn": "发动机控制模块（ECM）/动力总成控制模块（PCM）电源继电器控制电路/开路",
      "en-us": "ECM/PCM Power Relay Control Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。发动机控制模块继电器的作用是在点火开关关闭以后，继续保持发动机控制模块的供电，直到发动机控制模块完成关闭过程。如果电子控制单元（ECU）通过电源继电器通电的时间超过了一定时限，而点火开关位置电路（ISP-R）却显示钥匙在OFF（关），ACC（附件），或LOCK（锁）的位置，该故障码会出现。故障原因包括ECU继电器控制电路，ECU继电器，ECU等。"
    }
  ],
  "P099C": [
    {
      "scope": "所有汽车制造商",
      "code": "P099C",
      "zh-cn": "换档电磁阀G控制电路高",
      "en-us": "Shift Solenoid G Control Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0401": [
    {
      "scope": "所有汽车制造商",
      "code": "P0401",
      "zh-cn": "废气再循环阀A检测到流量不足",
      "en-us": "Exhaust Gas Recirculation A Flow Insufficient Detected",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。在汽车正常稳定行驶并且废气再循环系统（EGR）处于开的情况下，如果电子控制单元（ECU）发现废气再循环（EGR）的流量比基于其他信息的估计值过低时，该故障码会出现。故障原因包括DPFE传感器电路，接头，或本身故障，DPFE管路故障，EGR阀本身故障或管路阻塞，电子控制模块等。"
    }
  ],
  "P0316": [
    {
      "scope": "所有汽车制造商",
      "code": "P0316",
      "zh-cn": "在启动时检测到失火（前1000转）",
      "en-us": "Engine Misfire Detected on Startup (First 1000 Revolutions)",
      "sys": "点火系统",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。如果电子控制单元（ECU）检测到可能会对催化转换器造成破坏的失火，故障指示灯会闪烁，此时应立即关闭发动机。该故障码表明电子控制单元（ECU）在启动后的1000转之内检测到气缸失火。"
    }
  ],
  "P0B4B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B4B",
      "zh-cn": "混合动力电池电压监控D电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense D Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0210": [
    {
      "scope": "所有汽车制造商",
      "code": "P0210",
      "zh-cn": "喷油器电路/开路 - 第10缸",
      "en-us": "Injector Circuit/Open - Cylinder 10",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器控制电路出错，该故障码会出现。故障原因包括喷油器接口，电路故障，喷油器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0861": [
    {
      "scope": "所有汽车制造商",
      "code": "P0861",
      "zh-cn": "换档控制模块通信电路低",
      "en-us": "Gear Shift Control Module A Communication Circuit Low",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0AE9": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AE9",
      "zh-cn": "混合动力电池温度传感器D范围/性能",
      "en-us": "Hybrid Battery Temperature Sensor D Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路出错，该故障码会出现。"
    }
  ],
  "P0056": [
    {
      "scope": "所有汽车制造商",
      "code": "P0056",
      "zh-cn": "热氧传感器加热器控制电路 （第2排，传感器2）",
      "en-us": "HO2S Heater Control Circuit (Bank 2, Sensor 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）通过控制氧传感器加热器的开/关来保持氧传感器780oC的温度。如果氧传感器在设定的时间内没有达到要求的温度，或ECU无法维持设定的温度，该故障码会出现。"
    }
  ],
  "P071C": [
    {
      "scope": "所有汽车制造商",
      "code": "P071C",
      "zh-cn": "变速器模式开关A电路高",
      "en-us": "Transmission Mode Switch A Circuit High",
      "sys": "变速箱",
      "knowledge": "变速器模式开关的作用是根据用户选择的模式（运动/经济/冬季等）来指令变速器提前或延后换档，或高挡起步等。故障原因包括变速器模式开关，电路，接头，或控制模块。"
    }
  ],
  "P008F": [
    {
      "scope": "所有汽车制造商",
      "code": "P008F",
      "zh-cn": "发动机冷却液温度/燃油温度相关性",
      "en-us": "Engine Coolant Temperature/Fuel Temperature Correlation",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。电子控制单元（ECU）检测到发动机冷却液温度（ECT）传感器和燃油温度（FT）传感器的信号差超过了校准的最大允许范围。"
    }
  ],
  "P0743": [
    {
      "scope": "所有汽车制造商",
      "code": "P0743",
      "zh-cn": "液力变矩器离合器电路电子问题",
      "en-us": "Torque Converter Clutch Circuit Electrical",
      "sys": "变速箱",
      "knowledge": "液力变矩器的作用就像手动变速器里的离合器，允许来自发动机的扭力跟变速器暂时断开，从而实现平稳换档。但不同的是，液力变矩器可以起到像降挡一样的增加力扭力的作用。故障原因包括液力变矩器离合器（TCC）电磁阀电路或接头故障，TCC电磁阀机械故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0C33": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C33",
      "zh-cn": "混合动力电池温度传感器F电路",
      "en-us": "Hybrid Battery Temperature Sensor F Circuit",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压超出正常范围，该故障码会出现。"
    }
  ],
  "P0915": [
    {
      "scope": "所有汽车制造商",
      "code": "P0915",
      "zh-cn": "换档位置电路范围/性能",
      "en-us": "Gear Shift Position Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档位置（监控换档杆向前/向后的位置，奇/偶档位）电路故障。"
    }
  ],
  "P003A": [
    {
      "scope": "所有汽车制造商",
      "code": "P003A",
      "zh-cn": "涡轮/超级增压器增压控制A位置超过学习极限",
      "en-us": "Turbocharger/Supercharger Boost Control A Position Exceeded Learning Limit",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。涡轮/超级增压器增压控制器的作用是当增压压力达到设定值后，气压推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮速度，控制增压水平。该故障码表明涡轮/超级增压器增压控制A位置超过正常范围。"
    }
  ],
  "P0635": [
    {
      "scope": "所有汽车制造商",
      "code": "P0635",
      "zh-cn": "动力转向控制电路",
      "en-us": "Power Steering Control Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子动力转向（EPS）系统根据车速传感器（VSS）的信号，控制动力转向活塞两侧的旁通液压油流量，从而改变方向盘上的转向力。该故障码表明电子控制单元（ECU）检测到动力转向控制电路出错。故障原因包括动力转向压力开关，其电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P062A": [
    {
      "scope": "所有汽车制造商",
      "code": "P062A",
      "zh-cn": "燃油泵A控制电路范围/性能",
      "en-us": "Fuel Pump A Control Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "燃油泵的作用是把燃油从燃油箱中吸出、加压后输送到供油管中，和燃油压力调节器配合建立一定的燃油压力。如果电子控制单元（ECU）检测到燃油泵控制电路电压突然变化，该故障码会出现。"
    }
  ],
  "P067D": [
    {
      "scope": "所有汽车制造商",
      "code": "P067D",
      "zh-cn": "气缸5电热塞控制电路高",
      "en-us": "Cylinder 5 Glow Plug Control Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸5电热塞电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0B1D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B1D",
      "zh-cn": "混合动力电池组电压监控C电路间歇/不稳定",
      "en-us": "Hybrid Battery Pack Voltage Sense C Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0800": [
    {
      "scope": "所有汽车制造商",
      "code": "P0800",
      "zh-cn": "变速器/分动箱控制系统（故障指示灯请求）",
      "en-us": "Transfer Case Control System (MIL Request)",
      "sys": "变速箱",
      "knowledge": "分动箱是四驱车上的一个配件，它的作用是将发动机的动力进行分配，可以将动力只输出到后轴，或者同时输出到前/后轴。故障指示灯（MIL）也叫检查引擎灯，其作用是当控制模块检测到故障时，点亮仪表盘上的一个黄色或红色的发动机符号。"
    }
  ],
  "P0380": [
    {
      "scope": "所有汽车制造商",
      "code": "P0380",
      "zh-cn": "电热塞/加热器电路A",
      "en-us": "Glow Plug/Heater Circuit A",
      "sys": "点火系统",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。该故障码表明电热塞加热器电路发生故障。"
    }
  ],
  "P04A5": [
    {
      "scope": "所有汽车制造商",
      "code": "P04A5",
      "zh-cn": "排气压力控制阀门B卡在关的位置",
      "en-us": "Exhaust Pressure Control Valve B Stuck Closed",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。该故障码表明排气压力控制阀门B卡在关的位置。"
    }
  ],
  "P008B": [
    {
      "scope": "所有汽车制造商",
      "code": "P008B",
      "zh-cn": "低压燃油系统压力 - 太高",
      "en-us": "Low Pressure Fuel System Pressure - Too High",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "低压燃油泵（40-95psi）的作用是将汽油从油箱送往高压燃油泵。凸轮轴驱动的高压燃油泵可以将汽油加压到最高1900psi。燃油系统需要保持恒定的压力，油压过低则喷油器喷油太弱或不喷油，油压太高则使油路损毁或喷油器损坏。该故障码表明电子控制单元（ECU）检测到低压燃油系统压力在设定的时间段内高于校准的最高值。压力过高可能是燃油压力调节器，油路堵塞，燃油压力传感器，燃油泵控制模块等问题。"
    }
  ],
  "P0666": [
    {
      "scope": "所有汽车制造商",
      "code": "P0666",
      "zh-cn": "动力总成控制模块（PCM）/发动机控制模块（ECM）/变速器控制模块（TCU）内部温度传感器A电路",
      "en-us": "PCM/ECM/TCU Internal Temperature Sensor A Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。该故障码表明控制模块内部温度传感器信号电路电压超出了校准的最大范围。故障原因内部温度传感器，电路，接头，或控制模块。"
    }
  ],
  "P0925": [
    {
      "scope": "所有汽车制造商",
      "code": "P0925",
      "zh-cn": "换档后拉执行器 （后拉换档杆，偶数齿轮，2,4,6）电路范围/性能",
      "en-us": "Gear Shift Reverse Actuator Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0B2F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B2F",
      "zh-cn": "混合动力电池D电压",
      "en-us": "Hybrid Battery D Voltage",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0BA8": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BA8",
      "zh-cn": "混合动力电池电压监控V电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense V Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P052C": [
    {
      "scope": "所有汽车制造商",
      "code": "P052C",
      "zh-cn": "冷车启动A凸轮轴位置正时过于超前 （第2排）",
      "en-us": "Cold Start A Camshaft Position Timing Over-Advanced (Bank 2)",
      "sys": "车速及怠速控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。冷车启动时，如果电子控制单元（ECU）检测到A（进气/左/前）凸轮轴正时超过最大设定值，或者一直处于超前状态，则该故障码会出现。"
    }
  ],
  "P0468": [
    {
      "scope": "所有汽车制造商",
      "code": "P0468",
      "zh-cn": "蒸发排放系统吹扫流量传感器电路高",
      "en-us": "EVAP Purge Flow Sensor Circuit High",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。电子控制单元（ECU）检测到蒸发排放系统（EVAP）吹扫流量传感器信号电压高于校准的最高值。"
    }
  ],
  "P0608": [
    {
      "scope": "所有汽车制造商",
      "code": "P0608",
      "zh-cn": "控制模块车速传感器（VSS）（VSS）输出A",
      "en-us": "Control Module VSS Output A",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。车速传感器（VSS）的作用是将汽车的速度以电信号形式传输给电子控制单元（ECU），作为控制发动机怠速，自动变速器换档，液力变矩器器锁止，发动机冷却风扇的开闭，以及巡航定速等其它功能的参考依据。"
    }
  ],
  "P0221": [
    {
      "scope": "所有汽车制造商",
      "code": "P0221",
      "zh-cn": "节气门/踏板位置传感器/开关B电路范围/性能",
      "en-us": "Throttle/Pedal Position Sensor/Switch B Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。该故障码表明节气门踏板位置传感器B电路电压在节气门关闭或节气门全开时超出正常范围。故障原因包括节气门体故障，节气门链接卡住，传感器电路，接口，或本身故障。"
    }
  ],
  "P0B97": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B97",
      "zh-cn": "混合动力电池电压监控S电路低",
      "en-us": "Hybrid Battery Voltage Sense S Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0108": [
    {
      "scope": "所有汽车制造商",
      "code": "P0108",
      "zh-cn": "歧管绝对压力（传感器）/大气压力（传感器）电路高",
      "en-us": "Manifold Absolute Pressure/Barometric Pressure Circuit High",
      "sys": "燃油或空气",
      "knowledge": "歧管绝对压力（MAP）传感器的作用是测量进气歧管内的压力（真空度）。动力总成控制模块（PCM）然后会将进气歧管压力与大气压力之间的差值（跟发动机负荷成线性关系）作为确定喷油器基本喷油量的一个依据，以帮助发动机在不同负荷下达到最佳空燃比。大气压力传感器（有时候也叫高海拔补偿器，HAC）的作用是将大气压力以电信号的形式输送给电子控制模块。大气压力会随天气和海拔高度的变化而变化。压力越小，空气越稀薄。动力总成控制模块（PCM）会根据大气压力的数值来修正燃油供给，以帮助发动机达到最佳空燃比。如果电子控制单元（ECU）检测歧管绝对压力（MAP）传感器/气压传感器信号电压高于校准的最高值，该故障码会出现。故障原因包括MAP或大气压力（BARO）传感器信号电路短路到正极，传感器故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0766": [
    {
      "scope": "所有汽车制造商",
      "code": "P0766",
      "zh-cn": "换档电磁阀D性能问题或者卡在关的位置",
      "en-us": "Shift Solenoid D Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P00AC": [
    {
      "scope": "所有汽车制造商",
      "code": "P00AC",
      "zh-cn": "进气温度（IAT）传感器1电路低 （第2排）",
      "en-us": "Intake Air Temperature Sensor 1 Circuit Low (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。如果电子控制单元（ECU）检测到进气温度（IAT）传感器信号电压低于自检的最小值（0.2伏或121摄氏度），该故障码会出现。"
    }
  ],
  "P0047": [
    {
      "scope": "所有汽车制造商",
      "code": "P0047",
      "zh-cn": "涡轮/超级增压器增压控制A电路低",
      "en-us": "Turbocharger/Supercharger Boost Control A Circuit Low",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。涡轮/超级增压器增压控制器的作用是当增压压力达到设定值后，气压推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮速度，控制增压水平。该故障码表明涡轮/超级增压器增压控制电路电压低于校准的最低值。"
    }
  ],
  "P085B": [
    {
      "scope": "所有汽车制造商",
      "code": "P085B",
      "zh-cn": "换档控制模块B通讯电路低",
      "en-us": "Gear Shift Control Module B Communication Circuit Low",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P00A3": [
    {
      "scope": "所有汽车制造商",
      "code": "P00A3",
      "zh-cn": "增压空气冷却器温度传感器电路高 （第2排）",
      "en-us": "Charge Air Cooler Temperature Sensor Circuit High (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。该故障码的原因包括增压空气冷却器温度传感器，其电路，或接头问题。"
    }
  ],
  "P0B1B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B1B",
      "zh-cn": "混合动力电池组电压监控C电路低",
      "en-us": "Hybrid Battery Pack Voltage Sense C Circuit Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P02C7": [
    {
      "scope": "所有汽车制造商",
      "code": "P02C7",
      "zh-cn": "燃油（空燃比）修剪在最低限 - 气缸12",
      "en-us": "Cylinder 12 - Fuel Trim at Min Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最低极限超过一定时间，该故障码会出现。"
    }
  ],
  "P012A": [
    {
      "scope": "所有汽车制造商",
      "code": "P012A",
      "zh-cn": "涡轮/超级增压器进口压力传感器 - 电路",
      "en-us": "Turbocharger/Supercharger Inlet Pressure Sensor - Circuit",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。该故障码表明进口压力传感器（节气门阀下游）电路电压超出校准的正常值。该故障码对有些车辆可能是歧管绝对压力（MAP）传感器的问题。"
    }
  ],
  "P0AFE": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AFE",
      "zh-cn": "混合动力电池系统电压太低 - 未达到升压转换的电压",
      "en-us": "Hybrid Battery System Voltage Too Low for Voltage Step Up Conversion",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0C66": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C66",
      "zh-cn": "发电机位置传感器电路A低",
      "en-us": "Generator Position Sensor Circuit A Low",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括发电机位置传感器电路，接头，或传感器本身；混合动力车辆发电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P0053": [
    {
      "scope": "所有汽车制造商",
      "code": "P0053",
      "zh-cn": "热氧传感器加热器电阻 （第1排，传感器1）",
      "en-us": "HO2S Heater Resistance (Bank 1, Sensor 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。该故障码表明加热氧传感器加热器控制电路的电流过低或过高。"
    }
  ],
  "P0964": [
    {
      "scope": "所有汽车制造商",
      "code": "P0964",
      "zh-cn": "压力控制电磁阀B控制电路/开路",
      "en-us": "Pressure Control Solenoid B Control Circuit/Open",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。该故障码的原因包括压力控制电磁阀本身，电路，接头等。同时要注意，变速箱控制电磁阀故障有些情况下并不并不是因为电子问题，而是由于管路阻塞或者是机械方面的问题。好多时候，仅仅因为变速箱油太脏就会造成很多这方面的故障。"
    }
  ],
  "P0A3F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A3F",
      "zh-cn": "驱动电机A位置传感器电路",
      "en-us": "Drive Motor A Position Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括驱动电机A位置传感器电路，接头，或传感器本身；混合动力驱动电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P0527": [
    {
      "scope": "所有汽车制造商",
      "code": "P0527",
      "zh-cn": "风扇速度传感器电路范围/性能",
      "en-us": "Fan Speed Sensor Circuit Range/Performance",
      "sys": "车速及怠速控制",
      "knowledge": "故障原因包括风扇速度传感器，其电路，接头，或电子控制单元（ECU）等。"
    }
  ],
  "P0144": [
    {
      "scope": "所有汽车制造商",
      "code": "P0144",
      "zh-cn": "氧传感器电路高电压（第1排，传感器 3）",
      "en-us": "O2 Sensor Circuit High Voltage (Bank 1, Sensor 3)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。当加热氧传感器信号的电压在设定的时间段内持续高于1.5伏时，该故障码就会出现。故障原因包括氧传感器信号电路短路到正极，氧传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P082F": [
    {
      "scope": "所有汽车制造商",
      "code": "P082F",
      "zh-cn": "换档杆Y位置电路高",
      "en-us": "Gear Lever Y Position Circuit High",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0C02": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C02",
      "zh-cn": "驱动电机B电流",
      "en-us": "Drive Motor B Current",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P083E": [
    {
      "scope": "所有汽车制造商",
      "code": "P083E",
      "zh-cn": "变速器液压力（TFP）传感器/开关G电路间歇",
      "en-us": "Transmission Fluid Pressure Sensor/Switch G Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0A18": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A18",
      "zh-cn": "电机转矩传感器电路范围/性能",
      "en-us": "Motor Torque Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "控制模块检测到电机转矩传感器信号超出校准的正常范围。"
    }
  ],
  "P0435": [
    {
      "scope": "所有汽车制造商",
      "code": "P0435",
      "zh-cn": "催化转换器温度传感器电路 （第2排，传感器1）",
      "en-us": "Catalyst Temperature Sensor Circuit (Bank 2, Sensor 1)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器温度传感器电路发生故障。故障原因包括催化转换器温度传感器，其电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P0901": [
    {
      "scope": "所有汽车制造商",
      "code": "P0901",
      "zh-cn": "离合器执行器电路范围/性能",
      "en-us": "Clutch Actuator Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "离合器执行器是离合器动作的执行者，其基本功能是分离和结合离合器。机电式离合器执行器以电动机作为动力源，通过控制转速和位置，实现对离合器执行结合过程的精确调节。"
    }
  ],
  "P020A": [
    {
      "scope": "所有汽车制造商",
      "code": "P020A",
      "zh-cn": "喷油器正时 - 第1缸",
      "en-us": "Cylinder 1 Injection Timing",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器实际正时跟理想喷油正时偏差超过最大极限，该故障码会出现。"
    }
  ],
  "P0BF2": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BF2",
      "zh-cn": "驱动电机B，U相电流传感器电路范围/性能",
      "en-us": "Drive Motor B Phase U Current Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0403": [
    {
      "scope": "所有汽车制造商",
      "code": "P0403",
      "zh-cn": "废气再循环阀A控制电路",
      "en-us": "Exhaust Gas Recirculation A Control Circuit",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。对于拥有电子废气再循环系统（EEGR）的车辆，电子控制单元（ECU）会持续监测EEGR的线圈，电路。如果发现诸如开路，短路的情况，该故障码会出现。此时整个EEGR系统会被禁用，其他的对EEGR的监测也会被终止。故障原因包括EEGR执行器，或其电路，接头故障，EEGR卷扬马达，电子控制模块等。"
    }
  ],
  "P0037": [
    {
      "scope": "所有汽车制造商",
      "code": "P0037",
      "zh-cn": "热氧传感器加热器控制电路低 （第1排，传感器 2）",
      "en-us": "HO2S Heater Control Circuit Low (Bank 1, Sensor 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）通过控制氧传感器加热器的开/关来保持氧传感器780oC的温度。如果加热器的控制电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0615": [
    {
      "scope": "所有汽车制造商",
      "code": "P0615",
      "zh-cn": "起动机继电器电路",
      "en-us": "Starter Relay Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "起动机继电器（电磁阀）的工作原理是，当点火开关打开时，小电流经过一个电磁线圈，导致一对更大的接触器结合，从而允许大电流经过动电机，而启动发动机。该故障码表明起动机继电器电路故障。故障原因包括起动机，其电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P0A6E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A6E",
      "zh-cn": "驱动电机B，W相电流高",
      "en-us": "Drive Motor B Phase W Current High",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0497": [
    {
      "scope": "所有汽车制造商",
      "code": "P0497",
      "zh-cn": "蒸发排放系统低吹扫流速",
      "en-us": "Evaporative Emission System Low Purge Flow",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。该故障码表明蒸发排放系统的吹扫流速过低。"
    }
  ],
  "P02C9": [
    {
      "scope": "所有汽车制造商",
      "code": "P02C9",
      "zh-cn": "喷油器泄漏 - 气缸12",
      "en-us": "Cylinder 12 - Injector Leaking",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第12缸喷油器发生泄漏。"
    }
  ],
  "P0661": [
    {
      "scope": "所有汽车制造商",
      "code": "P0661",
      "zh-cn": "进气歧管调谐阀控制电路低（第1排）",
      "en-us": "Intake Manifold Tuning Valve Control Circuit Low (Bank 1)",
      "sys": "计算机或辅助输出电路",
      "knowledge": "如果进气歧管通路（runner）的长度最佳，气门关闭所产生的压力波会帮助将油气混合物导入发动机。问题是发动机不同转速对应的最佳进气歧管通路长度也不同。歧管调谐阀（MTV）的作用就是根据发动机转速，将进气导入不同长度的进气歧管通路，以此来优化发动机在不同转速时的扭矩。如果电子控制单元（ECU）在自检时检测到进气歧管调谐阀控制电路电压低于校准的最低值，则该故障码会出现。"
    }
  ],
  "P0940": [
    {
      "scope": "所有汽车制造商",
      "code": "P0940",
      "zh-cn": "液压油温度传感器电路高",
      "en-us": "Hydraulic Oil Temperature Sensor Circuit High",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0860": [
    {
      "scope": "所有汽车制造商",
      "code": "P0860",
      "zh-cn": "换档控制模块通信电路",
      "en-us": "Gear Shift Control Module A Communication Circuit",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0894": [
    {
      "scope": "所有汽车制造商",
      "code": "P0894",
      "zh-cn": "变速器组件打滑",
      "en-us": "Transmission Component Slipping",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0C07": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C07",
      "zh-cn": "驱动电机A，U-V-W相电路高",
      "en-us": "Drive Motor A Phase U-V-W Circuit High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0C69": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C69",
      "zh-cn": "发电机位置传感器电路B",
      "en-us": "Generator Position Sensor Circuit B",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括发电机位置传感器电路，接头，或传感器本身；混合动力车辆发电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P0715": [
    {
      "scope": "所有汽车制造商",
      "code": "P0715",
      "zh-cn": "输入轴/涡轮速度传感器A电路",
      "en-us": "Input/Turbine Speed Sensor A Circuit",
      "sys": "变速箱",
      "knowledge": "涡轮转速传感器（TSS），也叫输入轴转速传感器（ISS），其作用是将输入轴（也就是液力变矩器）的转速以频率的形式输送给变速器控制模块（TCU）,这些信息对于调节液力变矩器锁定离合器尤为关键。该故障码表明输入轴转速传感器信号电路电压超出校准的正常范围。故障原因包括TSS传感器，其电路，接头故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0C14": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C14",
      "zh-cn": "驱动电机B换流器，U相温度过高",
      "en-us": "Drive Motor B Inverter Phase U Over Temperature",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P077B": [
    {
      "scope": "所有汽车制造商",
      "code": "P077B",
      "zh-cn": "输出速度传感器电路 - 方向错误",
      "en-us": "Output Speed Sensor Circuit - Direction Error",
      "sys": "变速箱",
      "knowledge": "输出速度传感器（OSS）的任务是将变速器输出轴的速度信号传送给电子控制单元（ECU）。"
    }
  ],
  "P084D": [
    {
      "scope": "所有汽车制造商",
      "code": "P084D",
      "zh-cn": "变速器液压力（TFP）传感器/开关H电路高",
      "en-us": "Transmission Fluid Pressure Sensor/Switch H Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0682": [
    {
      "scope": "所有汽车制造商",
      "code": "P0682",
      "zh-cn": "电热塞电路/开路 - 气缸12",
      "en-us": "Cylinder 12 Glow Plug Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸12电热塞电路发生故障，该故障码会出现。"
    }
  ],
  "P0692": [
    {
      "scope": "所有汽车制造商",
      "code": "P0692",
      "zh-cn": "风扇1控制电路高",
      "en-us": "Fan 1 Control Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到风扇1（低速）控制变量（FCV）电路电压高于校准的最高值。故障原因包括风扇本身或其控制电路，接头等。"
    }
  ],
  "P008D": [
    {
      "scope": "所有汽车制造商",
      "code": "P008D",
      "zh-cn": "燃油冷却器泵控制电路低",
      "en-us": "Fuel Cooler Pump Control Circuit Low",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油冷却器的作用是降低燃油温度从而提高低硫柴油的粘度。该故障码表明燃油冷却器泵控制电路电压低于校准的最低值。"
    }
  ],
  "P0811": [
    {
      "scope": "所有汽车制造商",
      "code": "P0811",
      "zh-cn": "离合器A过度打滑",
      "en-us": "Excessive Clutch A Slippage",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0BC2": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BC2",
      "zh-cn": "混合动力电池温度传感器E电路",
      "en-us": "Hybrid Battery Temperature Sensor E Circuit",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压超出正常范围，该故障码会出现。"
    }
  ],
  "P0774": [
    {
      "scope": "所有汽车制造商",
      "code": "P0774",
      "zh-cn": "换档电磁阀E间歇",
      "en-us": "Shift Solenoid E Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0AA9": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AA9",
      "zh-cn": "混合动力电池电压隔离传感器电路低",
      "en-us": "Hybrid Battery Voltage Isolation Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P010C": [
    {
      "scope": "所有汽车制造商",
      "code": "P010C",
      "zh-cn": "空气流量（MAF）传感器B电路低",
      "en-us": "Mass or Volume Air Flow B Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。如果ECU检测空气流量（MAF）传感器信号电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0377": [
    {
      "scope": "所有汽车制造商",
      "code": "P0377",
      "zh-cn": "点火正时参考高解析信号B太少脉冲",
      "en-us": "Timing Reference High Resolution Signal B Too Few Pulses",
      "sys": "点火系统",
      "knowledge": "光学传感器通过数位于喷射泵内的传感器盘上的脉冲来为动力总成控制模块（PCM）提供高解析信号。这个信号是PCM控制燃油和正时的一个重要参考依据之一。该故障码的原因包括光学传感器，其电路，接头或PCM."
    }
  ],
  "P02B9": [
    {
      "scope": "所有汽车制造商",
      "code": "P02B9",
      "zh-cn": "喷油器泄漏 - 气缸8",
      "en-us": "Cylinder 8 - Injector Leaking",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第8缸喷油器发生泄漏。"
    }
  ],
  "P0893": [
    {
      "scope": "所有汽车制造商",
      "code": "P0893",
      "zh-cn": "多个档位同时挂上",
      "en-us": "Multiple Gears Engaged",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0520": [
    {
      "scope": "所有汽车制造商",
      "code": "P0520",
      "zh-cn": "机油压力传感器/开关电路",
      "en-us": "Engine Oil Pressure Sensor/Switch Circuit",
      "sys": "车速及怠速控制",
      "knowledge": "机油压力传感器的作用是将机油压力以电信号的形式输送给电子控制单元（ECU），在压力不够的情况下，ECU会在仪表盘发出报警信号。该故障码表明机油压力传感器/开关电路故障。"
    }
  ],
  "P0A29": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A29",
      "zh-cn": "混合动力电池供电关闭电路高",
      "en-us": "Hybrid Battery Power Off Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池供电关闭（BPO）电路发生故障。故障原因包括BPO电路，和控制模块。"
    }
  ],
  "P0241": [
    {
      "scope": "所有汽车制造商",
      "code": "P0241",
      "zh-cn": "涡轮/超级增压器增压传感器B电路低",
      "en-us": "Turbocharger/Supercharger Boost Sensor B Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。增压传感器，也叫增压压力传感器（BPS），其作用是将增压压力以电信号的形式传输给电子控制单元（ECU）。如果增压传感器信号电压低于0.25伏，该故障码会出现。"
    }
  ],
  "P046E": [
    {
      "scope": "所有汽车制造商",
      "code": "P046E",
      "zh-cn": "废气再循环传感器B电路范围/性能",
      "en-us": "Exhaust Gas Recirculation Sensor B Circuit Range/Performance",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。该故障码表明废气再循环传感器B信号电压出错。"
    }
  ],
  "P0A92": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A92",
      "zh-cn": "混合动力发电机性能",
      "en-us": "Hybrid Generator Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车发电机A故障"
    }
  ],
  "P053B": [
    {
      "scope": "所有汽车制造商",
      "code": "P053B",
      "zh-cn": "曲轴箱强制通风系统加热器控制电路低",
      "en-us": "Positive Crankcase Ventilation Heater Control Circuit Low",
      "sys": "车速及怠速控制",
      "knowledge": "曲轴箱强制通风（PCV）系统的作用是将曲轴箱内的窜气（发动机作功燃烧过程的末端，一些未燃混合气在高压力下从活塞环漏入曲轴箱内，业内将这种泄漏称为窜气）通过发动机工作产生的真空导入进气歧管，然后窜气会随着新鲜的空气一起进入汽缸烧掉，从而降低污染提高发动机效率。如果电子控制单元（PCV）检测到曲轴箱强制通风加热器电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0171": [
    {
      "scope": "所有汽车制造商",
      "code": "P0171",
      "zh-cn": "系统（空燃比）太稀 （第1排）",
      "en-us": "System Too Lean (Bank 1)",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果自适应燃油控制系统已经达到了补偿极限，而空燃比仍然很稀的话，该故障码就会出现。故障原因包括空气流量（MAF）传感器之后的空气泄漏，PCV系统泄漏，氧传感器故障，氧传感器附近排气泄漏，EGR泄漏，空气流量（MAF）传感器故障，燃油滤清器太脏，燃油泵供油不足，燃油压力调节器故障，喷油器阻塞，发动机转速传感器故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0C7E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C7E",
      "zh-cn": "混合动力电池温度传感器G电路低",
      "en-us": "Hybrid Battery Temperature Sensor G Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0A73": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A73",
      "zh-cn": "发电机V相电流低",
      "en-us": "Generator Phase V Current Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控发电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0C34": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C34",
      "zh-cn": "混合动力电池温度传感器F电路范围/性能",
      "en-us": "Hybrid Battery Temperature Sensor F Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路出错，该故障码会出现。"
    }
  ],
  "P0620": [
    {
      "scope": "所有汽车制造商",
      "code": "P0620",
      "zh-cn": "发电机控制电路",
      "en-us": "Generator Control Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）通过发电机开启信号电路来控制发电机。当需要发电机运转的时候，ECU会通过发电机开启信号电路来发送1个5伏的信号到电压调节器。电压调节器收到这个信号后便会开始控制发电机磁场电路。如果电子控制单元（ECU）检测到发电机开启电路电压不正确，该故障码会出现。"
    }
  ],
  "P0029": [
    {
      "scope": "所有汽车制造商",
      "code": "P0029",
      "zh-cn": "排气阀门控制电磁阀电路范围/性能 （第2排）",
      "en-us": "Exhaust Valve Control Solenoid Circuit Range/Performance (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。如果B（排气）凸轮轴的实际位置跟理想位置相差超过20度，该故障码会出现"
    }
  ],
  "P0B82": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B82",
      "zh-cn": "混合动力电池电压监控O电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense O Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P064F": [
    {
      "scope": "所有汽车制造商",
      "code": "P064F",
      "zh-cn": "检测到未经认可的软件/校准",
      "en-us": "Unauthorized Software/Calibration Detected",
      "sys": "计算机或辅助输出电路",
      "knowledge": "软件/校准不匹配。"
    }
  ],
  "P0575": [
    {
      "scope": "所有汽车制造商",
      "code": "P0575",
      "zh-cn": "定速巡航系统输入电路",
      "en-us": "Cruise Control Input Circuit",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。"
    }
  ],
  "P0578": [
    {
      "scope": "所有汽车制造商",
      "code": "P0578",
      "zh-cn": "定速巡航系统多功能输入A电路卡住",
      "en-us": "Cruise Control Multi-Function Input A Circuit Stuck",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。故障原因包括定速巡航多功能输入开关，电路，接头，机械故障等。"
    }
  ],
  "P050A": [
    {
      "scope": "所有汽车制造商",
      "code": "P050A",
      "zh-cn": "冷车启动怠速空气控制系统性能",
      "en-us": "Cold Start Idle Air Control System Performance",
      "sys": "车速及怠速控制",
      "knowledge": "冷车启动排放削减监控器会经常测试每个部件的合理性。在测试时，怠速空气控制系统会请求更高的空气流量以增加RPM。冷车启动排放削减监控器然后会拿空气流量（MAF）传感器实际测得的空气流量跟电子控制单元（ECU）请求的空气流量比较。如果实际空气流量低于校准值的话，该故障码会出现。"
    }
  ],
  "P0B9C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B9C",
      "zh-cn": "混合动力电池电压监控T电路低",
      "en-us": "Hybrid Battery Voltage Sense T Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P02C5": [
    {
      "scope": "所有汽车制造商",
      "code": "P02C5",
      "zh-cn": "喷油器泄漏 - 气缸11",
      "en-us": "Cylinder 11 - Injector Leaking",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第11缸喷油器发生泄漏。"
    }
  ],
  "P015C": [
    {
      "scope": "所有汽车制造商",
      "code": "P015C",
      "zh-cn": "氧传感器延迟响应 - （空燃比）浓到稀 （第2排，传感器 1）",
      "en-us": "O2 Sensor Delayed Response - Rich to Lean (Bank 2, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。如果电子控制单元（ECU）发现在空燃比由浓变稀的过程中，电压变化速率滞后，该故障码就会出现。"
    }
  ],
  "P0522": [
    {
      "scope": "所有汽车制造商",
      "code": "P0522",
      "zh-cn": "机油压力传感器/开关电路低",
      "en-us": "Engine Oil Pressure Sensor/Switch Low",
      "sys": "车速及怠速控制",
      "knowledge": "机油压力传感器的作用是将机油压力以电信号的形式输送给电子控制单元（ECU），在压力不够的情况下，ECU会在仪表盘发出报警信号。如果电子控制单元（ECU）检测到机油压力传感器信号电压低于0.1伏，该故障码会出现。故障原因包括机油压力传感器，其电路，接头，电子控制单元（ECU）。"
    }
  ],
  "P0C1B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C1B",
      "zh-cn": "辅助变速器液泵控制模块内部温度太高",
      "en-us": "Auxiliary Transmission Fluid Pump Control Module Internal Temperature Too High",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0148": [
    {
      "scope": "所有汽车制造商",
      "code": "P0148",
      "zh-cn": "燃油输送故障",
      "en-us": "Fuel Delivery Error",
      "sys": "燃油或空气",
      "knowledge": "电子控制单元（ECU）监测到至少有一排在节气门全开的时候空燃比太稀。燃油输送故障包括燃油滤清器阻塞，汽油泵、油压调节器、喷油器，燃油泄漏等。"
    }
  ],
  "P07A6": [
    {
      "scope": "所有汽车制造商",
      "code": "P07A6",
      "zh-cn": "变速器摩擦衬片C性能/卡在关的位置",
      "en-us": "Transmission Friction Element C Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0B96": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B96",
      "zh-cn": "混合动力电池电压监控S电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense S Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P001C": [
    {
      "scope": "所有汽车制造商",
      "code": "P001C",
      "zh-cn": "A 凸轮轴形面控制电路高 （第1排）",
      "en-us": "A  Camshaft Profile Control Circuit High (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。如果电子控制单元（ECU）检测到A（进气/左/前）凸轮轴形面控制电路电压在一段时间内高于校准的最高值，则该故障码会出现。"
    }
  ],
  "P0701": [
    {
      "scope": "所有汽车制造商",
      "code": "P0701",
      "zh-cn": "变速器控制系统范围/性能",
      "en-us": "Transmission Control System Range/Performance",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。该故障码表明变速器控制模块（TCU）检测到变速器控制系统故障。"
    }
  ],
  "P0A4D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A4D",
      "zh-cn": "发电机位置传感器电路低",
      "en-us": "Generator Position Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括发电机位置传感器电路，接头，或传感器本身；混合动力车辆发电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P0704": [
    {
      "scope": "所有汽车制造商",
      "code": "P0704",
      "zh-cn": "离合器开关输入电路",
      "en-us": "Clutch Switch Input Circuit",
      "sys": "变速箱",
      "knowledge": "离合器踏板开关的作用是将离合器是否踩下的信息以电信号的形式输送给电子控制单元，作为控制发动机启动和定速巡航系统的重要参数。当离合器踏板被踩下的时候，离合器开关电路电压会变低 （5伏 - 0伏）。如果电子控制单元（ECU）在离合器被踩下的过程中没有发现电压的变化，该故障码会出现。故障原因包括离合器踏板位置开关故障，校准错误，或电路，接头故障。"
    }
  ],
  "P0B40": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B40",
      "zh-cn": "混合动力电池电压监控B电路",
      "en-us": "Hybrid Battery Voltage Sense B Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0C5D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C5D",
      "zh-cn": "驱动电机A位置传感器电路B高",
      "en-us": "Drive Motor A Position Sensor Circuit B High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0A9D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A9D",
      "zh-cn": "混合动力电池温度传感器A电路低",
      "en-us": "Hybrid Battery Temperature Sensor A Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P004B": [
    {
      "scope": "所有汽车制造商",
      "code": "P004B",
      "zh-cn": "涡轮/超级增压器增压控制B电路范围/性能",
      "en-us": "Turbocharger/Supercharger Boost Control B Circuit Range/Performance",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。涡轮/超级增压器增压控制器的作用是当增压压力达到设定值后，气压推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮速度，控制增压水平。该故障码表明涡轮/超级增压器增压控制电路出错。"
    }
  ],
  "P032E": [
    {
      "scope": "所有汽车制造商",
      "code": "P032E",
      "zh-cn": "爆震传感器3电路间歇 （第1排）",
      "en-us": "Knock Sensor 3 Circuit Intermittent (Bank 1)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压突然变化，该故障码会出现。"
    }
  ],
  "P0B22": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B22",
      "zh-cn": "混合动力电池组电压监控D电路间歇/不稳定",
      "en-us": "Hybrid Battery Pack Voltage Sense D Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0739": [
    {
      "scope": "所有汽车制造商",
      "code": "P0739",
      "zh-cn": "变速器控制模块（TCU）发动机转速输出电路高",
      "en-us": "TCU Engine Speed Output Circuit High",
      "sys": "变速箱",
      "knowledge": "发动机转速（也称为输入轴转速）是TCU测定齿轮比和换档等的一个重要依据。"
    }
  ],
  "P0411": [
    {
      "scope": "所有汽车制造商",
      "code": "P0411",
      "zh-cn": "二次空气喷射系统检测到不正确流量",
      "en-us": "Secondary Air Injection System Incorrect Flow Detected",
      "sys": "排放控制",
      "knowledge": "在发动机刚刚启动时，二次空气喷射系统通过往排气歧管强制输入空气来氧化产生的碳氢化合物，一氧化碳等有害气体。这个过程也同时加速了催化转换器的暖化过程。如果电子控制单元（ECU）监测到二次空气喷射泵实际空气流量跟指令的空气流量不一致，该故障码会出现。故障原因包括二次空气泵或其管路阻塞，旁通执行器泄漏或阻塞，旁通执行器卡在长开或长关，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0AA8": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AA8",
      "zh-cn": "混合动力电池电压隔离传感器电路范围/性能",
      "en-us": "Hybrid Battery Voltage Isolation Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P02D2": [
    {
      "scope": "所有汽车制造商",
      "code": "P02D2",
      "zh-cn": "喷油器补偿学习在最低限气缸4",
      "en-us": "Cylinder 4 Fuel Injector Offset Learning At Min Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第4缸喷油器补偿学习已经达到了最低学习极限，该故障码会出现。"
    }
  ],
  "P005C": [
    {
      "scope": "所有汽车制造商",
      "code": "P005C",
      "zh-cn": "B凸轮轴形面控制性能/卡在关闭位置 （第2排）",
      "en-us": "B Camshaft Profile Control Performance/Stuck Off (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。该故障码表明B（排气/右/后）凸轮轴形面控制发生故障或卡在关闭位置 。"
    }
  ],
  "P02D0": [
    {
      "scope": "所有汽车制造商",
      "code": "P02D0",
      "zh-cn": "喷油器补偿学习在最低限气缸3",
      "en-us": "Cylinder 3 Fuel Injector Offset Learning At Min Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第3缸喷油器补偿学习已经达到了最低学习极限，该故障码会出现。"
    }
  ],
  "P0A4C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A4C",
      "zh-cn": "发电机位置传感器电路范围/性能",
      "en-us": "Generator Position Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括发电机位置传感器电路，接头，或传感器本身；混合动力车辆发电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P0749": [
    {
      "scope": "所有汽车制造商",
      "code": "P0749",
      "zh-cn": "压力控制电磁阀A间歇故障",
      "en-us": "Pressure Control Solenoid A Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。故障原因包括压力控制（PC）电磁阀电路，接头，或电磁阀本身。控制模块故障也可能导致该故障码出现。"
    }
  ],
  "P0943": [
    {
      "scope": "所有汽车制造商",
      "code": "P0943",
      "zh-cn": "液压装置循环周期太短",
      "en-us": "Hydraulic Pressure Unit Cycling Period Too Short",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0010": [
    {
      "scope": "所有汽车制造商",
      "code": "P0010",
      "zh-cn": "A凸轮轴位置执行器电路开路 （第1排）",
      "en-us": "A Camshaft Position Actuator Circuit/Open (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。P0010的故障原因包括A进气/左/前凸轮轴调节阀（机油控制阀），其电路，接头，机油太脏或电子控制模块等。"
    }
  ],
  "P005A": [
    {
      "scope": "所有汽车制造商",
      "code": "P005A",
      "zh-cn": "B凸轮轴形面控制性能/卡在关闭位置 （第1排）",
      "en-us": "B Camshaft Profile Control Performance/Stuck Off (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。该故障码表明B（排气/右/后）凸轮轴形面控制发生故障或卡在关闭位置 。"
    }
  ],
  "P025D": [
    {
      "scope": "所有汽车制造商",
      "code": "P025D",
      "zh-cn": "燃油泵模块控制电路高",
      "en-us": "Fuel Pump Module Control Circuit High",
      "sys": "燃油或空气",
      "knowledge": "燃油泵控制模块（FPM，or FPCM）是一个通过控制通往燃油泵（一般位于油箱内）电压的方式以实现电子控制模块（ECU）所需的最佳燃油压力的电脑微处理器。"
    }
  ],
  "P074B": [
    {
      "scope": "所有汽车制造商",
      "code": "P074B",
      "zh-cn": "不能挂3档",
      "en-us": "Unable To Engage Gear 3",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0AF7": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AF7",
      "zh-cn": "14伏电源模块内部温度过高",
      "en-us": "14 Volt Power Module Internal Temperature Too High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P061F": [
    {
      "scope": "所有汽车制造商",
      "code": "P061F",
      "zh-cn": "内部控制模块-节气门执行器控制器性能",
      "en-us": "Internal Control Module Throttle Actuator Controller Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P0B43": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B43",
      "zh-cn": "混合动力电池电压监控B电路高",
      "en-us": "Hybrid Battery Voltage Sense B Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0B9E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B9E",
      "zh-cn": "混合动力电池电压监控T电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense T Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0C44": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C44",
      "zh-cn": "混合动力电池组冷却液温度传感器电路低",
      "en-us": "Hybrid Battery Pack Coolant Temperature Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0098": [
    {
      "scope": "所有汽车制造商",
      "code": "P0098",
      "zh-cn": "进气温度（IAT）传感器2电路高 （第1排）",
      "en-us": "Intake Air Temperature Sensor 2 Circuit High (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。如果电子控制单元（ECU）检测到进气温度（IAT）传感器信号电压高于自检的最大值（4.6伏或-50摄氏度），该故障码会出现。"
    }
  ],
  "P0911": [
    {
      "scope": "所有汽车制造商",
      "code": "P0911",
      "zh-cn": "门选择执行器电路范围/性能",
      "en-us": "Gate Select Actuator Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "门选择执行器（监控换档杆左/右位置）电路故障。"
    }
  ],
  "P0AF0": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AF0",
      "zh-cn": "驱动电机换流器温度传感器A电路高",
      "en-us": "Drive Motor Inverter Temperature Sensor A Circuit High",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P02E5": [
    {
      "scope": "所有汽车制造商",
      "code": "P02E5",
      "zh-cn": "柴油机进气流量控制电磁阀卡在关闭位置",
      "en-us": "Diesel Intake Air Flow Control Stuck Closed",
      "sys": "燃油或空气",
      "knowledge": "柴油机进气流量控制系统通过对节气门开启角度的自动控制并与切向气道或螺旋气道的配合使用来形成有效的进气涡流，同时对进气涡流的强度进行自动控制，有效地改善了发动机的燃烧，从而优化了发动机动力性，经济性等性能指标。"
    }
  ],
  "P02CB": [
    {
      "scope": "所有汽车制造商",
      "code": "P02CB",
      "zh-cn": "涡轮/超级增压器B处于增压不足状态",
      "en-us": "Turbocharger/Supercharger B Underboost Condition",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。为防止涡轮/超级增压器过度增压，当压力到达设定的最高值时，气压会推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮转速，降低增压水平。如果废气门，废气门调节阀，增压旁通阀，增压压力传感器等发生故障，可能会导致系统增压不足。"
    }
  ],
  "P079D": [
    {
      "scope": "所有汽车制造商",
      "code": "P079D",
      "zh-cn": "变速器摩擦衬片D检测到打滑",
      "en-us": "Transmission Friction Element D Slip Detected",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0012": [
    {
      "scope": "所有汽车制造商",
      "code": "P0012",
      "zh-cn": "A凸轮轴位置执行器 - 正时滞后 （第1排）",
      "en-us": "A Camshaft Position - Timing Over-Retarded (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。P0012的故障原因包括A进气/左/前凸轮轴正时没有设定好，凸轮轴过前原理机械性卡住，或者是执行器阀门卡在开的位置。"
    }
  ],
  "P0C39": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C39",
      "zh-cn": "直流/直流换流器温度传感器A电路范围/性能",
      "en-us": "DC/DC Converter Temperature Sensor A Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "直流/直流转换器将HV电池的直流高压（200-400伏特）转化成12伏特电压，从而可以给辅助电池充电并给车内附件供电。"
    }
  ],
  "P020B": [
    {
      "scope": "所有汽车制造商",
      "code": "P020B",
      "zh-cn": "喷油器正时 - 第2缸",
      "en-us": "Cylinder 2 Injection Timing",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器实际正时跟理想喷油正时偏差超过最大极限，该故障码会出现。"
    }
  ],
  "P040B": [
    {
      "scope": "所有汽车制造商",
      "code": "P040B",
      "zh-cn": "废气再循环阀温度传感器A电路范围/性能",
      "en-us": "Exhaust Gas Recirculation Temperature Sensor A Circuit Range/Performance",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环阀（EGR）温度传感器的信号电压不正确，该故障码会出现。"
    }
  ],
  "P0796": [
    {
      "scope": "所有汽车制造商",
      "code": "P0796",
      "zh-cn": "压力控制电磁阀C性能问题或卡在关闭位置",
      "en-us": "Pressure Control Solenoid C Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。故障原因包括变速器液液面太低，变速器液太脏，变速器液压力控制电磁阀，电路，接头，或控制模块等。"
    }
  ],
  "P0A42": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A42",
      "zh-cn": "驱动电机A位置传感器电路高",
      "en-us": "Drive Motor A Position Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括驱动电机A位置传感器电路，接头，或传感器本身；混合动力驱动电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P0109": [
    {
      "scope": "所有汽车制造商",
      "code": "P0109",
      "zh-cn": "歧管绝对压力（传感器）/大气压力（传感器）电路间歇",
      "en-us": "Manifold Absolute Pressure/Barometric Pressure Circuit Intermittent",
      "sys": "燃油或空气",
      "knowledge": "歧管绝对压力（MAP）传感器的作用是测量进气歧管内的压力（真空度）。动力总成控制模块（PCM）然后会将进气歧管压力与大气压力之间的差值（跟发动机负荷成线性关系）作为确定喷油器基本喷油量的一个依据，以帮助发动机在不同负荷下达到最佳空燃比。大气压力传感器（有时候也叫高海拔补偿器，HAC）的作用是将大气压力以电信号的形式输送给电子控制模块。大气压力会随天气和海拔高度的变化而变化。压力越小，空气越稀薄。动力总成控制模块（PCM）会根据大气压力的数值来修正燃油供给，以帮助发动机达到最佳空燃比。如果电子控制单元（ECU）检测歧管绝对压力（MAP）传感器/气压传感器信号电压突然变化，该故障码会出现。故障原因包括MAP或大气压力（BARO）传感器信号电路开路或短路到接地（间歇性），参考电压（VREF）电路开路，传感器故障等。"
    }
  ],
  "P0B11": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B11",
      "zh-cn": "混合动力电池组电流传感器B电路高",
      "en-us": "Hybrid Battery Pack Current Sensor B Circuit High",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块通过来自电池电流传感器的信号来监控电池的充电放电情况。如果控制模块发现电池电流传感器发生故障，该故障码会出现。"
    }
  ],
  "P02C4": [
    {
      "scope": "所有汽车制造商",
      "code": "P02C4",
      "zh-cn": "喷油器受限制 - 气缸11",
      "en-us": "Cylinder 11 - Injector Restricted",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第11缸喷油器性能出错。"
    }
  ],
  "P0350": [
    {
      "scope": "所有汽车制造商",
      "code": "P0350",
      "zh-cn": "点火线圈主/次电路",
      "en-us": "Ignition Coil Primary/Secondary Circuit",
      "sys": "点火系统",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。电子控制单元（ECU）持续监测每个点火主电路。如果ECU没有收到有效的来自点火模块（集成在ECU）的点火诊断监控器（IDM）脉冲信号，该故障码会出现。故障原因包括点火启动/运行电路，点火线圈电路，点火线圈本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0155": [
    {
      "scope": "所有汽车制造商",
      "code": "P0155",
      "zh-cn": "氧传感器加热器电路（第2排，传感器 1）",
      "en-us": "O2 Sensor Heater Circuit (Bank 2, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）持续监测加热氧传感器加热器，以确保没有开路，短路，或电流消耗过度的情况。如果电流消耗超过校准的极限，或监测到开路或短路，该故障码就会出现。故障原因包括氧传感器加热器电路，接头故障，氧传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0BA6": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BA6",
      "zh-cn": "混合动力电池电压监控V电路低",
      "en-us": "Hybrid Battery Voltage Sense V Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P041A": [
    {
      "scope": "所有汽车制造商",
      "code": "P041A",
      "zh-cn": "废气再循环阀温度传感器B电路",
      "en-us": "Exhaust Gas Recirculation Temperature Sensor B Circuit",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环阀（EGR）温度传感器的信号电压超出了校准的正常范围，该故障码会出现。"
    }
  ],
  "P0B76": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B76",
      "zh-cn": "混合动力电池电压监控L电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense L Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0B3D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B3D",
      "zh-cn": "混合动力电池电压监控A电路低",
      "en-us": "Hybrid Battery Voltage Sense A Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P060C": [
    {
      "scope": "所有汽车制造商",
      "code": "P060C",
      "zh-cn": "内部控制模块主处理器性能",
      "en-us": "Internal Control Module Main Processor Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P0BCE": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BCE",
      "zh-cn": "发电机换流器温度传感器电路低",
      "en-us": "Generator Inverter Temperature Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P014B": [
    {
      "scope": "所有汽车制造商",
      "code": "P014B",
      "zh-cn": "氧传感器延迟响应 - （空燃比）稀到浓 （第2排，传感器 2）",
      "en-us": "O2 Sensor Delayed Response - Lean to Rich (Bank 2, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。如果电子控制单元（ECU）发现在空燃比由稀变浓的过程中，电压变化速率滞后，该故障码就会出现。"
    }
  ],
  "P0303": [
    {
      "scope": "所有汽车制造商",
      "code": "P0303",
      "zh-cn": "第3缸检测到失火",
      "en-us": "Cylinder 3 Misfire Detected",
      "sys": "点火系统",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。如果电子控制单元（ECU）检测到可能会对催化转换器造成破坏的失火，故障指示灯会闪烁，此时应立即关闭发动机。该故障码表明电子控制单元（ECU）检测到气缸3失火。故障原因包括点火系统故障，燃油输送故障，进气歧管或EGR，PCV的空气泄漏，机械性气缸故障等。"
    }
  ],
  "P0B21": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B21",
      "zh-cn": "混合动力电池组电压监控D电路高",
      "en-us": "Hybrid Battery Pack Voltage Sense D Circuit High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0B65": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B65",
      "zh-cn": "混合动力电池电压监控I电路低",
      "en-us": "Hybrid Battery Voltage Sense I Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P081E": [
    {
      "scope": "所有汽车制造商",
      "code": "P081E",
      "zh-cn": "离合器B过度打滑",
      "en-us": "Excessive Clutch B Slippage",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0BEF": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BEF",
      "zh-cn": "驱动电机A，W相电流传感器电路低",
      "en-us": "Drive Motor A Phase W Current Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0A67": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A67",
      "zh-cn": "驱动电机B，U相电流低",
      "en-us": "Drive Motor B Phase U Current Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0BC8": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BC8",
      "zh-cn": "混合动力电池组冷却风扇监控电路范围/性能",
      "en-us": "Hybrid Battery Pack Cooling Fan Sense Range/Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P02BC": [
    {
      "scope": "所有汽车制造商",
      "code": "P02BC",
      "zh-cn": "喷油器受限制 - 气缸9",
      "en-us": "Cylinder 9 - Injector Restricted",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第9缸喷油器性能出错。"
    }
  ],
  "P0334": [
    {
      "scope": "所有汽车制造商",
      "code": "P0334",
      "zh-cn": "爆震传感器2电路间歇（第2排）",
      "en-us": "Knock Sensor 2 Circuit Intermittent (Bank 2)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压突然变化，该故障码会出现。"
    }
  ],
  "P0B8F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B8F",
      "zh-cn": "混合动力电池电压监控Q电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense Q Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0812": [
    {
      "scope": "所有汽车制造商",
      "code": "P0812",
      "zh-cn": "倒档输入电路",
      "en-us": "Reverse Input Circuit",
      "sys": "变速箱",
      "knowledge": "故障原因包括在钥匙开发动机关（KOEO）的自检中变速器杆不在空档，倒档开关故障，倒档开关电路或接头故障，或控制模块故障。"
    }
  ],
  "P0535": [
    {
      "scope": "所有汽车制造商",
      "code": "P0535",
      "zh-cn": "空调蒸发器温度传感器电路",
      "en-us": "A/C Evaporator Temperature Sensor Circuit",
      "sys": "车速及怠速控制",
      "knowledge": "空调蒸发器温度传感器的作用是将空调蒸发器内的温度以电信号的形式输送给空调控制模块，以便当空调蒸发器内温度过低的时候，关闭空调压缩机，防止空调蒸发器发生冰冻现象。该故障码表明空调蒸发器温度（ACET）传感器信号电路电压超出校准范围。故障原因包括空调蒸发器空气温度传感器信号电路，空调蒸发器温度传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0BAE": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BAE",
      "zh-cn": "混合动力电池电压监控X电路",
      "en-us": "Hybrid Battery Voltage Sense X Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0457": [
    {
      "scope": "所有汽车制造商",
      "code": "P0457",
      "zh-cn": "蒸发排放系统检测到泄漏（油箱盖没拧紧/没盖）",
      "en-us": "Evaporative Emission System Leak Detected (fuel cap loose/off)",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。当点火钥匙打到开的时候，电子控制单元（ECU）会记录一个新的燃油液位。然后ECU会将这个液位跟上次点火钥匙关时记录的燃油液位比较。如果ECU发现燃油液位有所上升，会记下这个加油记录。如果ECU检测到蒸发排放系统有大量泄漏的同时发现有加油记录，便怀疑是不是油箱盖没有拧好。"
    }
  ],
  "P0130": [
    {
      "scope": "所有汽车制造商",
      "code": "P0130",
      "zh-cn": "氧传感器电路（第1排，传感器 1）",
      "en-us": "O2 Sensor Circuit (Bank 1, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。如果电子控制单元（ECU）检测到用于测定废气中氧含量的电路有问题时，则该故障码会出现。故障原因包括氧传感器电路，接头或本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0421": [
    {
      "scope": "所有汽车制造商",
      "code": "P0421",
      "zh-cn": "催化转换器暖化过程中效能低于阈值（第1排）",
      "en-us": "Warm Up Catalyst Efficiency Below Threshold (Bank 1)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明未达工作温度以前催化转换器效能低于设定的最低极限。故障原因包括催化转换器，氧传感器，以及电路，接头等。故障原因包括排气管或排气歧管附近尾气泄漏，催化箱失效，发动机冷却液温度（ECT）传感器故障，发动机失火或正时滞后，机油太脏，氧传感器故障，燃油系统压力太高等。"
    }
  ],
  "P0BB9": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BB9",
      "zh-cn": "混合动力电池电压监控Z电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense Z Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0026": [
    {
      "scope": "所有汽车制造商",
      "code": "P0026",
      "zh-cn": "进气阀门控制电磁阀电路范围/性能 （第1排）",
      "en-us": "Intake Valve Control Solenoid Circuit Range/Performance (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。如果A（进气）凸轮轴的实际位置跟理想位置相差超过20度，该故障码会出现。"
    }
  ],
  "P0174": [
    {
      "scope": "所有汽车制造商",
      "code": "P0174",
      "zh-cn": "系统（空燃比）太稀 （第2排）",
      "en-us": "System Too Lean (Bank 2)",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果自适应燃油控制系统已经达到了补偿极限，而空燃比仍然很稀的话，该故障码就会出现。故障原因包括空气流量（MAF）传感器之后的空气泄漏，PCV系统泄漏，氧传感器故障，氧传感器附近排气泄漏，EGR泄漏，空气流量（MAF）传感器故障，燃油滤清器太脏，燃油泵供油不足，燃油压力调节器故障，喷油器阻塞，发动机转速传感器故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P022C": [
    {
      "scope": "所有汽车制造商",
      "code": "P022C",
      "zh-cn": "增压空气冷却器旁通阀控制A电路高",
      "en-us": "Charge Air Cooler Bypass Control A Circuit High",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。增压空气冷却器旁通阀的作用是将一部分空气绕开空气冷却器。这些空气随后再跟经过空气冷却器冷却过的空气混合后进入发动机，以保证进气温度高于露水温度。如果空气冷却器旁通阀控制电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0114": [
    {
      "scope": "所有汽车制造商",
      "code": "P0114",
      "zh-cn": "进气温度（IAT）传感器1电路间歇 （第1排）",
      "en-us": "Intake Air Temperature Sensor 1 Circuit Intermittent (Bank 1)",
      "sys": "燃油或空气",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。如果电子控制单元（ECU）检测到进气温度（IAT）传感器信号电压突然变化，该故障码会出现。"
    }
  ],
  "P0998": [
    {
      "scope": "所有汽车制造商",
      "code": "P0998",
      "zh-cn": "换档电磁阀F控制电路低",
      "en-us": "Shift Solenoid F Control Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P080A": [
    {
      "scope": "所有汽车制造商",
      "code": "P080A",
      "zh-cn": "离合器位置没有学会",
      "en-us": "Clutch Position Not Learned",
      "sys": "变速箱",
      "knowledge": "离合器位置传感器的作用是将离合器是否踩下的信息以电信号的形式输送给电子控制单元，作为控制发动机启动和定速巡航系统的重要参数。"
    }
  ],
  "P02A8": [
    {
      "scope": "所有汽车制造商",
      "code": "P02A8",
      "zh-cn": "喷油器受限制 - 气缸4",
      "en-us": "Cylinder 4 - Injector Restricted",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第4缸喷油器性能出错。"
    }
  ],
  "P020C": [
    {
      "scope": "所有汽车制造商",
      "code": "P020C",
      "zh-cn": "喷油器正时 - 第3缸",
      "en-us": "Cylinder 3 Injection Timing",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器实际正时跟理想喷油正时偏差超过最大极限，该故障码会出现。"
    }
  ],
  "P0742": [
    {
      "scope": "所有汽车制造商",
      "code": "P0742",
      "zh-cn": "液力变矩器离合器电路卡在开位置",
      "en-us": "Torque Converter Clutch Circuit Stuck On",
      "sys": "变速箱",
      "knowledge": "液力变矩器的作用就像手动变速器里的离合器，允许来自发动机的扭力跟变速器暂时断开，从而实现平稳换档。但不同的是，液力变矩器可以起到像降挡一样的增加力扭力的作用。液力变矩器离合器（TCC）电磁阀电路，接头，或电磁阀本身故障。控制模块故障也可能导致该故障码出现。"
    }
  ],
  "P0BCB": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BCB",
      "zh-cn": "混合动力电池组冷却风扇监控电路间歇/不稳定",
      "en-us": "Hybrid Battery Pack Cooling Fan Sense Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P078B": [
    {
      "scope": "所有汽车制造商",
      "code": "P078B",
      "zh-cn": "换档正时电磁阀B范围性能",
      "en-us": "Shift Timing Solenoid B Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0BAA": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BAA",
      "zh-cn": "混合动力电池电压监控W电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense W Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P074A": [
    {
      "scope": "所有汽车制造商",
      "code": "P074A",
      "zh-cn": "不能挂2档",
      "en-us": "Unable To Engage Gear 2",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0660": [
    {
      "scope": "所有汽车制造商",
      "code": "P0660",
      "zh-cn": "进气歧管调谐阀控制电路/开路（第1排）",
      "en-us": "Intake Manifold Tuning Valve Control Circuit/Open (Bank 1)",
      "sys": "计算机或辅助输出电路",
      "knowledge": "如果进气歧管通路（runner）的长度最佳，气门关闭所产生的压力波会帮助将油气混合物导入发动机。问题是发动机不同转速对应的最佳进气歧管通路长度也不同。进气歧管调谐阀（IMTV）的作用就是根据发动机转速，将进气导入不同长度的进气歧管通路，以此来优化发动机在不同转速时的扭矩。如果电子控制单元（ECU）在自检时检测到进气歧管调谐阀控制电路电压超出校准正的常值，则该故障码会出现。故障原因包括IMTV信号电路开路或短路到接地，IMTV执行器总成故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0060": [
    {
      "scope": "所有汽车制造商",
      "code": "P0060",
      "zh-cn": "热氧传感器加热器电阻 （第2排，传感器2）",
      "en-us": "HO2S Heater Resistance (Bank 2, Sensor 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。如果加热氧传感器加热器控制电路的电流过低或过高，该故障码会出现。"
    }
  ],
  "P083F": [
    {
      "scope": "所有汽车制造商",
      "code": "P083F",
      "zh-cn": "离合器踏板位置开关A/B相关性",
      "en-us": "Clutch Pedal Switch A/B Correlation",
      "sys": "变速箱",
      "knowledge": "离合器踏板开关的作用是将离合器是否踩下的信息以电信号的形式输送给电子控制单元，作为控制发动机启动和定速巡航系统的重要参数。该故障码表明离合器踏板开关A/B的信号不一致。"
    }
  ],
  "P0AF2": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AF2",
      "zh-cn": "驱动电机换流器温度传感器B电路",
      "en-us": "Drive Motor Inverter Temperature Sensor B Circuit",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0802": [
    {
      "scope": "所有汽车制造商",
      "code": "P0802",
      "zh-cn": "变速器控制系统故障指示灯（MIL）请求电路/开路",
      "en-us": "Transmission Control System MIL Request Circuit/Open",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。故障指示灯（MIL）也叫检查引擎灯，其作用是当控制模块检测到故障时，点亮仪表盘上的一个黄色或红色的发动机符号。"
    }
  ],
  "P0C32": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C32",
      "zh-cn": "混合动力电池冷却系统性能",
      "en-us": "Hybrid Battery Cooling System Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0B0C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B0C",
      "zh-cn": "辅助变速器液泵液压泄漏",
      "en-us": "Auxiliary Transmission Fluid Pump Hydraulic Leakage",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0BAF": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BAF",
      "zh-cn": "混合动力电池电压监控X电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense X Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0B71": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B71",
      "zh-cn": "混合动力电池电压监控K电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense K Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0A22": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A22",
      "zh-cn": "发电机扭矩传感器电路",
      "en-us": "Generator Torque Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "控制模块检测到发电机转矩传感器信号超出校准的正常范围。"
    }
  ],
  "P0043": [
    {
      "scope": "所有汽车制造商",
      "code": "P0043",
      "zh-cn": "热氧传感器加热器控制电路低 （第1排，传感器3）",
      "en-us": "HO2S Heater Control Circuit Low (Bank 1, Sensor 3)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）通过控制氧传感器加热器的开/关来保持氧传感器780oC的温度。如果加热器的控制电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P005B": [
    {
      "scope": "所有汽车制造商",
      "code": "P005B",
      "zh-cn": "B凸轮轴形面控制卡在开的位置 （第1排）",
      "en-us": "B Camshaft Profile Control Stuck On (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。该故障码表明B（排气/右/后）凸轮轴形面控制发生故障或卡在打开位置 。"
    }
  ],
  "P0579": [
    {
      "scope": "所有汽车制造商",
      "code": "P0579",
      "zh-cn": "定速巡航系统多功能输入A电路范围/性能",
      "en-us": "Cruise Control Multi-Function Input A Circuit Range/Performance",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。电子控制单元（ECU）检测到定速巡航多功能输入开关A电路电压超出校准的正常范围。故障原因包括多功能开关，电路，接头，机械故障等。"
    }
  ],
  "P0C15": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C15",
      "zh-cn": "驱动电机B换流器，V相温度过高",
      "en-us": "Drive Motor B Inverter Phase V Over Temperature",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P001B": [
    {
      "scope": "所有汽车制造商",
      "code": "P001B",
      "zh-cn": "A 凸轮轴形面控制电路低 （第1排）",
      "en-us": "A Camshaft Profile Control Circuit Low (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。如果电子控制单元（ECU）检测到A（进气/左/前）凸轮轴形面控制电路电压在一段时间内低于了校准的最低值，则该故障码会出现。"
    }
  ],
  "P0518": [
    {
      "scope": "所有汽车制造商",
      "code": "P0518",
      "zh-cn": "怠速空气控制电路间歇",
      "en-us": "Idle Air Control Circuit Intermittent",
      "sys": "车速及怠速控制",
      "knowledge": "怠速空气控制（IAC）阀带有一个由准确移动步进电机控制的可移动针阀。在节气门关闭的情况下，IAC阀通过改变旁通管路的空气流量，对怠速进行控制，以适应不同条件下的怠速。如果电子控制单元（ECU）检测到怠速空气控制电路电压突然变化，该故障码会出现。"
    }
  ],
  "P0BA0": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BA0",
      "zh-cn": "混合动力电池电压监控U电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense U Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0640": [
    {
      "scope": "所有汽车制造商",
      "code": "P0640",
      "zh-cn": "进气加热器控制电路",
      "en-us": "Intake Air Heater Control Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "进气加热器，也叫歧管进气加热器，其作用是给预热空气进气，以帮助柴油机在寒冷天气的情况下易于启动。该故障码表明电子控制单元检测到歧管进气加热器（MIAH）控制电路电压超出校准的正常范围。"
    }
  ],
  "P04AA": [
    {
      "scope": "所有汽车制造商",
      "code": "P04AA",
      "zh-cn": "排气压力控制阀门B位置传感器/开关电路间歇/不稳定",
      "en-us": "Exhaust Pressure Control Valve B Position Sensor/Switch Circuit Intermittent/Erratic",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。如果电子控制单元（ECU）检测到排气压力控制阀门位置传感器信号电压突然变化，该故障码会出现。"
    }
  ],
  "P0568": [
    {
      "scope": "所有汽车制造商",
      "code": "P0568",
      "zh-cn": "定速巡航系统 - SET（设置） - 信号",
      "en-us": "Cruise Control Set Signal",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。在钥匙开发动机运转（KOER）自检中，电子控制单元（ECU）发现定速巡航SET（设定）键没有被按下。故障原因包括定速巡航主开关，电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P0081": [
    {
      "scope": "所有汽车制造商",
      "code": "P0081",
      "zh-cn": "进气阀门控制电磁阀电路 （第2排）",
      "en-us": "Intake Valve Control Solenoid Circuit (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。如果进气凸轮轴调节阀电路超出校准的最大范围，该故障码会出现。"
    }
  ],
  "P0637": [
    {
      "scope": "所有汽车制造商",
      "code": "P0637",
      "zh-cn": "动力转向控制电路高",
      "en-us": "Power Steering Control Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子动力转向（EPS）系统根据车速传感器（VSS）的信号，控制动力转向活塞两侧的旁通液压油流量，从而改变方向盘上的转向力。该故障码表明电子控制单元（ECU）检测到动力转向控制电路电压高于校准的最高值。故障原因包括动力转向压力开关，其电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P0A1F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A1F",
      "zh-cn": "电池能量控制模块",
      "en-us": "Battery Energy Control Module",
      "sys": "混合动力系统",
      "knowledge": "电池能量控制模块发生内部故障"
    }
  ],
  "P0182": [
    {
      "scope": "所有汽车制造商",
      "code": "P0182",
      "zh-cn": "燃油温度传感器A电路低",
      "en-us": "Fuel Temperature Sensor A Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "燃油温度传感器负责监控通往燃油泵的燃油温度，以避免因温度过高（120摄氏度）造成蒸气锁现象，而造成对燃油泵或喷油器的破坏。电子控制单元（ECU）持续监测燃油温度传感器信号电压。如果这个电压在设定时间段里低于最低校准值（0.1伏或106摄氏度），则该故障码会出现。"
    }
  ],
  "P0A61": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A61",
      "zh-cn": "驱动电机A，V相电流低",
      "en-us": "Drive Motor A Phase V Current Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P018B": [
    {
      "scope": "所有汽车制造商",
      "code": "P018B",
      "zh-cn": "燃油压力传感器B电路范围/性能",
      "en-us": "Fuel Pressure Sensor B Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。电子控制单元（ECU）持续监测燃油压力传感器信号电压。如果这个电压在设定时间段里超出了正常校准值，则该故障码会出现。"
    }
  ],
  "P07AB": [
    {
      "scope": "所有汽车制造商",
      "code": "P07AB",
      "zh-cn": "变速器摩擦衬片E卡在开的位置",
      "en-us": "Transmission Friction Element E Stuck On",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0382": [
    {
      "scope": "所有汽车制造商",
      "code": "P0382",
      "zh-cn": "电热塞/加热器电路B",
      "en-us": "Glow Plug/Heater Circuit B",
      "sys": "点火系统",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。该故障码表明电热塞加热器电路发生故障。"
    }
  ],
  "P0044": [
    {
      "scope": "所有汽车制造商",
      "code": "P0044",
      "zh-cn": "热氧传感器加热器控制电路高 （第1排，传感器3）",
      "en-us": "HO2S Heater Control Circuit High (Bank 1, Sensor 3)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）通过控制氧传感器加热器的开/关来保持氧传感器780oC的温度。如果加热器的控制电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0001": [
    {
      "scope": "所有汽车制造商",
      "code": "P0001",
      "zh-cn": "燃油量调节器控制电路/开路",
      "en-us": "Fuel Volume Regulator Control Circuit/Open",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "（在喷油嘴被广泛使用的新型汽车中，燃油量调节器已经很少被使用）"
    }
  ],
  "P0035": [
    {
      "scope": "所有汽车制造商",
      "code": "P0035",
      "zh-cn": "涡轮/超级增压器旁通阀门控制电路高",
      "en-us": "Turbocharger/Supercharger Bypass Valve Control Circuit High",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。增压器旁通阀的作用是当增压压力过大时，打开旁通阀将部分高压空气放掉，从而达到保护增压器和发动机的目的。该故障码表明涡轮/超级增压器旁通阀门控制电路电压高于校准的最高值。"
    }
  ],
  "P0857": [
    {
      "scope": "所有汽车制造商",
      "code": "P0857",
      "zh-cn": "驱动防滑/牵引力控制（TCS）输入信号范围/性能",
      "en-us": "Traction Control Input Signal Range/Performance",
      "sys": "变速箱",
      "knowledge": "驱动防滑牵引力控制（TCS）系统的作用是是当感应到驱动轮打滑现象时，通过滞后点火时间等来控制扭力输出，提前升档，二档起步，防止液力变矩器锁定，和刹车等来防止打滑。"
    }
  ],
  "P02E2": [
    {
      "scope": "所有汽车制造商",
      "code": "P02E2",
      "zh-cn": "柴油机进气流量控制电路低",
      "en-us": "Diesel Intake Air Flow Control Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "柴油机进气流量控制系统通过对节气门开启角度的自动控制并与切向气道或螺旋气道的配合使用来形成有效的进气涡流，同时对进气涡流的强度进行自动控制，有效地改善了发动机的燃烧，从而优化了发动机动力性，经济性等性能指标。"
    }
  ],
  "P085C": [
    {
      "scope": "所有汽车制造商",
      "code": "P085C",
      "zh-cn": "换档控制模块B通讯电路高",
      "en-us": "Gear Shift Control Module B Communication Circuit High",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0BE8": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BE8",
      "zh-cn": "驱动电机A，U相电流传感器电路高",
      "en-us": "Drive Motor A Phase U Current Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0015": [
    {
      "scope": "所有汽车制造商",
      "code": "P0015",
      "zh-cn": "B凸轮轴位置执行器 - 正时滞后 （第1排）",
      "en-us": "B Camshaft Position - Timing Over-Retarded (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。P0015的故障原因包括B进气/左/前凸轮轴正时没有设定好，凸轮轴过前原理机械性卡住，或者是执行器阀门卡在开的位置。"
    }
  ],
  "P0225": [
    {
      "scope": "所有汽车制造商",
      "code": "P0225",
      "zh-cn": "节气门/踏板位置传感器/开关C电路",
      "en-us": "Throttle/Pedal Position Sensor/Switch C Circuit",
      "sys": "燃油或空气",
      "knowledge": "在电子节气门控制（ETC）系统中，节气门踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。该故障码表明节气门踏板位置传感器C电路电压超出校准的正常范围。"
    }
  ],
  "P0218": [
    {
      "scope": "所有汽车制造商",
      "code": "P0218",
      "zh-cn": "变速器液处于过热状态",
      "en-us": "Transmission Fluid Over Temperature Condition",
      "sys": "燃油或空气",
      "knowledge": "变速器液温度（TFT）传感器依据热敏电阻的原理将变速器液温度以电信号的形式传送到电子控制单元（ECU）。其主要作用是当温度过高时，变速器控制模块（TCU）会降挡减速。对于有些新型汽车，TCU运用此温度信号判断变速器液粘度，从而调整管路压力和电磁阀压力。该故障码表明变速器液温度（TFT）传感器显示变速器处于温度过高状态。"
    }
  ],
  "P02D1": [
    {
      "scope": "所有汽车制造商",
      "code": "P02D1",
      "zh-cn": "喷油器补偿学习在最高限气缸3",
      "en-us": "Cylinder 3 Fuel Injector Offset Learning At Max Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第3缸喷油器补偿学习已经达到了最高学习极限，该故障码会出现。"
    }
  ],
  "P0BF4": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BF4",
      "zh-cn": "驱动电机B，U相电流传感器电路高",
      "en-us": "Drive Motor B Phase U Current Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0C0C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C0C",
      "zh-cn": "驱动电机A换流器电源供应 - 电路低",
      "en-us": "Drive Motor A Inverter Power Supply Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P0A2F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A2F",
      "zh-cn": "驱动电机A温度过高",
      "en-us": "Drive Motor A Over Temperature",
      "sys": "混合动力系统",
      "knowledge": "驱动电机A处于温度过高状态。电子控制单元有可能会限制电机负载以避免对驱动电机造成损害。"
    }
  ],
  "P0466": [
    {
      "scope": "所有汽车制造商",
      "code": "P0466",
      "zh-cn": "蒸发排放系统吹扫流量传感器电路范围/性能",
      "en-us": "EVAP Purge Flow Sensor Circuit Range/Performance",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。如果电子控制单元（ECU）检测到蒸发排放系统（EVAP）吹扫流量传感器信号电压出错，该故障码会出现。"
    }
  ],
  "P0C4B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C4B",
      "zh-cn": "混合动力电池组冷却液供电电压电路短路",
      "en-us": "Hybrid Battery Pack Coolant Pump Supply Voltage Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0AE0": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AE0",
      "zh-cn": "混合动力电池负极接触器控制电路高",
      "en-us": "Hybrid Battery Negative Contactor Control Circuit High",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果混合动力电子控制单元发现第3系统主继电器（SMR）发生故障，该故障码会出现。"
    }
  ],
  "P0781": [
    {
      "scope": "所有汽车制造商",
      "code": "P0781",
      "zh-cn": "1-2档换档",
      "en-us": "1-2 Shift",
      "sys": "变速箱",
      "knowledge": "电子控制单元（ECU）指令1-2换档，但没有检测到相应的发动机转速下降。"
    }
  ],
  "P042D": [
    {
      "scope": "所有汽车制造商",
      "code": "P042D",
      "zh-cn": "催化转换器温度传感器电路高（第1排，传感器2）",
      "en-us": "Catalyst Temperature Sensor Circuit High (Bank 1, Sensor 2)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器温度传感器电路电压高于校准的最高值。故障原因包括催化转换器温度传感器，电路，接头，或电子控制单元（ECU）故障。"
    }
  ],
  "P0532": [
    {
      "scope": "所有汽车制造商",
      "code": "P0532",
      "zh-cn": "空调制冷剂压力传感器A电路低",
      "en-us": "A/C Refrigerant Pressure Sensor A Circuit Low",
      "sys": "车速及怠速控制",
      "knowledge": "空调制冷剂压力传感器的作用是将空调制冷剂压力以电信号的形式传送给电子控制单元（ECU），作为控制冷却风扇开关和压缩机继电器的依据。如果电子控制单元检测到空调压力传感器信号电路电压低于校准的最低值，则该故障码会出现。"
    }
  ],
  "P0684": [
    {
      "scope": "所有汽车制造商",
      "code": "P0684",
      "zh-cn": "电热塞控制模块到动力总成控制模块（PCM）通讯电路范围/性能",
      "en-us": "Glow Plug Control Module to PCM Communication Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）失去跟电热塞控制模块（GPCM）的通讯，或者从GPCM收到关于CAN总线连接出错的故障信息，该故障码会出现。"
    }
  ],
  "P0B3F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B3F",
      "zh-cn": "混合动力电池电压监控A电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense A Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0C42": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C42",
      "zh-cn": "混合动力电池组冷却液温度传感器电路",
      "en-us": "Hybrid Battery Pack Coolant Temperature Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0C79": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C79",
      "zh-cn": "驱动电机A换流器电压太高",
      "en-us": "Drive Motor A Inverter Voltage Too High",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P092B": [
    {
      "scope": "所有汽车制造商",
      "code": "P092B",
      "zh-cn": "换档锁止电磁阀/执行器控制电路B/范围/性能",
      "en-us": "Gear Shift Lock Solenoid/Actuator Control Circuit B Range/Performance",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P047C": [
    {
      "scope": "所有汽车制造商",
      "code": "P047C",
      "zh-cn": "排气压力传感器B电路低",
      "en-us": "Exhaust Pressure Sensor B Circuit Low",
      "sys": "排放控制",
      "knowledge": "排气压力传感器的作用是将排气系统压力以电信号的形式输送给电子控制单元（ECU）。如果ECU检测到排气压力传感器A信号电路电压在设定的时间段内（2.5秒）低于0.15伏，该故障码会出现。"
    }
  ],
  "P0194": [
    {
      "scope": "所有汽车制造商",
      "code": "P0194",
      "zh-cn": "燃油分供管油压传感器A电路间歇/不稳定",
      "en-us": "Fuel Rail Pressure Sensor A Circuit Intermittent/Erratic",
      "sys": "燃油或空气",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。电子控制单元（ECU）监控燃油分供管压力传感器的参考电压。如果这个电压发生间歇性故障，则该故障码会出现。"
    }
  ],
  "P0090": [
    {
      "scope": "所有汽车制造商",
      "code": "P0090",
      "zh-cn": "燃油压力调节器1控制电路/开路",
      "en-us": "Fuel Pressure Regulator 1 Control Circuit/Open",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。如果电子控制单元（ECU）检测到燃油压力调节器1控制电路电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P02DF": [
    {
      "scope": "所有汽车制造商",
      "code": "P02DF",
      "zh-cn": "喷油器补偿学习在最高限气缸10",
      "en-us": "Cylinder 10 Fuel Injector Offset Learning At Max Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第10缸喷油器补偿学习已经达到了最高学习极限，该故障码会出现。"
    }
  ],
  "P0695": [
    {
      "scope": "所有汽车制造商",
      "code": "P0695",
      "zh-cn": "风扇3控制电路低",
      "en-us": "Fan 3 Control Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到风扇3（中速）控制变量（FCV）电路电压低于校准的最低值。故障原因包括风扇本身或其控制电路，接头等。"
    }
  ],
  "P02D6": [
    {
      "scope": "所有汽车制造商",
      "code": "P02D6",
      "zh-cn": "喷油器补偿学习在最低限气缸6",
      "en-us": "Cylinder 6 Fuel Injector Offset Learning At Min Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第6缸喷油器补偿学习已经达到了最低学习极限，该故障码会出现。"
    }
  ],
  "P0260": [
    {
      "scope": "所有汽车制造商",
      "code": "P0260",
      "zh-cn": "喷油泵燃油计量控制B间歇（凸轮/转子/喷油器）",
      "en-us": "Injection Pump Fuel Metering Control B Intermittent (Cam/Rotor/Injector)",
      "sys": "燃油或空气",
      "knowledge": "故障原因包括燃油控制执行器（FCA），其电路，喷油泵，或电子控制模块（ECU）等。燃油控制执行器（FCA）一般位于喷油泵的后侧，它是一个电控电磁阀门。ECU通过循环打开和关闭FCA来控制进入喷油泵的燃油量。"
    }
  ],
  "P0BBD": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BBD",
      "zh-cn": "混合动力电池组电压变化超过范围",
      "en-us": "Hybrid Battery Pack Voltage Variation Exceeded Limit",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0125": [
    {
      "scope": "所有汽车制造商",
      "code": "P0125",
      "zh-cn": "冷却液未达到闭环燃油控制的温度",
      "en-us": "Insufficient Coolant Temperature for Closed Loop Fuel Control",
      "sys": "燃油或空气",
      "knowledge": "闭环燃油控制是指电子控制单元（ECU）根据尾气中氧气含量的反馈信息，来增加或减少喷油器的打开时间，从而控制燃油输送，使发动机获得最佳空燃比。正常情况下，冷车启动时，电子控制模块会加浓空燃比，以利于启动。当汽车达到操作温度时，便会进入闭环燃油控制状态。故障原因包括节温器卡在长开的位置，发动机冷却液温度（ECT）传感器故障，冷却液比例不对等。"
    }
  ],
  "P0370": [
    {
      "scope": "所有汽车制造商",
      "code": "P0370",
      "zh-cn": "点火正时参考高解析信号A",
      "en-us": "Timing Reference High Resolution Signal A",
      "sys": "点火系统",
      "knowledge": "光学传感器通过数位于喷射泵内的传感器盘上的脉冲来为动力总成控制模块（PCM）提供高解析信号。这个信号是PCM控制燃油和正时的一个重要参考依据之一。该故障码的原因包括光学传感器，其电路，接头或PCM."
    }
  ],
  "P00A6": [
    {
      "scope": "所有汽车制造商",
      "code": "P00A6",
      "zh-cn": "进气温度（IAT）传感器2电路范围/性能 （第2排）",
      "en-us": "Intake Air Temperature Sensor 2 Circuit Range/Performance (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。电子控制单元（ECU）在发动机关闭一定时间（通常为6小时）后，会通过比较进气温度（IAT）传感器跟发动机冷却液温度（ECT）传感器的读数来判定进气温度（IAT）传感器的合理性。如果发动机在下次启动时进气温度（IAT）传感器的读数跟发动机冷却液温度（ECT）传感器读书的差别超过了设定校准的值（通常17℃），则该故障码会出现。"
    }
  ],
  "P0899": [
    {
      "scope": "所有汽车制造商",
      "code": "P0899",
      "zh-cn": "变速器控制系统MIL（故障指示灯）请求电路高",
      "en-us": "Transmission Control System MIL Request Circuit High",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。如果变速器控制模块（TCM）检测到故障，就会请求动力总成控制模块（PCM）点亮故障指示灯。故障指示灯（MIL）也叫检查引擎灯，其作用是当控制模块检测到故障时，点亮仪表盘上的一个黄色或红色的发动机符号。"
    }
  ],
  "P0ADA": [
    {
      "scope": "所有汽车制造商",
      "code": "P0ADA",
      "zh-cn": "混合动力电池正极接触器控制电路范围/性能",
      "en-us": "Hybrid Battery Positive Contactor Control Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果混合动力电子控制单元发现第2系统主继电器（SMR）发生故障，该故障码会出现。"
    }
  ],
  "P0361": [
    {
      "scope": "所有汽车制造商",
      "code": "P0361",
      "zh-cn": "点火线圈K主/次电路",
      "en-us": "Ignition Coil K Primary/Secondary Circuit",
      "sys": "点火系统",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。电子控制单元（ECU）持续监测每个点火主电路。如果ECU没有收到有效的来自点火模块（集成在ECU）的点火诊断监控器（IDM）脉冲信号，该故障码会出现。故障原因包括点火启动/运行电路，点火线圈电路，点火线圈本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0189": [
    {
      "scope": "所有汽车制造商",
      "code": "P0189",
      "zh-cn": "燃油温度传感器B电路间歇",
      "en-us": "Fuel Temperature Sensor B Circuit Intermittent",
      "sys": "燃油或空气",
      "knowledge": "燃油温度传感器负责监控通往燃油泵的燃油温度，以避免因温度过高（120摄氏度）造成蒸气锁现象，而造成对燃油泵或喷油器的破坏。如果电子控制单元（ECU）持续监测燃油温度传感器信号电压突然变化，该故障码会出现。"
    }
  ],
  "P0B53": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B53",
      "zh-cn": "混合动力电池电压监控E电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense E Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0705": [
    {
      "scope": "所有汽车制造商",
      "code": "P0705",
      "zh-cn": "变速器档位传感器A电路（PRNDL输入）",
      "en-us": "Transmission Range Sensor A Circuit (PRNDL Input)",
      "sys": "变速箱",
      "knowledge": "变速器挡位传感器负责将变速器杆的位置（PRNDL）以电信号的形式输送给电子控制单元（ECU）。如果ECU检测到1个或多个变速器挡位（TR）传感器信号无效，该故障码会出现。故障原因包括变速器挡位（TR）传感器接头，电路，或本身的问题，或电子控制模块（PCM或ECM）故障。"
    }
  ],
  "P0253": [
    {
      "scope": "所有汽车制造商",
      "code": "P0253",
      "zh-cn": "喷油泵燃油计量控制A低（凸轮/转子/喷油器）",
      "en-us": "Injection Pump Fuel Metering Control A Low (Cam/Rotor/Injector)",
      "sys": "燃油或空气",
      "knowledge": "故障原因包括燃油控制执行器（FCA），其电路，喷油泵，或电子控制模块（ECU）等。燃油控制执行器（FCA）一般位于喷油泵的后侧，它是一个电控电磁阀门。ECU通过循环打开和关闭FCA来控制进入喷油泵的燃油量。"
    }
  ],
  "P049F": [
    {
      "scope": "所有汽车制造商",
      "code": "P049F",
      "zh-cn": "排气压力控制阀门B",
      "en-us": "Exhaust Pressure Control Valve B",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。电子控制单元（ECU）检测到排气压力控制阀A电路电压超出校准的正常值。故障原因包括排气翻板阀或其电路。"
    }
  ],
  "P02F5": [
    {
      "scope": "所有汽车制造商",
      "code": "P02F5",
      "zh-cn": "喷油器电路范围/性能 - 气缸8",
      "en-us": "Cylinder 8 Injector Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第8缸喷油器电路出错，该故障码会出现。"
    }
  ],
  "P0737": [
    {
      "scope": "所有汽车制造商",
      "code": "P0737",
      "zh-cn": "变速器控制模块（TCU）发动机转速输出电路",
      "en-us": "TCU Engine Speed Output Circuit",
      "sys": "变速箱",
      "knowledge": "发动机转速（也称为输入轴转速）是TCU测定齿轮比和换档等的一个重要依据。"
    }
  ],
  "P0B57": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B57",
      "zh-cn": "混合动力电池电压监控F电路高",
      "en-us": "Hybrid Battery Voltage Sense F Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P045F": [
    {
      "scope": "所有汽车制造商",
      "code": "P045F",
      "zh-cn": "废气再循环B控制卡在关的位置",
      "en-us": "Exhaust Gas Recirculation B Control Stuck Closed",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果在设定的时间段内（4秒）当指令实际废气再循环（EGR）阀位置高于30%时，实际EGR阀位置低于15%，电子控制单元就会认为EGR卡在了关的位置。"
    }
  ],
  "P0290": [
    {
      "scope": "所有汽车制造商",
      "code": "P0290",
      "zh-cn": "第10缸贡献/平衡错误",
      "en-us": "Cylinder 10 Contribution/Balance",
      "sys": "燃油或空气",
      "knowledge": "电子控制单元（ECU）检测到第10缸的曲轴加速贡献低于校准值。故障原因包括第10缸喷油系统；或其它影响第10缸的发动机问题。"
    }
  ],
  "P0413": [
    {
      "scope": "所有汽车制造商",
      "code": "P0413",
      "zh-cn": "二次空气喷射系统切换阀A电路开路",
      "en-us": "Secondary Air Injection System Switching Valve A Circuit Open",
      "sys": "排放控制",
      "knowledge": "在发动机刚刚启动时，二次空气喷射系统通过往排气歧管强制输入空气来氧化产生的碳氢化合物，一氧化碳等有害气体。这个过程也同时加速了催化转换器的暖化过程。如果电子控制单元（ECU）检测到二次空气喷射系统控制电磁阀电路有开路的情况，该故障码会出现。故障原因包括二次空气喷射执行器电路开路或短路到接地，执行器故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0310": [
    {
      "scope": "所有汽车制造商",
      "code": "P0310",
      "zh-cn": "第10缸检测到失火",
      "en-us": "Cylinder 10 Misfire Detected",
      "sys": "点火系统",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。如果电子控制单元（ECU）检测到可能会对催化转换器造成破坏的失火，故障指示灯会闪烁，此时应立即关闭发动机。该故障码表明电子控制单元（ECU）检测到该气缸10失火。故障原因包括点火系统故障，燃油输送故障，进气歧管或EGR，PCV的空气泄漏，机械性气缸故障等。"
    }
  ],
  "P050D": [
    {
      "scope": "所有汽车制造商",
      "code": "P050D",
      "zh-cn": "冷车启动怠速不稳",
      "en-us": "Cold Start Rough Idle",
      "sys": "车速及怠速控制",
      "knowledge": ""
    }
  ],
  "P0677": [
    {
      "scope": "所有汽车制造商",
      "code": "P0677",
      "zh-cn": "气缸7电热塞电路/开路",
      "en-us": "Cylinder 7 Glow Plug Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸7电热塞电路发生故障，该故障码会出现。"
    }
  ],
  "P00BC": [
    {
      "scope": "所有汽车制造商",
      "code": "P00BC",
      "zh-cn": "空气流量（MAF）传感器A 电路范围/性能 - 空气流量太低",
      "en-us": "Mass or Volume Air Flow A Circuit Range/Performance - Air Flow Too Low",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。该故障码表明由于空气流量（MAF）传感器A电路故障而导致空气流量过低。"
    }
  ],
  "P066A": [
    {
      "scope": "所有汽车制造商",
      "code": "P066A",
      "zh-cn": "气缸1电热塞控制电路低",
      "en-us": "Cylinder 1 Glow Plug Control Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸1电热塞电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0C76": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C76",
      "zh-cn": "混合动力电池系统放电时间太长",
      "en-us": "Hybrid Battery System Discharge Time Too Long",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0C5B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C5B",
      "zh-cn": "驱动电机A位置传感器电路B范围/性能",
      "en-us": "Drive Motor A Position Sensor Circuit B Range/Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0B02": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B02",
      "zh-cn": "辅助变速器液泵电机U相电流高",
      "en-us": "Auxiliary Transmission Fluid Pump Motor Phase U Current High",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0A47": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A47",
      "zh-cn": "驱动电机B位置传感器电路低",
      "en-us": "Drive Motor B Position Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括驱动电机B位置传感器电路，接头，或传感器本身；混合动力驱动电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P0C6E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C6E",
      "zh-cn": "混合动力电池温度传感器A/B相关性",
      "en-us": "Hybrid Battery Temperature Sensor A/B Correlation",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器A/B的信号差超出了校准的最大极限，该故障码会出现。"
    }
  ],
  "P0BE2": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BE2",
      "zh-cn": "驱动电机换流器温度传感器F电路低",
      "en-us": "Drive Motor Inverter Temperature Sensor F Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P074F": [
    {
      "scope": "所有汽车制造商",
      "code": "P074F",
      "zh-cn": "不能挂7档",
      "en-us": "Unable To Engage Gear 7",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0BA9": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BA9",
      "zh-cn": "混合动力电池电压监控W电路",
      "en-us": "Hybrid Battery Voltage Sense W Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0519": [
    {
      "scope": "所有汽车制造商",
      "code": "P0519",
      "zh-cn": "怠速空气控制系统性能",
      "en-us": "Idle Air Control System Performance",
      "sys": "车速及怠速控制",
      "knowledge": "怠速空气控制（IAC）阀带有一个由准确移动步进电机控制的可移动针阀。在节气门关闭的情况下，IAC阀通过改变旁通管路的空气流量，对怠速进行控制，以适应不同条件下的怠速。该故障码表明怠速空气控制系统故障。"
    }
  ],
  "P083B": [
    {
      "scope": "所有汽车制造商",
      "code": "P083B",
      "zh-cn": "变速器液压力（TFP）传感器/开关G电路范围/性能",
      "en-us": "Transmission Fluid Pressure Sensor/Switch G Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0BD2": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BD2",
      "zh-cn": "驱动电机换流器温度传感器C电路范围/性能",
      "en-us": "Drive Motor Inverter Temperature Sensor C Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P06C9": [
    {
      "scope": "所有汽车制造商",
      "code": "P06C9",
      "zh-cn": "气缸5电热塞不正确",
      "en-us": "Cylinder 5 Glow Plug Incorrect",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。该故障码表明气缸5电热塞，其电路，接头，或电热赛控制模块（GPCM）出错。"
    }
  ],
  "P0045": [
    {
      "scope": "所有汽车制造商",
      "code": "P0045",
      "zh-cn": "涡轮/超级增压器增压控制A电路/开路",
      "en-us": "Turbocharger/Supercharger Boost Control A Circuit/Open",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。涡轮/超级增压器增压控制器的作用是当增压压力达到设定值后，气压推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮速度，控制增压水平。该故障码表明涡轮/超级增压器增压控制A电路电压超出校准的正常范围。"
    }
  ],
  "P0734": [
    {
      "scope": "所有汽车制造商",
      "code": "P0734",
      "zh-cn": "4档齿轮比不正确",
      "en-us": "Gear 4 Incorrect Ratio",
      "sys": "变速箱",
      "knowledge": "车辆在4档指令打开的情况下运行，电子控制单元（ECU）检测到4档齿轮比不正确。故障原因包括变速器液液位太低，换档电磁阀，变速器液压传感器，阀体内的电磁阀故障，输入轴速度传感器，输出轴速度传感器，电路，接头，变速器控制模块故障等。"
    }
  ],
  "P043E": [
    {
      "scope": "所有汽车制造商",
      "code": "P043E",
      "zh-cn": "蒸发排放系统泄漏检测参考口低流速",
      "en-us": "Evaporative Emission System Leak Detection Reference Orifice Low Flow",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。泄漏诊断模块的作用是利用泄漏检测泵（LDP）给蒸发排放（EVAP）系统和燃油系统施加一个很小的压力，然后检测系统是否有泄漏，以保证没有有害蒸汽逃逸到大气中去。该故障码表明EVAP泄漏检测系统发生故障。"
    }
  ],
  "P0A02": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A02",
      "zh-cn": "电机电子系统冷却液温度传感器电路低",
      "en-us": "Motor Electronics Coolant Temperature Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "电机电子系统冷却系统（MECS）是一套独立的为变速箱（例如eCVT）电机，控制模块以及直流/直流转换器提供冷却的系统。它拥有自己的散热器，冷却液泵，冷却液温度传感器等。电机电子系统冷却液温度（MECT）传感器运用热敏电阻的原理将电机电子系统冷却液的温度以电子形式输送给电子控制单元（ECU）。如果控制模块检测到测得的电机电子系统冷却液温度（MECT）传感器电压低于0.1伏，该故障码会出现。"
    }
  ],
  "P0826": [
    {
      "scope": "所有汽车制造商",
      "code": "P0826",
      "zh-cn": "升档和降挡开关电路",
      "en-us": "Up and Down Shift Switch Circuit",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0196": [
    {
      "scope": "所有汽车制造商",
      "code": "P0196",
      "zh-cn": "机油温度传感器电路范围/性能",
      "en-us": "Engine Oil Temperature Sensor Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "机油温度（EOT）传感器依据热敏电阻的原理将机油温度以电信号的形式传送到电子控制单元（ECU）。如果电子控制单元（ECU）检测到机油温度传感器的读数超出了ECU根据其它输入而预计的机油温度范围，该故障码会出现。故障原因包括机油温度传感器，其电路，或接头。"
    }
  ],
  "P02A0": [
    {
      "scope": "所有汽车制造商",
      "code": "P02A0",
      "zh-cn": "喷油器受限制 - 气缸2",
      "en-us": "Cylinder 2 - Injector Restricted",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第2缸喷油器性能出错。"
    }
  ],
  "P008A": [
    {
      "scope": "所有汽车制造商",
      "code": "P008A",
      "zh-cn": "低压燃油系统压力 - 太低",
      "en-us": "Low Pressure Fuel System Pressure - Too Low",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "低压燃油泵（40-95psi）的作用是将汽油从油箱送往高压燃油泵。凸轮轴驱动的高压燃油泵可以将汽油加压到最高1900psi。燃油系统需要保持恒定的压力，油压过低则喷油器喷油太弱或不喷油，油压太高则使油路损毁或喷油器损坏。该故障码表明电子控制单元（ECU）检测到低压燃油系统压力在设定的时间段内低于校准的最低值。压力过低可能是燃油泵，燃油压力调节器，燃油压力传感器，燃油泵控制模块，燃油泄漏等问题。"
    }
  ],
  "P032D": [
    {
      "scope": "所有汽车制造商",
      "code": "P032D",
      "zh-cn": "爆震传感器3电路高 （第1排）",
      "en-us": "Knock Sensor 3 Circuit High (Bank 1)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0B04": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B04",
      "zh-cn": "辅助变速器液泵电机V相电流低",
      "en-us": "Auxiliary Transmission Fluid Pump Motor Phase V Current Low",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0639": [
    {
      "scope": "所有汽车制造商",
      "code": "P0639",
      "zh-cn": "节气门执行器控制范围/性能（第2排）",
      "en-us": "Throttle Actuator Control Range/Performance (Bank 2)",
      "sys": "计算机或辅助输出电路",
      "knowledge": "在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。节气门执行器是一个步进电机，它负责按照节气门控制模块的指令来控制节气门的开度。"
    }
  ],
  "P0B33": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B33",
      "zh-cn": "高压服务断开电路",
      "en-us": "High Voltage Service Disconnect Circuit",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0BD6": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BD6",
      "zh-cn": "驱动电机换流器温度传感器D电路",
      "en-us": "Drive Motor Inverter Temperature Sensor D Circuit",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0607": [
    {
      "scope": "所有汽车制造商",
      "code": "P0607",
      "zh-cn": "控制模块性能",
      "en-us": "Control Module Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P0724": [
    {
      "scope": "所有汽车制造商",
      "code": "P0724",
      "zh-cn": "刹车开关B电路高",
      "en-us": "Brake Switch B Circuit High",
      "sys": "变速箱",
      "knowledge": "刹车开关的作用是将刹车踏板踩下与否的信息以电信号的形式传送给电子控制单元（ECU），作为停止定速巡航和分离液力变矩器的重要依据。"
    }
  ],
  "P06CE": [
    {
      "scope": "所有汽车制造商",
      "code": "P06CE",
      "zh-cn": "气缸10电热塞不正确",
      "en-us": "Cylinder 10 Glow Plug Incorrect",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。该故障码表明气缸10电热塞，其电路，接头，或电热赛控制模块（GPCM）出错。"
    }
  ],
  "P075D": [
    {
      "scope": "所有汽车制造商",
      "code": "P075D",
      "zh-cn": "换档电磁阀G电子问题",
      "en-us": "Shift Solenoid G Electrical",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0448": [
    {
      "scope": "所有汽车制造商",
      "code": "P0448",
      "zh-cn": "蒸发排放系统通风控制电路短路",
      "en-us": "Evaporative Emission System Vent Control Circuit Shorted",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。如果电子控制单元（ECU）检测到蒸发排放系统通风控制电路有短路的情况，则该故障码会出现。"
    }
  ],
  "P0296": [
    {
      "scope": "所有汽车制造商",
      "code": "P0296",
      "zh-cn": "第12缸贡献/平衡错误",
      "en-us": "Cylinder 12 Contribution/Balance",
      "sys": "燃油或空气",
      "knowledge": "电子控制单元（ECU）检测到第12缸的曲轴加速贡献低于校准值。故障原因包括第12缸喷油系统；或其它影响第12缸的发动机问题。"
    }
  ],
  "P042A": [
    {
      "scope": "所有汽车制造商",
      "code": "P042A",
      "zh-cn": "催化转换器温度传感器电路 （第1排，传感器2）",
      "en-us": "Catalyst Temperature Sensor Circuit (Bank 1, Sensor 2)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器温度传感器电路发生故障。故障原因包括催化转换器温度传感器，其电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P092C": [
    {
      "scope": "所有汽车制造商",
      "code": "P092C",
      "zh-cn": "换档锁止电磁阀/执行器控制电路B低",
      "en-us": "Gear Shift Lock Solenoid/Actuator Control Circuit B Low",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0353": [
    {
      "scope": "所有汽车制造商",
      "code": "P0353",
      "zh-cn": "点火线圈C主/次电路",
      "en-us": "Ignition Coil C Primary/Secondary Circuit",
      "sys": "点火系统",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。电子控制单元（ECU）持续监测每个点火主电路。如果ECU没有收到有效的来自点火模块（集成在ECU）的点火诊断监控器（IDM）脉冲信号，该故障码会出现。故障原因包括点火启动/运行电路，点火线圈电路，点火线圈本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0C63": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C63",
      "zh-cn": "驱动电机B位置传感器电路B间歇/不稳定",
      "en-us": "Drive Motor B Position Sensor Circuit B Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0B1C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B1C",
      "zh-cn": "混合动力电池组电压监控C电路高",
      "en-us": "Hybrid Battery Pack Voltage Sense C Circuit High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0BDE": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BDE",
      "zh-cn": "驱动电机换流器温度传感器E电路高",
      "en-us": "Drive Motor Inverter Temperature Sensor E Circuit High",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0C24": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C24",
      "zh-cn": "辅助变速器液泵控制模块电路低",
      "en-us": "Auxiliary Transmission Fluid Pump Control Module Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0023": [
    {
      "scope": "所有汽车制造商",
      "code": "P0023",
      "zh-cn": "B 凸轮轴位置执行器 - 电路/开路 （第2排）",
      "en-us": "B Camshaft Position - Actuator Circuit/Open (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。P0023的故障原因包括排气/右/后凸轮轴调节阀（机油控制阀），其电路，接头，机油太脏，或ECU。"
    }
  ],
  "P0585": [
    {
      "scope": "所有汽车制造商",
      "code": "P0585",
      "zh-cn": "定速巡航系统多功能输入A/B相关性",
      "en-us": "Cruise Control Multi-Function Input A/B Correlation",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统多功能输入A/B的信号差超过允许的最大极限。"
    }
  ],
  "P0AAE": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AAE",
      "zh-cn": "混合动力电池组空气温度传感器A电路低",
      "en-us": "Hybrid Battery Pack Air Temperature Sensor A Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车的进气温度（IAT）传感器位于电池总成之内。该故障码的故障原因包括混合动力电池（进气温度（IAT）传感器），电池组控制模块等。"
    }
  ],
  "P079B": [
    {
      "scope": "所有汽车制造商",
      "code": "P079B",
      "zh-cn": "变速器摩擦衬片B检测到打滑",
      "en-us": "Transmission Friction Element B Slip Detected",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0693": [
    {
      "scope": "所有汽车制造商",
      "code": "P0693",
      "zh-cn": "风扇2控制电路低",
      "en-us": "Fan 2 Control Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到风扇2（高速）控制变量（FCV）电路电压低于校准的最低值。故障原因包括风扇本身或其控制电路，接头等。"
    }
  ],
  "P0C2E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C2E",
      "zh-cn": "辅助变速器液泵控制模块回馈信号高",
      "en-us": "Auxiliary Transmission Fluid Pump Control Module Feedback Signal High",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0862": [
    {
      "scope": "所有汽车制造商",
      "code": "P0862",
      "zh-cn": "换档控制模块通信电路高",
      "en-us": "Gear Shift Control Module A Communication Circuit High",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0741": [
    {
      "scope": "所有汽车制造商",
      "code": "P0741",
      "zh-cn": "液力变矩器离合器电路性能/卡在关的位置",
      "en-us": "Torque Converter Clutch Circuit Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": "液力变矩器的作用就像手动变速器里的离合器，允许来自发动机的扭力跟变速器暂时断开，从而实现平稳换档。但不同的是，液力变矩器可以起到像降挡一样的增加力扭力的作用。故障原因包括液力变矩器离合器（TCC）电磁阀电路或接头故障，TCC电磁阀机械故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0783": [
    {
      "scope": "所有汽车制造商",
      "code": "P0783",
      "zh-cn": "3-4档换档",
      "en-us": "3-4 Shift",
      "sys": "变速箱",
      "knowledge": "电子控制单元（ECU）指令3-4换档，但没有检测到相应的发动机转速下降。故障原因包括换档电磁阀1故障，换档电磁阀2故障，变速器摩擦材料故障，或其他变速器内部故障。"
    }
  ],
  "P0C64": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C64",
      "zh-cn": "发电机位置传感器电路A",
      "en-us": "Generator Position Sensor Circuit A",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P070A": [
    {
      "scope": "所有汽车制造商",
      "code": "P070A",
      "zh-cn": "变速器液位传感器电路",
      "en-us": "Transmission Fluid Level Sensor Circuit",
      "sys": "变速箱",
      "knowledge": "变速器液位传感器的作用是将变速器液液面以电信号的形式输送给电子控制单元（ECU）。该故障码表明变速器液位传感器信号电路故障。故障原因包括变速器液位传感器，电路，接头，或ECU。"
    }
  ],
  "P0197": [
    {
      "scope": "所有汽车制造商",
      "code": "P0197",
      "zh-cn": "机油温度传感器电路低",
      "en-us": "Engine Oil Temperature Sensor Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "机油温度（EOT）传感器依据热敏电阻的原理将机油温度以电信号的形式传送到电子控制单元（ECU）。如果电子控制单元（ECU）检测到机油温度传感器的信号电压在设定的时间段内持续低于校准的最低极限（高温度），该故障码会出现。故障原因包括机油温度传感器，其电路，或接头。"
    }
  ],
  "P0686": [
    {
      "scope": "所有汽车制造商",
      "code": "P0686",
      "zh-cn": "发动机控制模块（ECM）/动力总成控制模块（PCM）电源继电器控制电路低",
      "en-us": "ECM/PCM Power Relay Control Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。发动机控制模块继电器的作用是在点火开关关闭以后，继续保持发动机控制模块的供电，直到发动机控制模块完成关闭过程。如果电子控制单元（ECU）检测到ECU电源继电器控制电路电压低于校准的最低值，该故障码会出现。故障原因包括ECU继电器控制电路，ECU继电器，ECU等。"
    }
  ],
  "P0903": [
    {
      "scope": "所有汽车制造商",
      "code": "P0903",
      "zh-cn": "离合器执行器电路高",
      "en-us": "Clutch Actuator Circuit High",
      "sys": "变速箱",
      "knowledge": "离合器执行器是离合器动作的执行者，其基本功能是分离和结合离合器。机电式离合器执行器以电动机作为动力源，通过控制转速和位置，实现对离合器执行结合过程的精确调节。"
    }
  ],
  "P0B64": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B64",
      "zh-cn": "混合动力电池电压监控I电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense I Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P06BA": [
    {
      "scope": "所有汽车制造商",
      "code": "P06BA",
      "zh-cn": "气缸2电热塞电路范围/性能",
      "en-us": "Cylinder 2 Glow Plug Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸2电热塞电路发生故障，则该故障码会出现。"
    }
  ],
  "P0567": [
    {
      "scope": "所有汽车制造商",
      "code": "P0567",
      "zh-cn": "定速巡航系统 - RESUME（恢复） -信号",
      "en-us": "Cruise Control Resume Signal",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。在钥匙开发动机运转（KOER）自检中，电子控制单元（ECU）发现定速巡航RESUME（恢复）键没有被按下。故障原因包括定速巡航选择器开关，电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P0356": [
    {
      "scope": "所有汽车制造商",
      "code": "P0356",
      "zh-cn": "点火线圈F主/次电路",
      "en-us": "Ignition Coil F Primary/Secondary Circuit",
      "sys": "点火系统",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。电子控制单元（ECU）持续监测每个点火主电路。如果ECU没有收到有效的来自点火模块（集成在ECU）的点火诊断监控器（IDM）脉冲信号，该故障码会出现。故障原因包括点火启动/运行电路，点火线圈电路，点火线圈本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0864": [
    {
      "scope": "所有汽车制造商",
      "code": "P0864",
      "zh-cn": "变速器控制模块（TCU）通信电路范围/性能",
      "en-us": "TCU Communication Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。"
    }
  ],
  "P0584": [
    {
      "scope": "所有汽车制造商",
      "code": "P0584",
      "zh-cn": "定速巡航系统真空控制电路高",
      "en-us": "Cruise Control Vacuum Control Circuit High",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统通过控制伺服器内的真空来控制节气门角度，从而控制车速。当需要加速时，真空电磁阀开启，与进气歧管（或专门的真空泵）相通，密封套内真空度增大，吸动膜片，克服弹簧力，通过拉线使节气门开度增大，车辆加速行驶。当达到设定车速时，真空电磁阀与通风电磁阀同时关闭，此时密封套内的真空度不变，汽车保持恒速行驶。当需要减速时，通风电磁阀打开，让空气进入密封套，膜片弹簧把膜片压回原位，节气门开度减小，于是汽车减速。P0584表明真空控制电路电压高于校准的最高值。故障原因包括定速巡航真空控制电磁阀，电路，接头等。"
    }
  ],
  "P06D1": [
    {
      "scope": "所有汽车制造商",
      "code": "P06D1",
      "zh-cn": "内部控制模块点火线圈控制性能",
      "en-us": "Internal Control Module Ignition Coil Control Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "内部控制模块故障。"
    }
  ],
  "P0492": [
    {
      "scope": "所有汽车制造商",
      "code": "P0492",
      "zh-cn": "二次空气喷射系统流量不足（第2排）",
      "en-us": "Secondary Air Injection System Insufficient Flow (Bank 2)",
      "sys": "排放控制",
      "knowledge": "在发动机刚刚启动时，二次空气喷射系统通过往排气歧管强制输入空气来氧化产生的碳氢化合物，一氧化碳等有害气体。这个过程也同时加速了催化转换器的暖化过程。电子控制单元（ECU）如果监测到二次空气喷射系统流量不足，该故障码会出现。故障原因包括空气泵输出阻塞，AIR旁通电磁阀泄漏或阻塞，AIR旁通电磁阀卡住，阀故障，电子空气喷射泵管路泄漏，电子空气喷射泵故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0B25": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B25",
      "zh-cn": "混合动力电池A电压低",
      "en-us": "Hybrid Battery A Voltage Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0A4F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A4F",
      "zh-cn": "发电机位置传感器电路间歇",
      "en-us": "Generator Position Sensor Circuit Intermittent",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括发电机位置传感器电路，接头，或传感器本身；混合动力车辆发电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P0A8E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A8E",
      "zh-cn": "14伏电源模块系统电压高",
      "en-us": "14 Volt Power Module System Voltage High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0A79": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A79",
      "zh-cn": "驱动电机B换流器性能",
      "en-us": "Drive Motor B Inverter Performance",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电压传感器电路。如果HV ECU检测到换流器电压传感器错误，该故障码会出现。"
    }
  ],
  "P0388": [
    {
      "scope": "所有汽车制造商",
      "code": "P0388",
      "zh-cn": "曲轴位置（CKP）传感器B电路高 （第1排）",
      "en-us": "Crankshaft Position Sensor B Circuit High",
      "sys": "点火系统",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。曲轴位置（CKP）传感器(也叫上止点传感器），其作用是检测上止点（TDC）信号、曲轴转角信号和发动机转速信号，并将其输入计算机，从而使计算机能按气缸的点火顺序发出最佳点火时刻指令。如果电子控制单元（ECU）检测到曲轴传感器B电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0B15": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B15",
      "zh-cn": "混合动力电池组电压监控B电路范围/性能",
      "en-us": "Hybrid Battery Pack Voltage Sense B Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0BE9": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BE9",
      "zh-cn": "驱动电机A，V相电流传感器电路",
      "en-us": "Drive Motor A Phase V Current Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P046A": [
    {
      "scope": "所有汽车制造商",
      "code": "P046A",
      "zh-cn": "催化转换器温度传感器1/2相关性 （第1排）",
      "en-us": "Catalyst Temperature Sensor 1/2 Correlation (Bank 1)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器温度传感器1/2的信号差超过了设定的最大极限。"
    }
  ],
  "P0C6A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C6A",
      "zh-cn": "发电机位置传感器电路B范围/性能",
      "en-us": "Generator Position Sensor Circuit B Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括发电机位置传感器电路，接头，或传感器本身；混合动力车辆发电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P06B3": [
    {
      "scope": "所有汽车制造商",
      "code": "P06B3",
      "zh-cn": "传感器供电电源B电路/开路",
      "en-us": "Sensor Power Supply B Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": ""
    }
  ],
  "P0276": [
    {
      "scope": "所有汽车制造商",
      "code": "P0276",
      "zh-cn": "第6缸喷油器电路低",
      "en-us": "Cylinder 6 Injector Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第6缸喷油器控制电路电压低于校准的最低值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0110": [
    {
      "scope": "所有汽车制造商",
      "code": "P0110",
      "zh-cn": "进气温度（IAT）传感器1电路 （第1排）",
      "en-us": "Intake Air Temperature Sensor 1 Circuit (Bank 1)",
      "sys": "燃油或空气",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。该故障码表明进气温度（IAT）传感器信号电压超出校准的正常值。"
    }
  ],
  "P0678": [
    {
      "scope": "所有汽车制造商",
      "code": "P0678",
      "zh-cn": "气缸8电热塞电路/开路",
      "en-us": "Cylinder 8 Glow Plug Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸8电热塞电路发生故障，该故障码会出现。"
    }
  ],
  "P0AEE": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AEE",
      "zh-cn": "驱动电机换流器温度传感器A电路范围/性能",
      "en-us": "Drive Motor Inverter Temperature Sensor A Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0145": [
    {
      "scope": "所有汽车制造商",
      "code": "P0145",
      "zh-cn": "氧传感器电路慢响应（第1排，传感器 3）",
      "en-us": "O2 Sensor Circuit Slow Response (Bank 1, Sensor 3)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。当电压变化速率低于校准值时，电子控制单元（ECU）就会开始修改空燃比试图提高氧传感器的电压变化速率。如果ECU已经达到了可以接受的燃油修剪限制或者已超过了可接受的燃油修剪的时间长度，而仍然没有监测到可以接受的电压变化速率的话，该故障码就会出现。故障原因包括氧传感器由于燃油中含硅而被污染，氧传感器信号电路开路，氧传感器本身故障，排气管或排气歧管泄漏，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0352": [
    {
      "scope": "所有汽车制造商",
      "code": "P0352",
      "zh-cn": "点火线圈B主/次电路",
      "en-us": "Ignition Coil B Primary/Secondary Circuit",
      "sys": "点火系统",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。电子控制单元（ECU）持续监测每个点火主电路。如果ECU没有收到有效的来自点火模块（集成在ECU）的点火诊断监控器（IDM）脉冲信号，该故障码会出现。故障原因包括点火启动/运行电路，点火线圈电路，点火线圈本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0B4A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B4A",
      "zh-cn": "混合动力电池电压监控D电路",
      "en-us": "Hybrid Battery Voltage Sense D Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P010D": [
    {
      "scope": "所有汽车制造商",
      "code": "P010D",
      "zh-cn": "空气流量（MAF）传感器B电路高",
      "en-us": "Mass or Volume Air Flow B Circuit High",
      "sys": "燃油或空气",
      "knowledge": "空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。如果ECU检测空气流量（MAF）传感器信号电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0231": [
    {
      "scope": "所有汽车制造商",
      "code": "P0231",
      "zh-cn": "燃油泵二级电路低",
      "en-us": "Fuel Pump Secondary Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "燃油泵电路分为主电路和二级电路。主电路负责控制燃油泵，燃油泵继电器利用来自电子控制单元（ECU）的低电流控制电磁线圈，从而接通燃油泵高电流。二级电路指的是燃油泵监控器（FPM）电路，负责监控燃油泵的电路反馈。P0231的故障原因包括燃油泵监控器（FPM）到燃油泵继电器的电路，燃油泵继电器电路，燃油泵继电器，电子控制单元（ECU）等。"
    }
  ],
  "P0C84": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C84",
      "zh-cn": "混合动力电池温度传感器H电路高",
      "en-us": "Hybrid Battery Temperature Sensor H Circuit High",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P099B": [
    {
      "scope": "所有汽车制造商",
      "code": "P099B",
      "zh-cn": "换档电磁阀G控制电路低",
      "en-us": "Shift Solenoid G Control Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0987": [
    {
      "scope": "所有汽车制造商",
      "code": "P0987",
      "zh-cn": "变速器液压传感器/开关E电路",
      "en-us": "Transmission Fluid Pressure Sensor/Switch E Circuit",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0237": [
    {
      "scope": "所有汽车制造商",
      "code": "P0237",
      "zh-cn": "涡轮/超级增压器增压传感器A电路低",
      "en-us": "Turbocharger/Supercharger Boost Sensor A Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。增压传感器，也叫增压压力传感器（BPS），其作用是将增压压力以电信号的形式传输给电子控制单元（ECU）。如果增压传感器信号电压低于0.25伏，该故障码会出现。"
    }
  ],
  "P0972": [
    {
      "scope": "所有汽车制造商",
      "code": "P0972",
      "zh-cn": "换档电磁阀A控制电路范围/性能",
      "en-us": "Shift Solenoid A Control Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0273": [
    {
      "scope": "所有汽车制造商",
      "code": "P0273",
      "zh-cn": "第5缸喷油器电路低",
      "en-us": "Cylinder 5 Injector Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第5缸喷油器控制电路电压低于校准的最低值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0758": [
    {
      "scope": "所有汽车制造商",
      "code": "P0758",
      "zh-cn": "换档电磁阀B电子问题",
      "en-us": "Shift Solenoid B Electrical",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0815": [
    {
      "scope": "所有汽车制造商",
      "code": "P0815",
      "zh-cn": "升档开关电路",
      "en-us": "Upshift Switch Circuit",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0736": [
    {
      "scope": "所有汽车制造商",
      "code": "P0736",
      "zh-cn": "倒档齿轮比不正确",
      "en-us": "Reverse Incorrect Ratio",
      "sys": "变速箱",
      "knowledge": "车辆在倒档指令打开的情况下运行，电子控制单元（ECU）检测到倒档齿轮比不正确。故障原因包括变速器液液位太低，换档电磁阀，变速器液压传感器，阀体内的电磁阀故障，输入轴速度传感器，输出轴速度传感器，电路，接头，变速器控制模块故障等。"
    }
  ],
  "P0593": [
    {
      "scope": "所有汽车制造商",
      "code": "P0593",
      "zh-cn": "定速巡航系统多功能输入B电路高",
      "en-us": "Cruise Control Multi-Function Input B Circuit High",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。故障原因包括定速巡航多功能输入开关，电路，接头等。"
    }
  ],
  "P0C51": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C51",
      "zh-cn": "驱动电机A位置传感器电路A范围/性能",
      "en-us": "Drive Motor A Position Sensor Circuit A Range/Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P015D": [
    {
      "scope": "所有汽车制造商",
      "code": "P015D",
      "zh-cn": "氧传感器延迟响应 - （空燃比）稀到浓 （第2排，传感器 1）",
      "en-us": "O2 Sensor Delayed Response - Lean to Rich (Bank 2, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。如果电子控制单元（ECU）发现在空燃比由稀变浓的过程中，电压变化速率滞后，该故障码就会出现。"
    }
  ],
  "P0138": [
    {
      "scope": "所有汽车制造商",
      "code": "P0138",
      "zh-cn": "氧传感器电路高电压（第1排，传感器 2）",
      "en-us": "O2 Sensor Circuit High Voltage (Bank 1, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。当加热氧传感器信号的电压在设定的时间段内持续高于1.5伏时，该故障码就会出现。故障原因包括氧传感器电路短路到正极，氧传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0C30": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C30",
      "zh-cn": "混合动力电池组充电状态高",
      "en-us": "Hybrid Battery Pack State of Charge High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0C4C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C4C",
      "zh-cn": "混合动力电池组冷却液供电电压电路低",
      "en-us": "Hybrid Battery Pack Coolant Pump Supply Voltage Circuit Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0997": [
    {
      "scope": "所有汽车制造商",
      "code": "P0997",
      "zh-cn": "换档电磁阀F控制电路范围/性能",
      "en-us": "Shift Solenoid F Control Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0C21": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C21",
      "zh-cn": "辅助变速器液泵U-V-W相电路低",
      "en-us": "Auxiliary Transmission Fluid Pump Phase U-V-W Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0B0F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B0F",
      "zh-cn": "混合动力电池组电流传感器B电路范围/性能",
      "en-us": "Hybrid Battery Pack Current Sensor B Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块通过来自电池电流传感器的信号来监控电池的充电放电情况。如果控制模块发现电池电流传感器发生故障，该故障码会出现。"
    }
  ],
  "P0A2C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A2C",
      "zh-cn": "驱动电机A温度传感器电路低",
      "en-us": "Drive Motor A Temperature Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "驱动电机A温度传感器电路发生故障。故障原因包括电路，接头，电子控制单元，驱动电机等。有些车辆的驱动电机温度传感器跟驱动电机是一体的。所以，如果确定是该温度传感器本身的问题，有可能需要换掉整个驱动电机。"
    }
  ],
  "P0A50": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A50",
      "zh-cn": "发电机位置传感器电路超速",
      "en-us": "Generator Position Sensor Circuit Overspeed",
      "sys": "混合动力系统",
      "knowledge": "发电机超过了校准的最大发动机转速极限。"
    }
  ],
  "P0AA2": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AA2",
      "zh-cn": "混合动力电池正极接触器电路卡在开的位置",
      "en-us": "Hybrid Battery Positive Contactor Circuit Stuck Open",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果第1和第2系统主继电器（SMR）中的一个卡住，有可能会导致高压系统不能关闭。所以，混合动力汽车电子控制单元如果一旦发现其中的任何一个继电器发生故障，便会终止整个系统。"
    }
  ],
  "P004C": [
    {
      "scope": "所有汽车制造商",
      "code": "P004C",
      "zh-cn": "涡轮/超级增压器增压控制B电路低",
      "en-us": "Turbocharger/Supercharger Boost Control B Circuit Low",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。涡轮/超级增压器增压控制器的作用是当增压压力达到设定值后，气压推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮速度，控制增压水平。该故障码表明涡轮/超级增压器增压控制电路电压低于校准的最低值。"
    }
  ],
  "P00B0": [
    {
      "scope": "所有汽车制造商",
      "code": "P00B0",
      "zh-cn": "涡轮/超级增压器增压控制B模块性能",
      "en-us": "Turbocharger/Supercharger Boost Control B Module Performance",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。涡轮/超级增压器增压控制器的作用是当增压压力达到设定值后，气压推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮速度，控制增压水平。该故障码表明涡轮/超级增压器增压控制B模块发生故障。"
    }
  ],
  "P0501": [
    {
      "scope": "所有汽车制造商",
      "code": "P0501",
      "zh-cn": "车速传感器（VSS）A范围/性能",
      "en-us": "Vehicle Speed Sensor A Range/Performance",
      "sys": "车速及怠速控制",
      "knowledge": "车速传感器（VSS）的作用是将汽车的速度以电信号形式传输给电子控制单元（ECU），作为控制发动机怠速，自动变速器换档，液力变矩器器锁止，发动机冷却风扇的开闭，以及巡航定速等其它功能的参考依据。如果电子控制单元（ECU）检测到实际车速跟基于其他输入估算的车速相差太大，该故障码会出现。故障原因包括VSS传感器电路或接头故障，VSS传感器故障，VSS机械连接故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0959": [
    {
      "scope": "所有汽车制造商",
      "code": "P0959",
      "zh-cn": "自动换档手动（ASM）变速器模式（动力/冬季/运动/等）电路间歇",
      "en-us": "Auto Shift Manual Mode Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "自动换档手动变速器允许司机将变速器打入手动模式，手动控制升档或降档。"
    }
  ],
  "P0094": [
    {
      "scope": "所有汽车制造商",
      "code": "P0094",
      "zh-cn": "燃油系统检测到泄漏 - 少量泄漏",
      "en-us": "Fuel System Leak Detected - Small Leak",
      "sys": "燃油, 空气或排放控制",
      "knowledge": ""
    }
  ],
  "P0305": [
    {
      "scope": "所有汽车制造商",
      "code": "P0305",
      "zh-cn": "第5缸检测到失火",
      "en-us": "Cylinder 5 Misfire Detected",
      "sys": "点火系统",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。如果电子控制单元（ECU）检测到可能会对催化转换器造成破坏的失火，故障指示灯会闪烁，此时应立即关闭发动机。该故障码表明电子控制单元（ECU）检测到气缸5失火。故障原因包括点火系统故障，燃油输送故障，进气歧管或EGR，PCV的空气泄漏，机械性气缸故障等。"
    }
  ],
  "P0900": [
    {
      "scope": "所有汽车制造商",
      "code": "P0900",
      "zh-cn": "离合器执行器电路/开路",
      "en-us": "Clutch Actuator Circuit/Open",
      "sys": "变速箱",
      "knowledge": "离合器执行器是离合器动作的执行者，其基本功能是分离和结合离合器。机电式离合器执行器以电动机作为动力源，通过控制转速和位置，实现对离合器执行结合过程的精确调节。"
    }
  ],
  "P07B1": [
    {
      "scope": "所有汽车制造商",
      "code": "P07B1",
      "zh-cn": "变速器摩擦衬片H卡在开的位置",
      "en-us": "Transmission Friction Element H Stuck On",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0A70": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A70",
      "zh-cn": "发电机U相电流低",
      "en-us": "Generator Phase U Current Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控发电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0B75": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B75",
      "zh-cn": "混合动力电池电压监控L电路高",
      "en-us": "Hybrid Battery Voltage Sense L Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P033C": [
    {
      "scope": "所有汽车制造商",
      "code": "P033C",
      "zh-cn": "爆震传感器4电路低 （第2排）",
      "en-us": "Knock Sensor 4 Circuit Low (Bank 2)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0B19": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B19",
      "zh-cn": "混合动力电池组电压监控C电路",
      "en-us": "Hybrid Battery Pack Voltage Sense C Circuit",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0B8A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B8A",
      "zh-cn": "混合动力电池电压监控P电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense P Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0003": [
    {
      "scope": "所有汽车制造商",
      "code": "P0003",
      "zh-cn": "燃油量调节器控制电路低",
      "en-us": "Fuel Volume Regulator Control Circuit Low",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "（在喷油嘴被广泛使用的新型汽车中，燃油量调节器已经很少被使用）"
    }
  ],
  "P062F": [
    {
      "scope": "所有汽车制造商",
      "code": "P062F",
      "zh-cn": "内部控制模块EEPROM（可擦可编程只读存储器）错误",
      "en-us": "Internal Control Module EEPROM Error",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P0088": [
    {
      "scope": "所有汽车制造商",
      "code": "P0088",
      "zh-cn": "燃油分供管/系统压力 - 太高",
      "en-us": "Fuel Rail/System Pressure - Too High",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油系统需要保持恒定的压力，油压过低则喷油器喷油太弱或不喷油，油压太高则使油路损毁或喷油器损坏。该故障码表明电子控制单元（ECU）检测到燃油分供管压力在设定的时间段内高于校准的最高值。压力过高可能是燃油压力调节器，油路堵塞，燃油压力传感器，燃油泵控制模块等问题。"
    }
  ],
  "P0264": [
    {
      "scope": "所有汽车制造商",
      "code": "P0264",
      "zh-cn": "第2缸喷油器电路低",
      "en-us": "Cylinder 2 Injector Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第2缸喷油器控制电路电压低于校准的最低值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0A20": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A20",
      "zh-cn": "电机转矩传感器电路高",
      "en-us": "Motor Torque Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "控制模块检测到电机转矩传感器信号超出校准的正常范围。"
    }
  ],
  "P0587": [
    {
      "scope": "所有汽车制造商",
      "code": "P0587",
      "zh-cn": "定速巡航系统通风控制电路低",
      "en-us": "Cruise Control Vent Control Circuit Low",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统通过控制伺服器内的真空来控制节气门角度，从而控制车速。当需要加速时，真空电磁阀开启，与进气歧管（或专门的真空泵）相通，密封套内真空度增大，吸动膜片，克服弹簧力，通过拉线使节气门开度增大，车辆加速行驶。当达到设定车速时，真空电磁阀与通风电磁阀同时关闭，此时密封套内的真空度不变，汽车保持恒速行驶。当需要减速时，通风电磁阀打开，让空气进入密封套，膜片弹簧把膜片压回原位，节气门开度减小，于是汽车减速。P0586表明定速巡航系统通风控制电路电压低于校准的最低值。故障原因包括定速巡航系统通风口电磁阀，电路，接头等。"
    }
  ],
  "P0672": [
    {
      "scope": "所有汽车制造商",
      "code": "P0672",
      "zh-cn": "气缸2电热塞电路/开路",
      "en-us": "Cylinder 2 Glow Plug Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸2电热塞电路发生故障，该故障码会出现。"
    }
  ],
  "P0641": [
    {
      "scope": "所有汽车制造商",
      "code": "P0641",
      "zh-cn": "传感器参考电压A电路/开路",
      "en-us": "Sensor Reference Voltage A Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到5伏参考电压电路A出错。故障原因包括5伏参考电压电路到某个传感器的电路发生短路或短路，一个或多个传感器发生短路或开路，自动变速器液压传感器故障，电磁阀故障，变速器控制模块故障，变速器输入速度（RPM）传感器故障，变速器输出速度（RPM）传感器故障等。"
    }
  ],
  "P0096": [
    {
      "scope": "所有汽车制造商",
      "code": "P0096",
      "zh-cn": "进气温度（IAT）传感器2电路范围/性能 （第1排）",
      "en-us": "Intake Air Temperature Sensor 2 Circuit Range/Performance (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。电子控制单元（ECU）在发动机关闭一定时间（通常为6小时）后，会通过比较进气温度（IAT）传感器跟发动机冷却液温度（ECT）传感器的读数来判定进气温度（IAT）传感器的合理性。如果发动机在下次启动时进气温度（IAT）传感器的读数跟发动机冷却液温度（ECT）传感器读书的差别超过了设定校准的值（通常17℃），则该故障码会出现。"
    }
  ],
  "P0B42": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B42",
      "zh-cn": "混合动力电池电压监控B电路低",
      "en-us": "Hybrid Battery Voltage Sense B Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0008": [
    {
      "scope": "所有汽车制造商",
      "code": "P0008",
      "zh-cn": "发动机位置系统性能 （第1排）",
      "en-us": "Engine Position System Performance (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。凸轮轴的作用是控制气门的开启和闭合。发动机位置系统利用曲轴位置传感器和凸轮轴位置传感器的信号生成一个角度计数器。角度计数器然后被与曲轴轮角度同步，提供发动机的当前位置。如果电子控制单元（ECU）检测到第1排的两个凸轮轴跟曲轴在一定时间段内不吻合，该故障码会出现。"
    }
  ],
  "P0BF0": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BF0",
      "zh-cn": "驱动电机A，W相电流传感器电路高",
      "en-us": "Drive Motor A Phase W Current Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0BEB": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BEB",
      "zh-cn": "驱动电机A，V相电流传感器电路低",
      "en-us": "Drive Motor A Phase V Current Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0372": [
    {
      "scope": "所有汽车制造商",
      "code": "P0372",
      "zh-cn": "点火正时参考高解析信号A太少脉冲",
      "en-us": "Timing Reference High Resolution Signal A Too Few Pulses",
      "sys": "点火系统",
      "knowledge": "光学传感器通过数位于喷射泵内的传感器盘上的脉冲来为动力总成控制模块（PCM）提供高解析信号。这个信号是PCM控制燃油和正时的一个重要参考依据之一。该故障码的原因包括光学传感器，其电路，接头或PCM."
    }
  ],
  "P0503": [
    {
      "scope": "所有汽车制造商",
      "code": "P0503",
      "zh-cn": "车速传感器（VSS）A间歇/不稳定/高",
      "en-us": "Vehicle Speed Sensor A Intermittent/Erratic/High",
      "sys": "车速及怠速控制",
      "knowledge": "车速传感器（VSS）的作用是将汽车的速度以电信号形式传输给电子控制单元（ECU），作为控制发动机怠速，自动变速器换档，液力变矩器器锁止，发动机冷却风扇的开闭，以及巡航定速等其它功能的参考依据。车速读数可以来自车速传感器（VSS），分动箱速度传感器，或防抱死刹车（ABS）控制模块。如果电子控制单元（ECU）检测到车速不稳定，则该故障码会出现。"
    }
  ],
  "P0062": [
    {
      "scope": "所有汽车制造商",
      "code": "P0062",
      "zh-cn": "热氧传感器加热器控制电路 （第2排，传感器3）",
      "en-us": "HO2S Heater Control Circuit (Bank 2, Sensor 3)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）通过控制氧传感器加热器的开/关来保持氧传感器780oC的温度。如果氧传感器在设定的时间内没有达到要求的温度，或ECU无法维持设定的温度，该故障码会出现。"
    }
  ],
  "P0212": [
    {
      "scope": "所有汽车制造商",
      "code": "P0212",
      "zh-cn": "喷油器电路/开路 - 第12缸",
      "en-us": "Injector Circuit/Open - Cylinder 12",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器控制电路出错，该故障码会出现。故障原因包括喷油器接口，电路故障，喷油器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0469": [
    {
      "scope": "所有汽车制造商",
      "code": "P0469",
      "zh-cn": "蒸发排放系统吹扫流量传感器电路间歇",
      "en-us": "EVAP Purge Flow Sensor Circuit Intermittent",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。电子控制单元（ECU）检测到蒸发排放系统（EVAP）吹扫流量传感器信号电压突然变化。"
    }
  ],
  "P0132": [
    {
      "scope": "所有汽车制造商",
      "code": "P0132",
      "zh-cn": "氧传感器电路高电压（第1排，传感器 1）",
      "en-us": "O2 Sensor Circuit High Voltage (Bank 1, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。当加热氧传感器信号的电压在设定的时间段内持续高于1.5伏时，该故障码就会出现。故障原因包括氧传感器信号电路短路到正极，氧传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0C23": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C23",
      "zh-cn": "辅助变速器液泵控制模块电路/开路",
      "en-us": "Auxiliary Transmission Fluid Pump Control Module Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0AC8": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AC8",
      "zh-cn": "混合动力电池温度传感器B电路高",
      "en-us": "Hybrid Battery Temperature Sensor B Circuit High",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0493": [
    {
      "scope": "所有汽车制造商",
      "code": "P0493",
      "zh-cn": "风扇速度超速",
      "en-us": "Fan Overspeed",
      "sys": "排放控制",
      "knowledge": ""
    }
  ],
  "P071B": [
    {
      "scope": "所有汽车制造商",
      "code": "P071B",
      "zh-cn": "变速器模式开关A电路低",
      "en-us": "Transmission Mode Switch A Circuit Low",
      "sys": "变速箱",
      "knowledge": "变速器模式开关的作用是根据用户选择的模式（运动/经济/冬季等）来指令变速器提前或延后换档，或高挡起步等。故障原因包括变速器模式开关，电路，接头，或控制模块。"
    }
  ],
  "P076B": [
    {
      "scope": "所有汽车制造商",
      "code": "P076B",
      "zh-cn": "换档电磁阀H性能/卡在关的位置",
      "en-us": "Shift Solenoid H Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0A48": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A48",
      "zh-cn": "驱动电机B位置传感器电路高",
      "en-us": "Drive Motor B Position Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括驱动电机B位置传感器电路，接头，或传感器本身；混合动力驱动电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P0C3E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C3E",
      "zh-cn": "直流/直流换流器温度传感器B电路范围/性能",
      "en-us": "DC/DC Converter Temperature Sensor B Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "直流/直流转换器将HV电池的直流高压（200-400伏特）转化成12伏特电压，从而可以给辅助电池充电并给车内附件供电。"
    }
  ],
  "P0506": [
    {
      "scope": "所有汽车制造商",
      "code": "P0506",
      "zh-cn": "怠速空气控制系统发动机转速比预期值低",
      "en-us": "Idle Air Control System RPM Lower Than Expected",
      "sys": "车速及怠速控制",
      "knowledge": "怠速空气控制（IAC）阀带有一个由准确移动步进电机控制的可移动针阀。在节气门关闭的情况下，IAC阀通过改变旁通管路的空气流量，对怠速进行控制，以适应不同条件下的怠速。如果电子控制单元（ECU）检测到发动机转速低于设定值时，该故障码会出现。故障原因包括空气进口阻塞，IAC电路故障，IAC电磁阀故障，电子控制模块（PCM或ECM）故障，车速传感器故障等。"
    }
  ],
  "P0383": [
    {
      "scope": "所有汽车制造商",
      "code": "P0383",
      "zh-cn": "电热塞控制模块控制电路低",
      "en-us": "Glow Plug Control Module Control Circuit Low",
      "sys": "点火系统",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到电热塞控制模块电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0242": [
    {
      "scope": "所有汽车制造商",
      "code": "P0242",
      "zh-cn": "涡轮/超级增压器增压传感器B电路高",
      "en-us": "Turbocharger/Supercharger Boost Sensor B Circuit High",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。增压传感器，也叫增压压力传感器（BPS），其作用是将增压压力以电信号的形式传输给电子控制单元（ECU）。如果增压传感器信号电压高于5.0伏，该故障码会出现。"
    }
  ],
  "P085D": [
    {
      "scope": "所有汽车制造商",
      "code": "P085D",
      "zh-cn": "换档控制模块A性能",
      "en-us": "Gear Shift Control Module A Performance",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0C61": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C61",
      "zh-cn": "驱动电机B位置传感器电路B低",
      "en-us": "Drive Motor B Position Sensor Circuit B Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0627": [
    {
      "scope": "所有汽车制造商",
      "code": "P0627",
      "zh-cn": "燃油泵A控制电路/开路",
      "en-us": "Fuel Pump A Control Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "燃油泵的作用是把燃油从燃油箱中吸出、加压后输送到供油管中，和燃油压力调节器配合建立一定的燃油压力。如果电子控制单元（ECU）检测到燃油泵控制电路出错，该故障码会出现。故障原因包括燃油压力调节器阀故障，燃油压力传感器故障，燃油泵控制模块故障，燃油泵故障等。"
    }
  ],
  "P0B16": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B16",
      "zh-cn": "混合动力电池组电压监控B电路低",
      "en-us": "Hybrid Battery Pack Voltage Sense B Circuit Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0428": [
    {
      "scope": "所有汽车制造商",
      "code": "P0428",
      "zh-cn": "催化转换器温度传感器电路高（第1排，传感器1）",
      "en-us": "Catalyst Temperature Sensor Circuit High (Bank 1, Sensor 1)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器温度传感器电路电压高于校准的最高值。故障原因包括催化转换器温度传感器，电路，接头，或电子控制单元（ECU）故障。"
    }
  ],
  "P0706": [
    {
      "scope": "所有汽车制造商",
      "code": "P0706",
      "zh-cn": "变速器档位传感器A电路范围/性能 （PRNDL输入）",
      "en-us": "Transmission Range Sensor A Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "变速器挡位传感器负责将变速器杆的位置（PRNDL）以电信号的形式输送给电子控制单元（ECU）。如果ECU检测到变速器档位（TR）传感器信号卡在过渡位置，该故障码会出现。造成该故障码的原因往往是变速器档位传感器接头，电路，或本身的问题，还有可能是ECU的问题。"
    }
  ],
  "P0897": [
    {
      "scope": "所有汽车制造商",
      "code": "P0897",
      "zh-cn": "变速器液变质",
      "en-us": "Transmission Fluid Deteriorated",
      "sys": "变速箱",
      "knowledge": "建议更换变速器液。请注意一定要购买汽车制造商规定的变速器液。"
    }
  ],
  "P02D5": [
    {
      "scope": "所有汽车制造商",
      "code": "P02D5",
      "zh-cn": "喷油器补偿学习在最高限气缸5",
      "en-us": "Cylinder 5 Fuel Injector Offset Learning At Max Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第5缸喷油器补偿学习已经达到了最高学习极限，该故障码会出现。"
    }
  ],
  "P080D": [
    {
      "scope": "所有汽车制造商",
      "code": "P080D",
      "zh-cn": "升档/降挡电磁阀控制电路高",
      "en-us": "Upshift/Skip Shift Solenoid Control Circuit High",
      "sys": "变速箱",
      "knowledge": "对于一些大功率的汽车，为提高汽车的燃油效率和降低排放，当条件满足的时候（低速，小油门，车已预热等），跳档电磁阀会阻止挂入2，3档，相当于强制变速杆从1档直接换到4档。该故障码表明跳档电磁阀控制电路电压高于校准的最高值。"
    }
  ],
  "P0211": [
    {
      "scope": "所有汽车制造商",
      "code": "P0211",
      "zh-cn": "喷油器电路/开路 - 第11缸",
      "en-us": "Injector Circuit/Open - Cylinder 11",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器控制电路出错，该故障码会出现。故障原因包括喷油器接口，电路故障，喷油器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0249": [
    {
      "scope": "所有汽车制造商",
      "code": "P0249",
      "zh-cn": "涡轮/超级增压器废气门电磁阀B低",
      "en-us": "Turbocharger/Supercharger Wastegate Solenoid B Low",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。废气门电磁阀的作用是通过控制进入涡轮的尾气流量（将其余尾气绕开），来调整涡轮转速，从而调整最大增压压力。如果电子控制单元（ECU）检测到废气门电磁阀B电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0590": [
    {
      "scope": "所有汽车制造商",
      "code": "P0590",
      "zh-cn": "定速巡航系统多功能输入B电路卡住",
      "en-us": "Cruise Control Multi-Function Input B Circuit Stuck",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。故障原因包括定速巡航多功能输入开关，电路，接头等。"
    }
  ],
  "P0092": [
    {
      "scope": "所有汽车制造商",
      "code": "P0092",
      "zh-cn": "燃油压力调节器1控制电路高",
      "en-us": "Fuel Pressure Regulator 1 Control Circuit High",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。如果电子控制单元（ECU）检测到燃油压力调节器1控制电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P04A0": [
    {
      "scope": "所有汽车制造商",
      "code": "P04A0",
      "zh-cn": "排气压力控制阀门B范围/性能",
      "en-us": "Exhaust Pressure Control Valve B Range/Performance",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。电子控制单元（ECU）检测到排气压力控制阀A电路电压出错。故障原因包括排气翻板阀或其电路。"
    }
  ],
  "P0C68": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C68",
      "zh-cn": "发电机位置传感器电路A间歇/不稳定",
      "en-us": "Generator Position Sensor Circuit A Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括发电机位置传感器电路，接头，或传感器本身；混合动力车辆发电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P06AF": [
    {
      "scope": "所有汽车制造商",
      "code": "P06AF",
      "zh-cn": "扭力管理系统 - 发动机被强迫关闭",
      "en-us": "Torque Management System - Forced Engine Shutdown",
      "sys": "计算机或辅助输出电路",
      "knowledge": "扭力管理系统的作用是在变速器换挡或车轮打滑的过程中，通过暂时关闭喷油器，或滞后点火等的方式来降低发动机扭力，从而使换档更加平稳，并减少对传动系统的磨损。"
    }
  ],
  "P0262": [
    {
      "scope": "所有汽车制造商",
      "code": "P0262",
      "zh-cn": "第1缸喷油器电路高",
      "en-us": "Cylinder 1 Injector Circuit High",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第1缸喷油器控制电路电压高于校准的最高值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0A85": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A85",
      "zh-cn": "混合动力电池组冷却风扇1控制电路高",
      "en-us": "Hybrid Battery Pack Cooling Fan 1 Control Circuit High",
      "sys": "混合动力系统",
      "knowledge": "风扇电机控制器负责调节混合动力电池组冷却风扇的电压。如果冷却风扇1控制电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P02F8": [
    {
      "scope": "所有汽车制造商",
      "code": "P02F8",
      "zh-cn": "喷油器电路范围/性能 - 气缸11",
      "en-us": "Cylinder 11 Injector Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第11缸喷油器电路出错，该故障码会出现。"
    }
  ],
  "P0772": [
    {
      "scope": "所有汽车制造商",
      "code": "P0772",
      "zh-cn": "换档电磁阀E卡在开的位置",
      "en-us": "Shift Solenoid E Stuck On",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P072D": [
    {
      "scope": "所有汽车制造商",
      "code": "P072D",
      "zh-cn": "卡在2档",
      "en-us": "Stuck in Gear 2",
      "sys": "变速箱",
      "knowledge": "车辆行驶中，电子控制单元（ECU）检测到换档电磁阀发生发生故障（卡住）导致变速器卡在2档。故障原因包括换档电磁阀，输入轴速度传感器，输出轴速度传感器，电路，接头，控制模块，以及变速器机械故障等。"
    }
  ],
  "P071E": [
    {
      "scope": "所有汽车制造商",
      "code": "P071E",
      "zh-cn": "变速器模式开关B电路低",
      "en-us": "Transmission Mode Switch B Circuit Low",
      "sys": "变速箱",
      "knowledge": "变速器模式开关的作用是根据用户选择的模式（运动/经济/冬季等）来指令变速器提前或延后换档，或高挡起步等。故障原因包括变速器模式开关，电路，接头，或控制模块。"
    }
  ],
  "P0AC0": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AC0",
      "zh-cn": "混合动力电池组电流传感器A电路范围/性能",
      "en-us": "Hybrid Battery Pack Current Sensor A Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块通过来自电池电流传感器的信号来监控电池的充电放电情况。如果控制模块发现电池电流传感器信号电路发生故障，该故障码会出现。"
    }
  ],
  "P0656": [
    {
      "scope": "所有汽车制造商",
      "code": "P0656",
      "zh-cn": "燃油液位输出电路",
      "en-us": "Fuel Level Output Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "燃油液位传感器利用油箱内的一个浮标和可变电阻的原理将油箱内的燃油液位以电信号的形式输送给电子控制模块。"
    }
  ],
  "P009A": [
    {
      "scope": "所有汽车制造商",
      "code": "P009A",
      "zh-cn": "进气温度/周围空气温度相关性",
      "en-us": "Intake Air Temperature/Ambient Air Temperature Correlation",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度转变为电压信号输入给电子控制单元（ECU），为喷油修正提供一个参考依据。如果电子控制单元（ECU）检测到进气温度（IAT）传感器跟周围空气温度传感器的信号差别大于允许的最大极限，该故障码会出现。"
    }
  ],
  "P0217": [
    {
      "scope": "所有汽车制造商",
      "code": "P0217",
      "zh-cn": "发动机冷却液处于过热状态",
      "en-us": "Engine Coolant Over Temperature Condition",
      "sys": "燃油或空气",
      "knowledge": "发动机冷却液温度（ECT）传感器或缸盖温度（CHT）传感器信号显示发动机处于温度过高状态。故障原因包括冷却液液面太低，节温器卡在关闭，风扇，冷却液泵，或水箱散热器等。"
    }
  ],
  "P0C7A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C7A",
      "zh-cn": "驱动电机B换流器电压太高",
      "en-us": "Drive Motor B Inverter Voltage Too High",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P0042": [
    {
      "scope": "所有汽车制造商",
      "code": "P0042",
      "zh-cn": "热氧传感器加热器控制电路 （第1排，传感器3）",
      "en-us": "HO2S Heater Control Circuit (Bank 1, Sensor 3)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）通过控制氧传感器加热器的开/关来保持氧传感器780oC的温度。如果氧传感器在设定的时间内没有达到要求的温度，或ECU无法维持设定的温度，该故障码会出现。"
    }
  ],
  "P0B1E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B1E",
      "zh-cn": "混合动力电池组电压监控D电路",
      "en-us": "Hybrid Battery Pack Voltage Sense D Circuit",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0484": [
    {
      "scope": "所有汽车制造商",
      "code": "P0484",
      "zh-cn": "风扇电路电流过高",
      "en-us": "Fan Circuit Over Current",
      "sys": "排放控制",
      "knowledge": ""
    }
  ],
  "P00AD": [
    {
      "scope": "所有汽车制造商",
      "code": "P00AD",
      "zh-cn": "进气温度（IAT）传感器1电路高 （第2排）",
      "en-us": "Intake Air Temperature Sensor 1 Circuit High (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。如果电子控制单元（ECU）检测到进气温度（IAT）传感器信号电压高于自检的最大值（4.6伏或-50摄氏度），该故障码会出现。"
    }
  ],
  "P00A4": [
    {
      "scope": "所有汽车制造商",
      "code": "P00A4",
      "zh-cn": "增压空气冷却器温度传感器电路间歇/不稳定 （第2排）",
      "en-us": "Charge Air Cooler Temperature Sensor Circuit Intermittent/Erratic (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。该故障码的原因包括增压空气冷却器温度传感器，其电路，或接头问题。"
    }
  ],
  "P0B4C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B4C",
      "zh-cn": "混合动力电池电压监控D电路低",
      "en-us": "Hybrid Battery Voltage Sense D Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0752": [
    {
      "scope": "所有汽车制造商",
      "code": "P0752",
      "zh-cn": "换档电磁阀A卡在全开位置",
      "en-us": "Shift Solenoid A Stuck On",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0A80": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A80",
      "zh-cn": "更换混合动力电池组",
      "en-us": "Replace Hybrid Battery Pack",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块负责监测电池块的电压。如果电池块之间的电压差超过标准值，该故障码会出现。"
    }
  ],
  "P0420": [
    {
      "scope": "所有汽车制造商",
      "code": "P0420",
      "zh-cn": "催化转换器系统效能低于阈值 （第1排）",
      "en-us": "Catalyst System Efficiency Below Threshold (Bank 1)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。电子控制单元（ECU）检测到氧传感器1/2的交换率跟1/1的交换率相当，因此推断催化转换器系统效率太低。故障原因包括排气管或排气歧管附近尾气泄漏，催化箱失效，发动机冷却液温度（ECT）传感器故障，发动机失火或正时滞后，机油太脏，氧传感器故障，燃油系统压力太高等。"
    }
  ],
  "P02DA": [
    {
      "scope": "所有汽车制造商",
      "code": "P02DA",
      "zh-cn": "喷油器补偿学习在最低限气缸8",
      "en-us": "Cylinder 8 Fuel Injector Offset Learning At Min Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第8缸喷油器补偿学习已经达到了最低学习极限，该故障码会出现。"
    }
  ],
  "P0C43": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C43",
      "zh-cn": "混合动力电池组冷却液温度传感器电路范围/性能",
      "en-us": "Hybrid Battery Pack Coolant Temperature Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P040F": [
    {
      "scope": "所有汽车制造商",
      "code": "P040F",
      "zh-cn": "废气再循环阀温度传感器A/B相关性",
      "en-us": "Exhaust Gas Recirculation Temperature Sensor A/B Correlation",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环阀（EGR）温度传感器A与B的信号差超过了设定的最大极限，该故障码会出现。"
    }
  ],
  "P0582": [
    {
      "scope": "所有汽车制造商",
      "code": "P0582",
      "zh-cn": "定速巡航系统真空控制电路/开路",
      "en-us": "Cruise Control Vacuum Control Circuit/Open",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统通过控制伺服器内的真空来控制节气门角度，从而控制车速。当需要加速时，真空电磁阀开启，与进气歧管（或专门的真空泵）相通，密封套内真空度增大，吸动膜片，克服弹簧力，通过拉线使节气门开度增大，车辆加速行驶。当达到设定车速时，真空电磁阀与通风电磁阀同时关闭，此时密封套内的真空度不变，汽车保持恒速行驶。当需要减速时，通风电磁阀打开，让空气进入密封套，膜片弹簧把膜片压回原位，节气门开度减小，于是汽车减速。P0582表明真空控制电路出错。故障原因包括定速巡航真空控制电磁阀，电路，接头等。"
    }
  ],
  "P0133": [
    {
      "scope": "所有汽车制造商",
      "code": "P0133",
      "zh-cn": "氧传感器电路慢响应（第1排，传感器 1）",
      "en-us": "O2 Sensor Circuit Slow Response (Bank 1, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。当电压变化速率低于校准值时，电子控制单元（ECU）就会开始修改空燃比试图提高氧传感器的电压变化速率。如果ECU已经达到了可以接受的燃油修剪限制或者已超过了可接受的燃油修剪的时间长度，而仍然没有监测到可以接受的电压变化速率的话，该故障码就会出现。故障原因包括氧传感器由于燃油中含硅而被污染，氧传感器信号电路开路，氧传感器本身故障，排气管或排气歧管泄漏，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0213": [
    {
      "scope": "所有汽车制造商",
      "code": "P0213",
      "zh-cn": "冷车启动喷油器1",
      "en-us": "Cold Start Injector 1",
      "sys": "燃油或空气",
      "knowledge": "汽车启动时，如果电子控制单元（ECU）检测到发动机温度低于某一设定值，冷车启动喷油器（CSI）会在起动机旋转时通过向进气系统喷入汽油的方式来以加浓空燃比，从而使发动机容易启动。P0213表明冷车启动喷油器1发生故障。"
    }
  ],
  "P0BF9": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BF9",
      "zh-cn": "驱动电机B，W相电流传感器电路",
      "en-us": "Drive Motor B Phase W Current Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0883": [
    {
      "scope": "所有汽车制造商",
      "code": "P0883",
      "zh-cn": "变速器控制模块（TCU）电源输入信号高",
      "en-us": "TCU Power Input Signal High",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。"
    }
  ],
  "P0702": [
    {
      "scope": "所有汽车制造商",
      "code": "P0702",
      "zh-cn": "变速器控制系统电子问题",
      "en-us": "Transmission Control System Electrical",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。故障原因包括变速器控制模块(TCM)，发动机控制模块（ECM)，电路等。"
    }
  ],
  "P081B": [
    {
      "scope": "所有汽车制造商",
      "code": "P081B",
      "zh-cn": "起动机禁用电路高",
      "en-us": "Starter Disable Circuit High",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0B9F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B9F",
      "zh-cn": "混合动力电池电压监控U电路",
      "en-us": "Hybrid Battery Voltage Sense U Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P018E": [
    {
      "scope": "所有汽车制造商",
      "code": "P018E",
      "zh-cn": "燃油压力传感器B电路间歇/不稳定",
      "en-us": "Fuel Pressure Sensor B Circuit Intermittent/Erratic",
      "sys": "燃油或空气",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。电子控制单元（ECU）持续监测燃油压力传感器信号电压。如果这个值发生间歇性故障，则检测失败。"
    }
  ],
  "P0AA7": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AA7",
      "zh-cn": "混合动力电池电压隔离传感器电路",
      "en-us": "Hybrid Battery Voltage Isolation Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0272": [
    {
      "scope": "所有汽车制造商",
      "code": "P0272",
      "zh-cn": "第4缸贡献/平衡错误",
      "en-us": "Cylinder 4 Contribution/Balance",
      "sys": "燃油或空气",
      "knowledge": "电子控制单元（ECU）检测到第4缸的曲轴加速贡献低于校准值。故障原因包括第4缸喷油系统；或其它影响第4缸的发动机问题。"
    }
  ],
  "P02B6": [
    {
      "scope": "所有汽车制造商",
      "code": "P02B6",
      "zh-cn": "燃油（空燃比）修剪在最高限 - 气缸8",
      "en-us": "Cylinder 8 - Fuel Trim at Max Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最大极限超过一定时间，该故障码会出现。"
    }
  ],
  "P0A26": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A26",
      "zh-cn": "发电机扭矩传感器电路间歇",
      "en-us": "Generator Torque Sensor Circuit Intermittent",
      "sys": "混合动力系统",
      "knowledge": "控制模块检测到发电机转矩传感器信号超出校准的正常范围。"
    }
  ],
  "P0924": [
    {
      "scope": "所有汽车制造商",
      "code": "P0924",
      "zh-cn": "换档后拉执行器 （后拉换档杆，偶数齿轮，2,4,6）电路/开路",
      "en-us": "Gear Shift Reverse Actuator Circuit/Open",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P067B": [
    {
      "scope": "所有汽车制造商",
      "code": "P067B",
      "zh-cn": "气缸4电热塞控制电路高",
      "en-us": "Cylinder 4 Glow Plug Control Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸4电热塞电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0052": [
    {
      "scope": "所有汽车制造商",
      "code": "P0052",
      "zh-cn": "热氧传感器加热器控制电路高 （第2排，传感器1）",
      "en-us": "HO2S Heater Control Circuit High (Bank 2, Sensor 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）通过控制氧传感器加热器的开/关来保持氧传感器780oC的温度。如果加热器的控制电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0937": [
    {
      "scope": "所有汽车制造商",
      "code": "P0937",
      "zh-cn": "液压油温度传感器电路",
      "en-us": "Hydraulic Oil Temperature Sensor Circuit",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0552": [
    {
      "scope": "所有汽车制造商",
      "code": "P0552",
      "zh-cn": "动力转向压力传感器/开关电路低",
      "en-us": "Power Steering Pressure Sensor/Switch Circuit Low",
      "sys": "车速及怠速控制",
      "knowledge": "动力转向压力（PSP）传感器根据电位器的原理将动力转向负载压力以电压信号的形式传输给电子控制单元（ECU）。如果负载压力过大，必要的时候ECU会提高发动机怠速，关闭空调压缩机，以防止发动机死火。如果电子控制单元（ECU）检测到动力转向压力传感器信号电压低于自检的最低值，该故障码会出现。故障原因包括PSP传感器电路断路或短路到接地，PSP传感器故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P06CB": [
    {
      "scope": "所有汽车制造商",
      "code": "P06CB",
      "zh-cn": "气缸7电热塞不正确",
      "en-us": "Cylinder 7 Glow Plug Incorrect",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。该故障码表明气缸7电热塞，其电路，接头，或电热赛控制模块（GPCM）出错。"
    }
  ],
  "P07BA": [
    {
      "scope": "所有汽车制造商",
      "code": "P07BA",
      "zh-cn": "变速器驻车档位置传感器/开关B电路高",
      "en-us": "Transmission Park Position Sensor/Switch B Circuit High",
      "sys": "变速箱",
      "knowledge": "驻车档位置传感器的作用是将变速杆是否在驻车档的位置的信号输送给电子控制单元（ECU）。如果ECU检测到驻车档位置传感器电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0533": [
    {
      "scope": "所有汽车制造商",
      "code": "P0533",
      "zh-cn": "空调制冷剂压力传感器A电路高",
      "en-us": "A/C Refrigerant Pressure Sensor A Circuit High",
      "sys": "车速及怠速控制",
      "knowledge": "空调制冷剂压力传感器的作用是将空调制冷剂压力以电信号的形式传送给电子控制单元（ECU），作为控制冷却风扇开关和压缩机继电器的依据。如果电子控制单元检测到空调压力传感器信号电路电压高于校准的最高值，则该故障码会出现。"
    }
  ],
  "P0505": [
    {
      "scope": "所有汽车制造商",
      "code": "P0505",
      "zh-cn": "怠速空气控制系统故障",
      "en-us": "Idle Air Control System",
      "sys": "车速及怠速控制",
      "knowledge": "怠速空气控制（IAC）阀带有一个由准确移动步进电机控制的可移动针阀。在节气门关闭的情况下，IAC阀通过改变旁通管路的空气流量，对怠速进行控制，以适应不同条件下的怠速。电子控制单元（ECU）在钥匙开，发动机运行自检时试图控制发动机转速。如果ECU发现不能控制发动机到想要的的转速时，该故障码会出现。"
    }
  ],
  "P0073": [
    {
      "scope": "所有汽车制造商",
      "code": "P0073",
      "zh-cn": "周围空气温度传感器电路高",
      "en-us": "Ambient Air Temperature Sensor Circuit High",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "周围空气温度传感器的作用是将外部空气温度以电信号的形式传输给电子控制单元（ECU），以帮助发动机实现最佳空燃比。该故障码表明周围空气温度传感器信号电压高于校准的最高值。"
    }
  ],
  "P082A": [
    {
      "scope": "所有汽车制造商",
      "code": "P082A",
      "zh-cn": "换档杆X位置电路范围/性能",
      "en-us": "Gear Lever X Position Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0888": [
    {
      "scope": "所有汽车制造商",
      "code": "P0888",
      "zh-cn": "变速器控制模块（TCU）电源继电器监控电路",
      "en-us": "TCU Power Relay Sense Circuit",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。控制模块继电器的作用是在点火开关关闭以后，继续保持控制模块的供电，直到控制模块完成关闭过程。"
    }
  ],
  "P0C25": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C25",
      "zh-cn": "辅助变速器液泵控制模块电路高",
      "en-us": "Auxiliary Transmission Fluid Pump Control Module Circuit High",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0244": [
    {
      "scope": "所有汽车制造商",
      "code": "P0244",
      "zh-cn": "涡轮/超级增压器废气门电磁阀A范围/性能",
      "en-us": "Turbocharger/Supercharger Wastegate Solenoid A Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。废气门电磁阀的作用是通过控制进入涡轮的尾气流量（将其余尾气绕开），来调整涡轮转速，从而调整最大增压压力。如果电子控制单元（ECU）检测到废气门电磁阀A发生故障，该故障码会出现。"
    }
  ],
  "P0839": [
    {
      "scope": "所有汽车制造商",
      "code": "P0839",
      "zh-cn": "四轮驱动（4WD）开关电路高",
      "en-us": "Four Wheel Drive (4WD) Switch Circuit High",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P010A": [
    {
      "scope": "所有汽车制造商",
      "code": "P010A",
      "zh-cn": "空气流量（MAF）传感器B电路",
      "en-us": "Mass or Volume Air Flow B Circuit",
      "sys": "燃油或空气",
      "knowledge": "空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。如果ECU检测空气流量（MAF）传感器信号电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P0C28": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C28",
      "zh-cn": "辅助变速器液泵电机电流高",
      "en-us": "Auxiliary Transmission Fluid Pump Motor Current High",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0C2F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C2F",
      "zh-cn": "内部控制模块驱动电机/发电机 - 发动机速度传感器性能",
      "en-us": "Internal Control Module Drive Motor/Generator - Engine Speed Sensor Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0808": [
    {
      "scope": "所有汽车制造商",
      "code": "P0808",
      "zh-cn": "离合器位置传感器电路高",
      "en-us": "Clutch Position Sensor Circuit High",
      "sys": "变速箱",
      "knowledge": "离合器位置传感器的作用是将离合器是否踩下的信息以电信号的形式输送给电子控制单元，作为控制发动机启动和定速巡航系统的重要参数。"
    }
  ],
  "P0B5D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B5D",
      "zh-cn": "混合动力电池电压监控G电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense G Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0442": [
    {
      "scope": "所有汽车制造商",
      "code": "P0442",
      "zh-cn": "蒸发排放系统检测到泄漏（少量泄漏）",
      "en-us": "Evaporative Emission System Leak Detected (small leak)",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。电子控制单元（ECU）持续监测蒸发排放控制系统以确保没有燃油蒸气泄漏。如果ECU检测到一个小的（直径大于1.016毫米）燃油蒸汽泄漏，该故障码会出现。"
    }
  ],
  "P0160": [
    {
      "scope": "所有汽车制造商",
      "code": "P0160",
      "zh-cn": "氧传感器电路无作用（第2排，传感器 2）",
      "en-us": "O2 Sensor Circuit No Activity Detected (Bank 2, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）持续监控加热氧传感器已确定氧传感器在工作。如果加热氧传感器信号值持续停留在默认值，电子控制单元（ECU）就会命令振荡的空气/燃油比以试图监测到信号值的一些变化。如果这时候ECU依然无法检测传感器的信号的变化，该故障码就会出现。故障原因包括排气歧管或排气管泄漏，氧传感器本身或其电路或接头故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P00AF": [
    {
      "scope": "所有汽车制造商",
      "code": "P00AF",
      "zh-cn": "涡轮/超级增压器增压控制A模块性能",
      "en-us": "Turbocharger/Supercharger Boost Control A Module Performance",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。涡轮/超级增压器增压控制器的作用是当增压压力达到设定值后，气压推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮速度，控制增压水平。该故障码表明涡轮/超级增压器增压控制A模块发生故障。"
    }
  ],
  "P0422": [
    {
      "scope": "所有汽车制造商",
      "code": "P0422",
      "zh-cn": "主催化转换器效能低于阈值（第1排）",
      "en-us": "Main Catalyst Efficiency Below Threshold (Bank 1)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明主催化转换器效能低于设定的最低极限。故障原因包括催化转换器，氧传感器，以及电路，接头等。故障原因包括排气管或排气歧管附近尾气泄漏，催化箱失效，发动机冷却液温度（ECT）传感器故障，发动机失火或正时滞后，机油太脏，氧传感器故障，燃油系统压力太高等。"
    }
  ],
  "P0A63": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A63",
      "zh-cn": "驱动电机A，W相电流",
      "en-us": "Drive Motor A Phase W Current",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0C00": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C00",
      "zh-cn": "驱动电机A电流低",
      "en-us": "Drive Motor A Current Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0416": [
    {
      "scope": "所有汽车制造商",
      "code": "P0416",
      "zh-cn": "二次空气喷射系统切换阀B电路开路",
      "en-us": "Secondary Air Injection System Switching Valve B Circuit Open",
      "sys": "排放控制",
      "knowledge": "在发动机刚刚启动时，二次空气喷射系统通过往排气歧管强制输入空气来氧化产生的碳氢化合物，一氧化碳等有害气体。这个过程也同时加速了催化转换器的暖化过程。如果电子控制单元（ECU）检测到二次空气喷射系统控制电磁阀电路有开路的情况，该故障码会出现。故障原因包括二次空气喷射执行器电路开路或短路到接地，切换阀故障，二次空气喷射泵故障，继电器故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0A78": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A78",
      "zh-cn": "驱动电机A换流器性能",
      "en-us": "Drive Motor A Inverter Performance",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电压传感器电路。如果HV ECU检测到换流器电压传感器错误，该故障码会出现。"
    }
  ],
  "P0541": [
    {
      "scope": "所有汽车制造商",
      "code": "P0541",
      "zh-cn": "进气加热器A电路低",
      "en-us": "Intake Air Heater A Circuit Low",
      "sys": "车速及怠速控制",
      "knowledge": "进气加热器，也叫歧管进气加热器，其作用是给预热空气进气，以帮助柴油机在寒冷天气的情况下易于启动。如果电子控制单元（ECU）检测到歧管进气加热器电路（MIAH）电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P033D": [
    {
      "scope": "所有汽车制造商",
      "code": "P033D",
      "zh-cn": "爆震传感器4电路高 （第2排）",
      "en-us": "Knock Sensor 4 Circuit High (Bank 2)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0780": [
    {
      "scope": "所有汽车制造商",
      "code": "P0780",
      "zh-cn": "换档故障",
      "en-us": "Shift Error",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCU）检测到通用换档阀故障。"
    }
  ],
  "P0BD5": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BD5",
      "zh-cn": "驱动电机换流器温度传感器C电路间歇/不稳定",
      "en-us": "Drive Motor Inverter Temperature Sensor C Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0252": [
    {
      "scope": "所有汽车制造商",
      "code": "P0252",
      "zh-cn": "喷油泵燃油计量控制A范围/性能（凸轮/转子/喷油器）",
      "en-us": "Injection Pump Fuel Metering Control A Range/Performance (Cam/Rotor/Injector)",
      "sys": "燃油或空气",
      "knowledge": "故障原因包括燃油控制执行器（FCA），其电路，喷油泵，或电子控制模块（ECU）等。燃油控制执行器（FCA）一般位于喷油泵的后侧，它是一个电控电磁阀门。ECU通过循环打开和关闭FCA来控制进入喷油泵的燃油量。"
    }
  ],
  "P062B": [
    {
      "scope": "所有汽车制造商",
      "code": "P062B",
      "zh-cn": "内部控制模块-喷油器控制性能",
      "en-us": "Internal Control Module Fuel Injector Control Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P0404": [
    {
      "scope": "所有汽车制造商",
      "code": "P0404",
      "zh-cn": "废气再循环阀A控制电路范围/性能",
      "en-us": "Exhaust Gas Recirculation A Control Circuit Range/Performance",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）发现实际废气再循环（EGR）阀位置跟指令的EGR阀位置相差超过10%，该故障码会出现。"
    }
  ],
  "P0A91": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A91",
      "zh-cn": "驱动电机B性能",
      "en-us": "Drive Motor B Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车驱动电机B故障"
    }
  ],
  "P0374": [
    {
      "scope": "所有汽车制造商",
      "code": "P0374",
      "zh-cn": "点火正时参考高解析信号A没有脉冲",
      "en-us": "Timing Reference High Resolution Signal A No Pulses",
      "sys": "点火系统",
      "knowledge": "光学传感器通过数位于喷射泵内的传感器盘上的脉冲来为动力总成控制模块（PCM）提供高解析信号。这个信号是PCM控制燃油和正时的一个重要参考依据之一。该故障码的原因包括光学传感器，其电路，接头或PCM."
    }
  ],
  "P0173": [
    {
      "scope": "所有汽车制造商",
      "code": "P0173",
      "zh-cn": "燃油修剪（空燃比） （第2排）",
      "en-us": "Fuel Trim (Bank 2)",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。P0170往往是由于燃油喷射系统故障而引起。故障原因包括空气流量（MAF）传感器之后的空气泄漏，PCV系统泄漏，氧传感器附近或之前的尾气泄漏，喷油器阻塞或其它燃油系统故障，EGR系统泄漏，MAF传感器受污染（导致电子控制模块低估空气流量），油箱油位太低，或机油标尺没有坐好等。"
    }
  ],
  "P0C7D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C7D",
      "zh-cn": "混合动力电池温度传感器G电路范围/性能",
      "en-us": "Hybrid Battery Temperature Sensor G Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路出错，该故障码会出现。"
    }
  ],
  "P0841": [
    {
      "scope": "所有汽车制造商",
      "code": "P0841",
      "zh-cn": "变速器液压力（TFP）传感器/开关A电路范围/性能",
      "en-us": "Transmission Fluid Pressure Sensor/Switch A Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0409": [
    {
      "scope": "所有汽车制造商",
      "code": "P0409",
      "zh-cn": "废气再循环阀传感器A电路",
      "en-us": "Exhaust Gas Recirculation Sensor A Circuit",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环（EGR）传感器的信号电压超出了校准的正常范围，该故障码会出现。"
    }
  ],
  "P048D": [
    {
      "scope": "所有汽车制造商",
      "code": "P048D",
      "zh-cn": "排气压力控制阀门位置传感器/开关电路低",
      "en-us": "Exhaust Pressure Control Valve Position Sensor/Switch Circuit Low",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。如果电子控制单元（ECU）检测到排气压力控制阀门位置传感器信号电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P052E": [
    {
      "scope": "所有汽车制造商",
      "code": "P052E",
      "zh-cn": "曲轴箱强制通风系统调节阀性能",
      "en-us": "Positive Crankcase Ventilation Regulator Valve Performance",
      "sys": "车速及怠速控制",
      "knowledge": "曲轴箱强制通风（PCV）系统的作用是将曲轴箱内的窜气（发动机作功燃烧过程的末端，一些未燃混合气在高压力下从活塞环漏入曲轴箱内，业内将这种泄漏称为窜气）通过发动机工作产生的真空导入进气歧管，然后窜气会随着新鲜的空气一起进入汽缸烧掉，从而降低污染提高发动机效率。"
    }
  ],
  "P0214": [
    {
      "scope": "所有汽车制造商",
      "code": "P0214",
      "zh-cn": "冷车启动喷油器2",
      "en-us": "Cold Start Injector 2",
      "sys": "燃油或空气",
      "knowledge": "汽车启动时，如果电子控制单元（ECU）检测到发动机温度低于某一设定值，冷车启动喷油器（CSI）会在起动机旋转时通过向进气系统喷入汽油的方式来以加浓空燃比，从而使发动机容易启动。P0214表明冷车启动喷油器2发生故障。"
    }
  ],
  "P0AD8": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AD8",
      "zh-cn": "混合动力电池组空气流量阀A控制电路高",
      "en-us": "Hybrid Battery Pack Air Flow Valve A Control Circuit High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0452": [
    {
      "scope": "所有汽车制造商",
      "code": "P0452",
      "zh-cn": "蒸发排放系统压力传感器/开关低",
      "en-us": "Evaporative Emission System Pressure Sensor/Switch Low",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。如果电子控制单元（ECU）探测到蒸发排放控制系统油箱压力传感器到ECU的输入信号低于最低校准值（0.22伏），则该故障码会出现。"
    }
  ],
  "P00A0": [
    {
      "scope": "所有汽车制造商",
      "code": "P00A0",
      "zh-cn": "增压空气冷却器温度传感器电路故障 （第2排）",
      "en-us": "Charge Air Cooler Temperature Sensor Circuit (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。该故障码的原因包括增压空气冷却器温度传感器，其电路，或接头问题。"
    }
  ],
  "P0040": [
    {
      "scope": "所有汽车制造商",
      "code": "P0040",
      "zh-cn": "氧传感器信号被互换（第1排传感器1）/（第2排传感器1）",
      "en-us": "O2 Sensor Signals Swapped (Bank 1, Sensor 1)/(Bank 2, Sensor 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器监测因燃油转变引起的氧传感器信号响应是否对应到正确的氧传感器排（Bank）。该故障码的可能原因包括氧传感器插头弄混，线路弄混等。"
    }
  ],
  "P0731": [
    {
      "scope": "所有汽车制造商",
      "code": "P0731",
      "zh-cn": "1档齿轮比不正确",
      "en-us": "Gear 1 Incorrect Ratio",
      "sys": "变速箱",
      "knowledge": "车辆在1档指令打开的情况下运行，电子控制单元（ECU）检测到1档齿轮比不正确。故障原因包括变速器液液位太低，换档电磁阀，变速器液压传感器，阀体内的电磁阀故障，输入轴速度传感器，输出轴速度传感器，电路，接头，变速器控制模块故障等。"
    }
  ],
  "P069A": [
    {
      "scope": "所有汽车制造商",
      "code": "P069A",
      "zh-cn": "气缸9电热塞控制电路低",
      "en-us": "Cylinder 9 Glow Plug Control Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸9电热塞控制电路电压低于校准的最低值，则该故障码会出现。"
    }
  ],
  "P0C77": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C77",
      "zh-cn": "混合动力电池系统预充电时间太短",
      "en-us": "Hybrid Battery System Precharge Time Too Short",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0908": [
    {
      "scope": "所有汽车制造商",
      "code": "P0908",
      "zh-cn": "门选择位置电路间歇",
      "en-us": "Gate Select Position Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "门选择位置（监控换档杆左/右位置）电路故障。"
    }
  ],
  "P0C71": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C71",
      "zh-cn": "混合动力电池温度传感器D/E相关性",
      "en-us": "Hybrid Battery Temperature Sensor D/E Correlation",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器D/E的信号差超出了校准的最大极限，该故障码会出现。"
    }
  ],
  "P045A": [
    {
      "scope": "所有汽车制造商",
      "code": "P045A",
      "zh-cn": "废气再循环B控制电路",
      "en-us": "Exhaust Gas Recirculation B Control Circuit",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环（EGR）阀控制电路电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P0005": [
    {
      "scope": "所有汽车制造商",
      "code": "P0005",
      "zh-cn": "燃油切断阀A控制电路/开路",
      "en-us": "Fuel Shutoff Valve A Control Circuit/Open",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油切断阀的作用是在汽车发生紧急情况（例如翻车）的时候切断通往发动机的燃油供给。该故障码表明电子控制单元（ECU）检测到燃油切断阀A控制电路电压超出了校准的最大范围。"
    }
  ],
  "P0923": [
    {
      "scope": "所有汽车制造商",
      "code": "P0923",
      "zh-cn": "换档前推执行器 （前推换档杆，奇数齿轮，1,3,5）电路高",
      "en-us": "Gear Shift Forward Actuator Circuit High",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0632": [
    {
      "scope": "所有汽车制造商",
      "code": "P0632",
      "zh-cn": "里程表未编程 - 发动机控制模块（ECM）/动力总成控制模块（PCM）",
      "en-us": "Odometer Not Programmed - ECM/PCM",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P0797": [
    {
      "scope": "所有汽车制造商",
      "code": "P0797",
      "zh-cn": "压力控制电磁阀C开在开的位置",
      "en-us": "Pressure Control Solenoid C Stuck On",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。故障原因包括变速器液液面太低，变速器液太脏，变速器液压力控制电磁阀，电路，接头，或控制模块等。"
    }
  ],
  "P0543": [
    {
      "scope": "所有汽车制造商",
      "code": "P0543",
      "zh-cn": "进气加热器A电路开路",
      "en-us": "Intake Air Heater A Circuit Open",
      "sys": "车速及怠速控制",
      "knowledge": "进气加热器，也叫歧管进气加热器，其作用是给预热空气进气，以帮助柴油机在寒冷天气的情况下易于启动。该故障码表明歧管进气加热器电路（MIAH）电路发生故障。"
    }
  ],
  "P0A65": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A65",
      "zh-cn": "驱动电机A，W相电流高",
      "en-us": "Drive Motor A Phase W Current High",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P06BC": [
    {
      "scope": "所有汽车制造商",
      "code": "P06BC",
      "zh-cn": "气缸4电热塞电路范围/性能",
      "en-us": "Cylinder 4 Glow Plug Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸4电热塞电路发生故障，则该故障码会出现。"
    }
  ],
  "P0848": [
    {
      "scope": "所有汽车制造商",
      "code": "P0848",
      "zh-cn": "变速器液压力（TFP）传感器/开关B电路高",
      "en-us": "Transmission Fluid Pressure Sensor/Switch B Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0C1A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C1A",
      "zh-cn": "驱动电机B输送扭力性能",
      "en-us": "Drive Motor B Torque Delivered Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0AF4": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AF4",
      "zh-cn": "驱动电机换流器温度传感器B电路低",
      "en-us": "Drive Motor Inverter Temperature Sensor B Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0832": [
    {
      "scope": "所有汽车制造商",
      "code": "P0832",
      "zh-cn": "离合器踏板开关A电路高",
      "en-us": "Clutch Pedal Switch A Circuit High",
      "sys": "变速箱",
      "knowledge": "离合器踏板开关的作用是将离合器是否踩下的信息以电信号的形式输送给电子控制单元，作为控制发动机启动和定速巡航系统的重要参数。"
    }
  ],
  "P0985": [
    {
      "scope": "所有汽车制造商",
      "code": "P0985",
      "zh-cn": "换档电磁阀E控制电路低",
      "en-us": "Shift Solenoid E Control Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0512": [
    {
      "scope": "所有汽车制造商",
      "code": "P0512",
      "zh-cn": "起动机请求电路",
      "en-us": "Starter Request Circuit",
      "sys": "车速及怠速控制",
      "knowledge": ""
    }
  ],
  "P0A6F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A6F",
      "zh-cn": "发电机U相电流",
      "en-us": "Generator Phase U Current",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控发电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P080C": [
    {
      "scope": "所有汽车制造商",
      "code": "P080C",
      "zh-cn": "升档/降挡电磁阀控制电路低",
      "en-us": "Upshift/Skip Shift Solenoid Control Circuit Low",
      "sys": "变速箱",
      "knowledge": "对于一些大功率的汽车，为提高汽车的燃油效率和降低排放，当条件满足的时候（低速，小油门，车已预热等），跳档电磁阀会阻止挂入2，3档，相当于强制变速杆从1档直接换到4档。该故障码表明跳档电磁阀控制电路电压低于校准的最低值。"
    }
  ],
  "P0AFA": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AFA",
      "zh-cn": "混合动力电池系统电压低",
      "en-us": "Hybrid Battery System Voltage Low",
      "sys": "混合动力系统",
      "knowledge": "如果混合动力电池组的整体电压低于设定值，或者是每一个电池块的电压低于设定值，该故障码会出现。"
    }
  ],
  "P0204": [
    {
      "scope": "所有汽车制造商",
      "code": "P0204",
      "zh-cn": "喷油器电路/开路 - 第4缸",
      "en-us": "Injector Circuit/Open - Cylinder 4",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器控制电路出错，该故障码会出现。故障原因包括喷油器接口，电路故障，喷油器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0B14": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B14",
      "zh-cn": "混合动力电池组电压监控B电路",
      "en-us": "Hybrid Battery Pack Voltage Sense B Circuit",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P06CD": [
    {
      "scope": "所有汽车制造商",
      "code": "P06CD",
      "zh-cn": "气缸9电热塞不正确",
      "en-us": "Cylinder 9 Glow Plug Incorrect",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。该故障码表明气缸9电热塞，其电路，接头，或电热赛控制模块（GPCM）出错。"
    }
  ],
  "P0274": [
    {
      "scope": "所有汽车制造商",
      "code": "P0274",
      "zh-cn": "第5缸喷油器电路高",
      "en-us": "Cylinder 5 Injector Circuit High",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第5缸喷油器控制电路电压高于校准的最高值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0A60": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A60",
      "zh-cn": "驱动电机A，V相电流",
      "en-us": "Drive Motor A Phase V Current",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0458": [
    {
      "scope": "所有汽车制造商",
      "code": "P0458",
      "zh-cn": "蒸发排放系统吹扫控制阀电路低",
      "en-us": "Evaporative Emission System Purge Control Valve Circuit Low",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。电子控制单元（ECU）检测到蒸发排放系统吹扫控制阀控制电路电压低于校准的最低值。故障原因包括EVAP供电电路故障，EVAP电磁阀控制电路故障，EVAP电磁阀故障，EVAP炭罐泄漏，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0A23": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A23",
      "zh-cn": "发电机扭矩传感器电路范围/性能",
      "en-us": "Generator Torque Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "控制模块检测到发电机转矩传感器信号超出校准的正常范围。"
    }
  ],
  "P0AD6": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AD6",
      "zh-cn": "混合动力电池组空气流量阀A控制电路范围/性能",
      "en-us": "Hybrid Battery Pack Air Flow Valve A Control Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0B6F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B6F",
      "zh-cn": "混合动力电池电压监控K电路低",
      "en-us": "Hybrid Battery Voltage Sense K Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0B90": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B90",
      "zh-cn": "混合动力电池电压监控R电路",
      "en-us": "Hybrid Battery Voltage Sense R Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0801": [
    {
      "scope": "所有汽车制造商",
      "code": "P0801",
      "zh-cn": "倒档抑制控制电路",
      "en-us": "Reverse Inhibit Control Circuit",
      "sys": "变速箱",
      "knowledge": "倒档抑制的作用是当汽车速度高于10km/h时，禁止换档杆移动到R（倒车）档位。该故障码表明倒档抑制电路出错。"
    }
  ],
  "P006B": [
    {
      "scope": "所有汽车制造商",
      "code": "P006B",
      "zh-cn": "歧管绝对压力（MAP）/排气压力相关性",
      "en-us": "MAP - Exhaust Pressure Correlation",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "歧管绝对压力（MAP）传感器的作用是测量进气歧管内的压力（真空度）。动力总成控制模块（PCM）然后会将进气歧管压力与大气压力之间的差值（跟发动机负荷成线性关系）作为确定喷油器基本喷油量的一个依据，以帮助发动机在不同负荷下达到最佳空燃比。排气压力传感器的作用是将排气系统压力以电信号的形式输送给电子控制单元（ECU）。如果电子控制单元发现歧管绝对压力（MAP）传感器和排气压力传感器的信号差在设定时间段里（2.5秒）超出校准值（通常是10.35KPa），该故障码会出现。"
    }
  ],
  "P0708": [
    {
      "scope": "所有汽车制造商",
      "code": "P0708",
      "zh-cn": "变速器档位传感器A电路高 （PRNDL输入）",
      "en-us": "Transmission Range Sensor A Circuit High",
      "sys": "变速箱",
      "knowledge": "变速器挡位传感器负责将变速器杆的位置（PRNDL）以电信号的形式输送给电子控制单元（ECU）。如果ECU检测到变速器档位（TR）传感器电路在超过设定的时间段里电压高于校准最高值，该故障码会出现。故障原因包括变速器挡位（TR）传感器，其电路短路到正极，接头故障，或电子控制模块（PCM或ECM）故障。"
    }
  ],
  "P044A": [
    {
      "scope": "所有汽车制造商",
      "code": "P044A",
      "zh-cn": "废气再循环传感器C电路",
      "en-us": "Exhaust Gas Recirculation Sensor C Circuit",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环（EGR）传感器信号电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P0876": [
    {
      "scope": "所有汽车制造商",
      "code": "P0876",
      "zh-cn": "变速器液压力（TFP）传感器/开关D电路范围/性能",
      "en-us": "Transmission Fluid Pressure Sensor/Switch D Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0013": [
    {
      "scope": "所有汽车制造商",
      "code": "P0013",
      "zh-cn": "B 凸轮轴位置执行器 - 电路开路 （第1排）",
      "en-us": "B  Camshaft Position - Actuator Circuit/Open (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。P0013的故障原因包括B排气/右/后凸轮轴调节阀（机油控制阀），其电路，接头，机油太脏或ECU。"
    }
  ],
  "P07BE": [
    {
      "scope": "所有汽车制造商",
      "code": "P07BE",
      "zh-cn": "变速器驻车档位置传感器/开关A/B的相关性",
      "en-us": "Transmission Park Position Sensor/Switch A/B Correlation",
      "sys": "变速箱",
      "knowledge": "驻车档位置传感器的作用是将变速杆是否在驻车档的位置的信号输送给电子控制单元（ECU）。如果ECU检测到驻车档位置传感器A与B的信号不一致，该故障码会出现。"
    }
  ],
  "P0C4A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C4A",
      "zh-cn": "混合动力电池组冷却液泵控制性能",
      "en-us": "Hybrid Battery Pack Coolant Pump Control Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0B03": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B03",
      "zh-cn": "辅助变速器液泵电机V相电流",
      "en-us": "Auxiliary Transmission Fluid Pump Motor Phase V Current",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0536": [
    {
      "scope": "所有汽车制造商",
      "code": "P0536",
      "zh-cn": "空调蒸发器温度传感器电路范围/性能",
      "en-us": "A/C Evaporator Temperature Sensor Circuit Range/Performance",
      "sys": "车速及怠速控制",
      "knowledge": "空调蒸发器温度传感器的作用是将空调蒸发器内的温度以电信号的形式输送给空调控制模块，以便当空调蒸发器内温度过低的时候，关闭空调压缩机，防止空调蒸发器发生冰冻现象。该故障码表明空调蒸发器温度（ACET）传感器信号电路电压超出校准范围。"
    }
  ],
  "P079F": [
    {
      "scope": "所有汽车制造商",
      "code": "P079F",
      "zh-cn": "变速器摩擦衬片F检测到打滑",
      "en-us": "Transmission Friction Element F Slip Detected",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0434": [
    {
      "scope": "所有汽车制造商",
      "code": "P0434",
      "zh-cn": "热催化转换器温度低于阈值（第2排）",
      "en-us": "Heated Catalyst Temperature Below Threshold (Bank 2)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明预热以后催化转换器温度低于设定的最低极限。故障原因包括催化转换器，氧传感器，以及电路，接头等。"
    }
  ],
  "P001D": [
    {
      "scope": "所有汽车制造商",
      "code": "P001D",
      "zh-cn": "A凸轮轴形面控制电路/开路 （第2排）",
      "en-us": "A Camshaft Profile Control Circuit/Open (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。如果电子控制单元（ECU）检测到A（进气/左/前）凸轮轴形面控制电路电压在一段时间内超出了校准的正常范围，则该故障码会出现。"
    }
  ],
  "P0080": [
    {
      "scope": "所有汽车制造商",
      "code": "P0080",
      "zh-cn": "排气阀门控制电磁阀电路高 （第1排）",
      "en-us": "Exhaust Valve Control Solenoid Circuit High (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。如果排气凸轮轴调节阀电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P041B": [
    {
      "scope": "所有汽车制造商",
      "code": "P041B",
      "zh-cn": "废气再循环阀温度传感器B电路范围/性能",
      "en-us": "Exhaust Gas Recirculation Temperature Sensor B Circuit Range/Performance",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环阀（EGR）温度传感器的信号电压不正确，该故障码会出现。"
    }
  ],
  "P0293": [
    {
      "scope": "所有汽车制造商",
      "code": "P0293",
      "zh-cn": "第11缸贡献/平衡错误",
      "en-us": "Cylinder 11 Contribution/Balance",
      "sys": "燃油或空气",
      "knowledge": "电子控制单元（ECU）检测到第11缸的曲轴加速贡献低于校准值。故障原因包括第11缸喷油系统；或其它影响第11缸的发动机问题。"
    }
  ],
  "P02A7": [
    {
      "scope": "所有汽车制造商",
      "code": "P02A7",
      "zh-cn": "燃油（空燃比）修剪在最低限 - 气缸4",
      "en-us": "Cylinder 4 - Fuel Trim at Min Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最低极限超过一定时间，该故障码会出现。"
    }
  ],
  "P0792": [
    {
      "scope": "所有汽车制造商",
      "code": "P0792",
      "zh-cn": "中间轴转速传感器A电路范围/性能",
      "en-us": "Intermediate Shaft Speed Sensor A Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "变速器的主要部件包括位于中间轴上的行星齿轮系统。它的一端连接输入轴，另外一端连接输出轴。故障原因包括中间轴转速（ISS）传感器，电路，接头，控制模块等。"
    }
  ],
  "P0A9A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A9A",
      "zh-cn": "混合动力电池组冷却风扇2控制电路高",
      "en-us": "Hybrid Battery Pack Cooling Fan 2 Control Circuit High",
      "sys": "混合动力系统",
      "knowledge": "风扇电机控制器负责调节混合动力电池组冷却风扇的电压。如果冷却风扇1控制电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P043B": [
    {
      "scope": "所有汽车制造商",
      "code": "P043B",
      "zh-cn": "催化转换器温度传感器电路范围/性能 （第2排，传感器2）",
      "en-us": "Catalyst Temperature Sensor Circuit Range/Performance (Bank 2, Sensor 2)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器温度传感器电路出错。故障原因包括催化转换器温度传感器，电路，接头，或电子控制单元（ECU）故障。"
    }
  ],
  "P022F": [
    {
      "scope": "所有汽车制造商",
      "code": "P022F",
      "zh-cn": "增压空气冷却器旁通阀控制B电路高",
      "en-us": "Charge Air Cooler Bypass Control B Circuit High",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。增压空气冷却器旁通阀的作用是将一部分空气绕开空气冷却器。这些空气随后再跟经过空气冷却器冷却过的空气混合后进入发动机，以保证进气温度高于露水温度。如果空气冷却器旁通阀控制电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0880": [
    {
      "scope": "所有汽车制造商",
      "code": "P0880",
      "zh-cn": "变速器控制模块（TCU）电源输入信号",
      "en-us": "TCU Power Input Signal",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。"
    }
  ],
  "P007A": [
    {
      "scope": "所有汽车制造商",
      "code": "P007A",
      "zh-cn": "增压空气冷却器温度传感器电路故障（第1排）",
      "en-us": "Charge Air Cooler Temperature Sensor Circuit (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。故障原因包括增压空气温度（CAT）传感器，电路，接头，控制模块等。"
    }
  ],
  "P0525": [
    {
      "scope": "所有汽车制造商",
      "code": "P0525",
      "zh-cn": "定速巡航伺服器控制电路范围/性能",
      "en-us": "Cruise Control Servo Control Circuit Range/Performance",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航伺服器的作用是按照巡航控制模块的指令控制节气门的开度（车速低于设定值，加大节气门开度；车速高于设定值，减小节气门开度），从而实现定速巡航功能。故障原因包括定速巡航伺服器，电路，接头，或定速巡航控制模块等。"
    }
  ],
  "P0193": [
    {
      "scope": "所有汽车制造商",
      "code": "P0193",
      "zh-cn": "燃油分供管压力传感器A电路高",
      "en-us": "Fuel Rail Pressure Sensor A Circuit High",
      "sys": "燃油或空气",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。电子控制单元（ECU）监控燃油分供管压力传感器的参考电压。如果这个电压在设定的时间段内持续高于校准的最高值（4.88伏），则该故障码会出现。"
    }
  ],
  "P0135": [
    {
      "scope": "所有汽车制造商",
      "code": "P0135",
      "zh-cn": "氧传感器加热电路（第1排，传感器 1）",
      "en-us": "O2 Sensor Heater Circuit (Bank 1, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）持续监测加热氧传感器加热器，以确保没有开路，短路，或电流消耗过度的情况。如果电流消耗超过校准的极限，或监测到开路或短路，该故障码就会出现。故障原因包括氧传感器加热器电路，接头故障，氧传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0BB4": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BB4",
      "zh-cn": "混合动力电池电压监控Y电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense Y Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P082D": [
    {
      "scope": "所有汽车制造商",
      "code": "P082D",
      "zh-cn": "换档杆Y位置电路范围/性能",
      "en-us": "Gear Lever Y Position Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0086": [
    {
      "scope": "所有汽车制造商",
      "code": "P0086",
      "zh-cn": "排气阀门控制电磁阀电路高 （第2排）",
      "en-us": "Exhaust Valve Control Solenoid Circuit High (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。如果排气凸轮轴调节阀电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0BEE": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BEE",
      "zh-cn": "驱动电机A，W相电流传感器电路范围/性能",
      "en-us": "Drive Motor A Phase W Current Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P046F": [
    {
      "scope": "所有汽车制造商",
      "code": "P046F",
      "zh-cn": "废气再循环传感器B电路间歇/不稳定",
      "en-us": "Exhaust Gas Recirculation Sensor B Circuit Intermittent/Erratic",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环传感器B信号电压突然变化，该故障码会出现。"
    }
  ],
  "P0402": [
    {
      "scope": "所有汽车制造商",
      "code": "P0402",
      "zh-cn": "废气再循环阀A检测到流量太大",
      "en-us": "Exhaust Gas Recirculation A Flow Excessive Detected",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。在怠速时，如果电子控制单元（ECU）发现在废气再循环（EGR）的流量比钥匙开发动机关（KOER）自检时存储的的值高很多时，该故障码会出现。故障原因包括DPFE传感器电路，接头，或本身故障，DPFE管路故障，EGR阀本身故障或管路阻塞，电子控制模块等。"
    }
  ],
  "P0A93": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A93",
      "zh-cn": "换流器冷却系统性能",
      "en-us": "Inverter A Cooling System Performance",
      "sys": "混合动力系统",
      "knowledge": "换流器将混合动力电池组的直流电转换成可供MG1和MG2使用的交流电。在这个过程中，换流器会放热，因而换流器有自己的冷却系统。如果这个冷却系统发生故障，该故障码会出现。"
    }
  ],
  "P076D": [
    {
      "scope": "所有汽车制造商",
      "code": "P076D",
      "zh-cn": "换档电磁阀H电子问题",
      "en-us": "Shift Solenoid H Electrical",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0A55": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A55",
      "zh-cn": "驱动电机B电流传感器电路",
      "en-us": "Drive Motor B Current Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）内部故障。"
    }
  ],
  "P0412": [
    {
      "scope": "所有汽车制造商",
      "code": "P0412",
      "zh-cn": "二次空气喷射系统切换阀A电路",
      "en-us": "Secondary Air Injection System Switching Valve A Circuit",
      "sys": "排放控制",
      "knowledge": "在发动机刚刚启动时，二次空气喷射系统通过往排气歧管强制输入空气来氧化产生的碳氢化合物，一氧化碳等有害气体。这个过程也同时加速了催化转换器的暖化过程。如果电子控制单元（ECU）检测到二次空气喷射系统控制电磁阀电路有开路或短路的情况，该故障码会出现。故障原因包括二次空气喷射执行器电路开路或短路到接地，二次空气喷射泵电路开路或短路到接地，切换阀故障或泄漏，继电器故障，或电子控制模块（PCM或ECM）故障。"
    }
  ],
  "P0629": [
    {
      "scope": "所有汽车制造商",
      "code": "P0629",
      "zh-cn": "燃油泵A控制电路高",
      "en-us": "Fuel Pump A Control Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "燃油泵的作用是把燃油从燃油箱中吸出、加压后输送到供油管中，和燃油压力调节器配合建立一定的燃油压力。如果电子控制单元（ECU）检测到燃油泵控制电路电压高于校准的最高值，该故障码会出现。故障原因包括燃油压力调节器阀故障，燃油压力传感器故障，燃油泵控制模块故障，燃油泵故障等。"
    }
  ],
  "P075E": [
    {
      "scope": "所有汽车制造商",
      "code": "P075E",
      "zh-cn": "换档电磁阀G间歇",
      "en-us": "Shift Solenoid G Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P02E4": [
    {
      "scope": "所有汽车制造商",
      "code": "P02E4",
      "zh-cn": "柴油机进气流量控制电磁阀卡在开启位置",
      "en-us": "Diesel Intake Air Flow Control Stuck Open",
      "sys": "燃油或空气",
      "knowledge": "柴油机进气流量控制系统通过对节气门开启角度的自动控制并与切向气道或螺旋气道的配合使用来形成有效的进气涡流，同时对进气涡流的强度进行自动控制，有效地改善了发动机的燃烧，从而优化了发动机动力性，经济性等性能指标。"
    }
  ],
  "P0C36": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C36",
      "zh-cn": "混合动力电池温度传感器F电路高",
      "en-us": "Hybrid Battery Temperature Sensor F Circuit High",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0158": [
    {
      "scope": "所有汽车制造商",
      "code": "P0158",
      "zh-cn": "氧传感器电路高电压（第2排，传感器 2）",
      "en-us": "O2 Sensor Circuit High Voltage (Bank 2, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。当加热氧传感器信号的电压在设定的时间段内持续高于1.5伏时，该故障码就会出现。故障原因包括氧传感器信号电路短路到正极，氧传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P014D": [
    {
      "scope": "所有汽车制造商",
      "code": "P014D",
      "zh-cn": "氧传感器反应太慢 - （空燃比）稀到浓（第1排，传感器 1）",
      "en-us": "O2 Sensor Slow Response - Lean to Rich (Bank 1, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。如果电子控制单元（ECU）发现在空燃比由稀变浓的过程中，没有监测到可以接受的电压变化速率的话，该故障码就会出现。"
    }
  ],
  "P06C1": [
    {
      "scope": "所有汽车制造商",
      "code": "P06C1",
      "zh-cn": "气缸9电热塞电路范围/性能",
      "en-us": "Cylinder 9 Glow Plug Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸9电热塞电路发生故障，则该故障码会出现。"
    }
  ],
  "P0B34": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B34",
      "zh-cn": "高压服务断开电路性能",
      "en-us": "High Voltage Service Disconnect Circuit Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0617": [
    {
      "scope": "所有汽车制造商",
      "code": "P0617",
      "zh-cn": "起动机继电器电路高",
      "en-us": "Starter Relay Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "起动机继电器（电磁阀）的工作原理是，当点火开关打开时，小电流经过一个电磁线圈，导致一对更大的接触器结合，从而允许大电流经过动电机，而启动发动机。该故障码表明起动机继电器电路电压高于校准的最高值。故障原因包括起动机，其电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P02B5": [
    {
      "scope": "所有汽车制造商",
      "code": "P02B5",
      "zh-cn": "喷油器泄漏 - 气缸7",
      "en-us": "Cylinder 7 - Injector Leaking",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第7缸喷油器发生泄漏。"
    }
  ],
  "P0AE7": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AE7",
      "zh-cn": "混合动力电池预充电接触器控制电路高",
      "en-us": "Hybrid Battery Precharge Contactor Control Circuit High",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果混合动力汽车电子控制单元如果发现第1系统主继电器（SMR1）发生故障，该故障码会出现。"
    }
  ],
  "P044D": [
    {
      "scope": "所有汽车制造商",
      "code": "P044D",
      "zh-cn": "废气再循环传感器C电路高",
      "en-us": "Exhaust Gas Recirculation Sensor C Circuit High",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环（EGR）传感器信号电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P076F": [
    {
      "scope": "所有汽车制造商",
      "code": "P076F",
      "zh-cn": "7档齿轮比不正确",
      "en-us": "Gear 7 Incorrect Ratio",
      "sys": "变速箱",
      "knowledge": "车辆在7档指令打开的情况下运行，电子控制单元（ECU）检测到7档齿轮比不正确。"
    }
  ],
  "P073D": [
    {
      "scope": "所有汽车制造商",
      "code": "P073D",
      "zh-cn": "不能挂空档",
      "en-us": "Unable to Engage Neutral",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P000D": [
    {
      "scope": "所有汽车制造商",
      "code": "P000D",
      "zh-cn": "B凸轮轴位置执行器反应太慢 （第2排）",
      "en-us": "B Camshaft Position Slow Response (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。P000D的故障原因包括排气/右/后凸轮轴调节阀（机油控制阀），其电路，接头，机油太脏或ECU。"
    }
  ],
  "P0AD0": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AD0",
      "zh-cn": "混合动力电池组冷却风扇3性能或卡在关闭位置",
      "en-us": "Hybrid Battery Pack Cooling Fan 3 Performance/Stuck Off",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块根据来自电池温度传感器的信号来控制电池风扇的开启或关闭。如果实际电池组温度比基于冷却风扇性能估计的电池组温度高出一设定值，控制模块认为电池组风扇故障或卡在关的位置。"
    }
  ],
  "P0285": [
    {
      "scope": "所有汽车制造商",
      "code": "P0285",
      "zh-cn": "第9缸喷油器电路低",
      "en-us": "Cylinder 9 Injector Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第9缸喷油器控制电路电压低于校准的最低值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0BB0": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BB0",
      "zh-cn": "混合动力电池电压监控X电路低",
      "en-us": "Hybrid Battery Voltage Sense X Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P003E": [
    {
      "scope": "所有汽车制造商",
      "code": "P003E",
      "zh-cn": "A凸轮轴形面控制性能或卡在关闭位置 （第2排）",
      "en-us": "A Camshaft Profile Control Performance/Stuck Off (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。该故障码表明A（进气/左/前）凸轮轴形面控制发生故障或卡在关闭位置 。"
    }
  ],
  "P07A7": [
    {
      "scope": "所有汽车制造商",
      "code": "P07A7",
      "zh-cn": "变速器摩擦衬片C卡在开的位置",
      "en-us": "Transmission Friction Element C Stuck On",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0230": [
    {
      "scope": "所有汽车制造商",
      "code": "P0230",
      "zh-cn": "燃油泵主电路",
      "en-us": "Fuel Pump Primary Circuit",
      "sys": "燃油或空气",
      "knowledge": "燃油泵电路分为主电路和二级电路。主电路负责控制燃油泵，燃油泵继电器利用来自电子控制单元（ECU）的低电流控制电磁线圈，从而接通燃油泵高电流。二级电路指的是燃油泵监控器（FPM）电路，负责监控燃油泵的电路反馈。故障原因包括包括燃油泵（FP）或燃油切断阀（FSV）电路开路或短路，燃油泵继电器电路故障，燃油泵继电器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0588": [
    {
      "scope": "所有汽车制造商",
      "code": "P0588",
      "zh-cn": "定速巡航系统通风控制电路高",
      "en-us": "Cruise Control Vent Control Circuit High",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统通过控制伺服器内的真空来控制节气门角度，从而控制车速。当需要加速时，真空电磁阀开启，与进气歧管（或专门的真空泵）相通，密封套内真空度增大，吸动膜片，克服弹簧力，通过拉线使节气门开度增大，车辆加速行驶。当达到设定车速时，真空电磁阀与通风电磁阀同时关闭，此时密封套内的真空度不变，汽车保持恒速行驶。当需要减速时，通风电磁阀打开，让空气进入密封套，膜片弹簧把膜片压回原位，节气门开度减小，于是汽车减速。P0586表明定速巡航系统通风控制电路电压高于校准的最高值。故障原因包括定速巡航系统通风口电磁阀，电路，接头等。"
    }
  ],
  "P0549": [
    {
      "scope": "所有汽车制造商",
      "code": "P0549",
      "zh-cn": "排气温度传感器电路高（第2排，传感器1）",
      "en-us": "Exhaust Gas Temperature Sensor Circuit High (Bank 2, Sensor 1)",
      "sys": "车速及怠速控制",
      "knowledge": "排气温度传感器的作用是将排气温度以电信号的形式输送给电子控制单元（ECU）。正确的空燃比产生的排气温度比过浓或过稀空燃比产生的排气温度要低。过高排气温度（>160摄氏度）会对发动机造成破坏。如果电子控制单元（ECU）检测到排气温度传感器信号电压在设定的时间段（15秒）内高于4.75伏（也可能是2.5伏），该故障码会出现。"
    }
  ],
  "P024A": [
    {
      "scope": "所有汽车制造商",
      "code": "P024A",
      "zh-cn": "增压空气冷却器旁通阀控制A范围/性能",
      "en-us": "Charge Air Cooler Bypass Control A Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。增压空气冷却器旁通阀的作用是将一部分空气绕开空气冷却器。这些空气随后再跟经过空气冷却器冷却过的空气混合后进入发动机，以保证进气温度高于露水温度。如果空气冷却器旁通阀控制A发生故障，该故障码会出现。"
    }
  ],
  "P0BC0": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BC0",
      "zh-cn": "混合动力电池组冷却风扇供电电压电路低",
      "en-us": "Hybrid Battery Pack Cooling Fan Supply Voltage Circuit Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P06B7": [
    {
      "scope": "所有汽车制造商",
      "code": "P06B7",
      "zh-cn": "内部控制模块爆震传感器处理器2性能",
      "en-us": "Internal Control Module Knock Sensor Processor 2 Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "动力总成控制模块（PCM）利用爆震传感器探测发动机转速改变时的震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。该故障码表明内部控制模块发生故障。"
    }
  ],
  "P0ABC": [
    {
      "scope": "所有汽车制造商",
      "code": "P0ABC",
      "zh-cn": "混合动力电池组电压监控A电路低",
      "en-us": "Hybrid Battery Pack Voltage Sense A Circuit Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0805": [
    {
      "scope": "所有汽车制造商",
      "code": "P0805",
      "zh-cn": "离合器位置传感器电路",
      "en-us": "Clutch Position Sensor Circuit",
      "sys": "变速箱",
      "knowledge": "离合器位置传感器的作用是将离合器是否踩下的信息以电信号的形式输送给电子控制单元，作为控制发动机启动和定速巡航系统的重要参数。"
    }
  ],
  "P072A": [
    {
      "scope": "所有汽车制造商",
      "code": "P072A",
      "zh-cn": "卡在空档",
      "en-us": "Stuck in Neutral",
      "sys": "变速箱",
      "knowledge": "车辆行驶中，电子控制单元（ECU）检测到换档电磁阀故障卡在开的位置。变速器卡在空档。故障原因包括换档电磁阀，输入轴速度传感器，输出轴速度传感器，电路，接头等。"
    }
  ],
  "P0A9E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A9E",
      "zh-cn": "混合动力电池温度传感器A电路高",
      "en-us": "Hybrid Battery Temperature Sensor A Circuit High",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P023D": [
    {
      "scope": "所有汽车制造商",
      "code": "P023D",
      "zh-cn": "歧管绝对压力（传感器） - 涡轮/超级增压器增压压力传感器A相关性",
      "en-us": "Manifold Absolute Pressure - Turbocharger/Supercharger Boost Sensor A Correlation",
      "sys": "燃油或空气",
      "knowledge": "歧管绝对压力（MAP）传感器的作用是测量进气歧管内的压力（真空度）。动力总成控制模块（PCM）然后会将进气歧管压力与大气压力之间的差值（跟发动机负荷成线性关系）作为确定喷油器基本喷油量的一个依据，以帮助发动机在不同负荷下达到最佳空燃比。涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压传感器，也叫增压压力传感器（BPS），其作用是将增压压力以电信号的形式传输给电子控制单元（ECU）。如果电子控制单元（ECU）发现歧管绝对压力（MAP）传感器跟涡轮/超级增压器进口压力的信号差在设定时间段里（2.5秒）超出校准值（通常是10.35KPa），该故障码会出现。"
    }
  ],
  "P008C": [
    {
      "scope": "所有汽车制造商",
      "code": "P008C",
      "zh-cn": "燃油冷却器泵控制电路/开路",
      "en-us": "Fuel Cooler Pump Control Circuit/Open",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油冷却器的作用是降低燃油温度从而提高低硫柴油的粘度。如果燃油冷却器泵控制电路出错，该故障码会出现。"
    }
  ],
  "P02C3": [
    {
      "scope": "所有汽车制造商",
      "code": "P02C3",
      "zh-cn": "燃油（空燃比）修剪在最低限 - 气缸11",
      "en-us": "Cylinder 11 - Fuel Trim at Min Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最低极限超过一定时间，该故障码会出现。"
    }
  ],
  "P0986": [
    {
      "scope": "所有汽车制造商",
      "code": "P0986",
      "zh-cn": "换档电磁阀E控制电路高",
      "en-us": "Shift Solenoid E Control Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0AAC": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AAC",
      "zh-cn": "混合动力电池组空气温度传感器A电路",
      "en-us": "Hybrid Battery Pack Air Temperature Sensor A Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车的进气温度（IAT）传感器位于电池总成之内。该故障码的故障原因包括混合动力电池（进气温度（IAT）传感器），电池组控制模块等。"
    }
  ],
  "P0790": [
    {
      "scope": "所有汽车制造商",
      "code": "P0790",
      "zh-cn": "正常/高性能开关电路",
      "en-us": "Normal/Performance Switch Circuit",
      "sys": "变速箱",
      "knowledge": "变速器模式开关的作用是根据用户选择的模式（运动/经济/冬季等）来指令变速器提前或延后换档，或高挡起步等。该故障码表明变速器模式选择开关电路故障。"
    }
  ],
  "P0754": [
    {
      "scope": "所有汽车制造商",
      "code": "P0754",
      "zh-cn": "换档电磁阀A间歇",
      "en-us": "Shift Solenoid A Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0C10": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C10",
      "zh-cn": "驱动电机B换流器电源供应 - 电路高",
      "en-us": "Drive Motor B Inverter Power Supply Circuit High",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P048C": [
    {
      "scope": "所有汽车制造商",
      "code": "P048C",
      "zh-cn": "排气压力控制阀门位置传感器/开关电路范围/性能",
      "en-us": "Exhaust Pressure Control Valve Position Sensor/Switch Circuit Range/Performance",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。如果电子控制单元（ECU）检测到排气压力控制阀门位置传感器信号电压出错，该故障码会出现。"
    }
  ],
  "P0BF6": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BF6",
      "zh-cn": "驱动电机B，V相电流传感器电路范围/性能",
      "en-us": "Drive Motor B Phase V Current Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0BFF": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BFF",
      "zh-cn": "驱动电机A电流",
      "en-us": "Drive Motor A Current",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0B74": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B74",
      "zh-cn": "混合动力电池电压监控L电路低",
      "en-us": "Hybrid Battery Voltage Sense L Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0470": [
    {
      "scope": "所有汽车制造商",
      "code": "P0470",
      "zh-cn": "排气压力传感器A电路",
      "en-us": "Exhaust Pressure Sensor A Circuit",
      "sys": "排放控制",
      "knowledge": "排气压力传感器的作用是将排气系统压力以电信号的形式输送给电子控制单元（ECU）。如果ECU检测到排气压力传感器A电路电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P02E0": [
    {
      "scope": "所有汽车制造商",
      "code": "P02E0",
      "zh-cn": "柴油机进气流量控制电路/开路",
      "en-us": "Diesel Intake Air Flow Control Circuit/Open",
      "sys": "燃油或空气",
      "knowledge": "柴油机进气流量控制系统通过对节气门开启角度的自动控制并与切向气道或螺旋气道的配合使用来形成有效的进气涡流，同时对进气涡流的强度进行自动控制，有效地改善了发动机的燃烧，从而优化了发动机动力性，经济性等性能指标。"
    }
  ],
  "P02E9": [
    {
      "scope": "所有汽车制造商",
      "code": "P02E9",
      "zh-cn": "柴油机进气流量位置传感器电路高",
      "en-us": "Diesel Intake Air Flow Position Sensor Circuit High",
      "sys": "燃油或空气",
      "knowledge": "柴油机进气流量控制系统通过对节气门开启角度的自动控制并与切向气道或螺旋气道的配合使用来形成有效的进气涡流，同时对进气涡流的强度进行自动控制，有效地改善了发动机的燃烧，从而优化了发动机动力性，经济性等性能指标。P02E9的故障原因包括进气翻门控制执行器位置传感器，其电路，接头，或控制模块（ECM）。"
    }
  ],
  "P0004": [
    {
      "scope": "所有汽车制造商",
      "code": "P0004",
      "zh-cn": "燃油量调节器控制电路高",
      "en-us": "Fuel Volume Regulator Control Circuit High",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "（在喷油嘴被广泛使用的新型汽车中，燃油量调节器已经很少被使用）"
    }
  ],
  "P061B": [
    {
      "scope": "所有汽车制造商",
      "code": "P061B",
      "zh-cn": "内部控制模块-扭矩计算性能",
      "en-us": "Internal Control Module Torque Calculation Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P0594": [
    {
      "scope": "所有汽车制造商",
      "code": "P0594",
      "zh-cn": "定速巡航系统伺服控制电路/开路",
      "en-us": "Cruise Control Servo Control Circuit/Open",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航伺服器的作用是按照巡航控制模块的指令控制节气门的开度（车速低于设定值，加大节气门开度；车速高于设定值，减小节气门开度），从而实现定速巡航功能。该故障码表明定速巡航系统伺服控制电路出错。故障原因包括伺服控制电磁阀，电路，接头等。"
    }
  ],
  "P0719": [
    {
      "scope": "所有汽车制造商",
      "code": "P0719",
      "zh-cn": "刹车开关B电路低",
      "en-us": "Brake Switch B Circuit Low",
      "sys": "变速箱",
      "knowledge": "刹车开关的作用是将刹车踏板踩下与否的信息以电信号的形式传送给电子控制单元（ECU），作为停止定速巡航和分离液力变矩器的重要依据。"
    }
  ],
  "P02D3": [
    {
      "scope": "所有汽车制造商",
      "code": "P02D3",
      "zh-cn": "喷油器补偿学习在最高限气缸4",
      "en-us": "Cylinder 4 Fuel Injector Offset Learning At Max Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第4缸喷油器补偿学习已经达到了最高学习极限，该故障码会出现。"
    }
  ],
  "P0577": [
    {
      "scope": "所有汽车制造商",
      "code": "P0577",
      "zh-cn": "定速巡航系统输入电路高",
      "en-us": "Cruise Control Input Circuit High",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。"
    }
  ],
  "P0C2B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C2B",
      "zh-cn": "辅助变速器液泵控制模块回馈信号",
      "en-us": "Auxiliary Transmission Fluid Pump Control Module Feedback Signal",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0BC1": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BC1",
      "zh-cn": "混合动力电池组冷却风扇供电电压电路高",
      "en-us": "Hybrid Battery Pack Cooling Fan Supply Voltage Circuit High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0499": [
    {
      "scope": "所有汽车制造商",
      "code": "P0499",
      "zh-cn": "蒸发排放系统通风阀门控制电路高",
      "en-us": "Evaporative Emission System Vent Valve Control Circuit High",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。电子控制单元（ECU）检测到蒸发排放（EVAP）系统通风阀门控制电路电压高于校准的最高值。"
    }
  ],
  "P0387": [
    {
      "scope": "所有汽车制造商",
      "code": "P0387",
      "zh-cn": "曲轴位置（CKP）传感器B电路低 （第1排）",
      "en-us": "Crankshaft Position Sensor B Circuit Low",
      "sys": "点火系统",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。曲轴位置（CKP）传感器(也叫上止点传感器），其作用是检测上止点（TDC）信号、曲轴转角信号和发动机转速信号，并将其输入计算机，从而使计算机能按气缸的点火顺序发出最佳点火时刻指令。如果电子控制单元（ECU）检测到曲轴传感器B电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0904": [
    {
      "scope": "所有汽车制造商",
      "code": "P0904",
      "zh-cn": "门选择位置电路",
      "en-us": "Gate Select Position Circuit",
      "sys": "变速箱",
      "knowledge": "门选择位置（监控换档杆左/右位置）电路故障。"
    }
  ],
  "P046D": [
    {
      "scope": "所有汽车制造商",
      "code": "P046D",
      "zh-cn": "废气再循环传感器A电路间歇/不稳定",
      "en-us": "Exhaust Gas Recirculation Sensor A Circuit Intermittent/Erratic",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环传感器A信号电压突然变化，该故障码会出现。"
    }
  ],
  "P0A14": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A14",
      "zh-cn": "发动机悬架（支架胶垫）控制电路/开路",
      "en-us": "Engine Mount A Control Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": "汽车电控悬架可以根据行驶的需要对悬架硬度、阻尼、和车身高度进行调节，提高车辆的形式平稳性和操控性。如果控制模块检测到悬架系统的控制电路有开路情况，该故障码会出现。"
    }
  ],
  "P0248": [
    {
      "scope": "所有汽车制造商",
      "code": "P0248",
      "zh-cn": "涡轮/超级增压器废气门电磁阀B范围/性能",
      "en-us": "Turbocharger/Supercharger Wastegate Solenoid B Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。废气门电磁阀的作用是通过控制进入涡轮的尾气流量（将其余尾气绕开），来调整涡轮转速，从而调整最大增压压力。如果电子控制单元（ECU）检测到废气门电磁阀B发生故障，该故障码会出现。"
    }
  ],
  "P0907": [
    {
      "scope": "所有汽车制造商",
      "code": "P0907",
      "zh-cn": "门选择位置电路高",
      "en-us": "Gate Select Position Circuit High",
      "sys": "变速箱",
      "knowledge": "门选择位置（监控换档杆左/右位置）电路故障。"
    }
  ],
  "P0B98": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B98",
      "zh-cn": "混合动力电池电压监控S电路高",
      "en-us": "Hybrid Battery Voltage Sense S Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0A10": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A10",
      "zh-cn": "直流/直流转换器状态电路高",
      "en-us": "DC/DC Converter Status Circuit High",
      "sys": "混合动力系统",
      "knowledge": "直流/直流转换器将HV电池的直流高压（200-400伏特）转化成12伏特电压，从而可以给辅助电池充电并给车内附件供电。"
    }
  ],
  "P0C82": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C82",
      "zh-cn": "混合动力电池温度传感器H电路范围/性能",
      "en-us": "Hybrid Battery Temperature Sensor H Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路出错，该故障码会出现。"
    }
  ],
  "P0C49": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C49",
      "zh-cn": "混合动力电池组冷却液泵控制电路高",
      "en-us": "Hybrid Battery Pack Coolant Pump Control Circuit High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0B5F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B5F",
      "zh-cn": "混合动力电池电压监控H电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense H Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P051E": [
    {
      "scope": "所有汽车制造商",
      "code": "P051E",
      "zh-cn": "曲轴箱压力传感器电路间歇",
      "en-us": "Crankcase Pressure Sensor Circuit Intermittent/Erratic",
      "sys": "车速及怠速控制",
      "knowledge": "曲轴箱压力传感器的作用是将曲轴箱内的压力以电信号的形式输送给电子控制单元（ECU），以检测曲轴箱强制通风系统的工作状态。如果ECU检测到曲轴箱压力传感器信号电路电压突然变化，该故障码会出现。"
    }
  ],
  "P0111": [
    {
      "scope": "所有汽车制造商",
      "code": "P0111",
      "zh-cn": "进气温度（IAT）传感器1电路范围/性能 （第1排）",
      "en-us": "Intake Air Temperature Sensor 1 Circuit Range/Performance (Bank 1)",
      "sys": "燃油或空气",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。电子控制单元（ECU）在发动机关闭一定时间（通常为6小时）后，会通过比较进气温度（IAT）传感器跟发动机冷却液温度（ECT）传感器的读数来判定进气温度（IAT）传感器的合理性。如果发动机在下次启动时进气温度（IAT）传感器的读数跟发动机冷却液温度（ECT）传感器读数的差别超过了设定校准的值（通常17℃），则该故障码会出现。故障原因包括IAT传感器电路，接头或本身故障；电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0B28": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B28",
      "zh-cn": "混合动力电池B电压不稳定",
      "en-us": "Hybrid Battery B Voltage Unstable",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P062C": [
    {
      "scope": "所有汽车制造商",
      "code": "P062C",
      "zh-cn": "内部控制模块-车速性能",
      "en-us": "Internal Control Module Vehicle Speed Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P0066": [
    {
      "scope": "所有汽车制造商",
      "code": "P0066",
      "zh-cn": "空气辅助喷油器控制电路低",
      "en-us": "Air Assisted Injector Control Circuit or Circuit Low",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "空气辅助喷油器通过将高压空气导入燃油喷射通道的方式来使喷出的汽油雾更加精细，从而优化汽油燃烧。如果电子控制单元（ECU）检测到空气辅助喷油器控制电路电压低于校准的最低值，该故障码会出现。故障原因包括空气辅助喷油器电磁阀本身或其电路故障，氧传感器故障，或动力总成控制模块（PCM）故障等。"
    }
  ],
  "P0A01": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A01",
      "zh-cn": "电机电子系统冷却液温度传感器电路范围/性能",
      "en-us": "Motor Electronics Coolant Temperature Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "电机电子系统冷却系统（MECS）是一套独立的为变速箱（例如eCVT）电机，控制模块以及直流/直流转换器提供冷却的系统。它拥有自己的散热器，冷却液泵，冷却液温度传感器等。电机电子系统冷却液温度（MECT）传感器运用热敏电阻的原理将电机电子系统冷却液的温度以电子形式输送给电子控制单元（ECU）。如果控制模块检测到电机电子系统冷却液温度（MECT）传感器信号出错，该故障码会出现。"
    }
  ],
  "P0538": [
    {
      "scope": "所有汽车制造商",
      "code": "P0538",
      "zh-cn": "空调蒸发器温度传感器电路高",
      "en-us": "A/C Evaporator Temperature Sensor Circuit High",
      "sys": "车速及怠速控制",
      "knowledge": "空调蒸发器温度传感器的作用是将空调蒸发器内的温度以电信号的形式输送给空调控制模块，以便当空调蒸发器内温度过低的时候，关闭空调压缩机，防止空调蒸发器发生冰冻现象。如果电子控制单元（ECU）检测到空调蒸发器温度传感器信号电压高于校准的最低值（4.5伏），该故障码会出现。故障原因包括空调蒸发器温度传感器故障，电路短路到正极，接头短路，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0BBB": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BBB",
      "zh-cn": "混合动力电池电压监控Z电路高",
      "en-us": "Hybrid Battery Voltage Sense Z Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0227": [
    {
      "scope": "所有汽车制造商",
      "code": "P0227",
      "zh-cn": "节气门/踏板位置传感器/开关C电路低",
      "en-us": "Throttle/Pedal Position Sensor/Switch C Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。该故障码表明节气门踏板位置传感器C电路电压在设定的时间段内持续低于校准的最低值（0.2伏）。"
    }
  ],
  "P0C7C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C7C",
      "zh-cn": "混合动力电池温度传感器G电路",
      "en-us": "Hybrid Battery Temperature Sensor G Circuit",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压超出正常范围，该故障码会出现。"
    }
  ],
  "P0077": [
    {
      "scope": "所有汽车制造商",
      "code": "P0077",
      "zh-cn": "进气阀门控制电磁阀电路高 （第1排）",
      "en-us": "Intake Valve Control Solenoid Circuit High (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。如果进气凸轮轴调节阀电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0365": [
    {
      "scope": "所有汽车制造商",
      "code": "P0365",
      "zh-cn": "凸轮轴位置（CMP）传感器B电路 （第1排）",
      "en-us": "Camshaft Position Sensor B Circuit (Bank 1)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。如果电子控制单元（ECU）在设定的时间段内发现未能检测到B（排气/右/后）凸轮轴位置（CMP）传感器信号时，该故障码会出现。"
    }
  ],
  "P0905": [
    {
      "scope": "所有汽车制造商",
      "code": "P0905",
      "zh-cn": "门选择位置电路范围/性能",
      "en-us": "Gate Select Position Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "门选择位置（监控换档杆左/右位置）电路故障。"
    }
  ],
  "P0228": [
    {
      "scope": "所有汽车制造商",
      "code": "P0228",
      "zh-cn": "节气门/踏板位置传感器/开关C电路高",
      "en-us": "Throttle/Pedal Position Sensor/Switch C Circuit High",
      "sys": "燃油或空气",
      "knowledge": "在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。该故障码表明节气门踏板位置传感器C电路电压在设定的时间段内持续高于校准的最高值（4.8伏）。"
    }
  ],
  "P0C81": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C81",
      "zh-cn": "混合动力电池温度传感器H电路",
      "en-us": "Hybrid Battery Temperature Sensor H Circuit",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压超出正常范围，该故障码会出现。"
    }
  ],
  "P06A5": [
    {
      "scope": "所有汽车制造商",
      "code": "P06A5",
      "zh-cn": "传感器参考电压D电路高",
      "en-us": "Sensor Reference Voltage D Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到5伏参考电压电路D出错。故障原因包括5伏参考电压电路到某个传感器的电路发生短路或短路，一个或多个传感器发生短路或开路，ECU等。"
    }
  ],
  "P04A3": [
    {
      "scope": "所有汽车制造商",
      "code": "P04A3",
      "zh-cn": "排气压力控制阀门B间歇",
      "en-us": "Exhaust Pressure Control Valve  B Intermittent",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。电子控制单元（ECU）检测到排气压力控制阀A电路电压突然变化。故障原因包括排气翻板阀或其电路。"
    }
  ],
  "P0B81": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B81",
      "zh-cn": "混合动力电池电压监控O电路",
      "en-us": "Hybrid Battery Voltage Sense O Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P02F2": [
    {
      "scope": "所有汽车制造商",
      "code": "P02F2",
      "zh-cn": "喷油器电路范围/性能 - 气缸5",
      "en-us": "Cylinder 5 Injector Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第5缸喷油器电路出错，该故障码会出现。"
    }
  ],
  "P0B8B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B8B",
      "zh-cn": "混合动力电池电压监控Q电路",
      "en-us": "Hybrid Battery Voltage Sense Q Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0ABE": [
    {
      "scope": "所有汽车制造商",
      "code": "P0ABE",
      "zh-cn": "混合动力电池组电压监控A电路间歇/不稳定",
      "en-us": "Hybrid Battery Pack Voltage Sense A Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P00BF": [
    {
      "scope": "所有汽车制造商",
      "code": "P00BF",
      "zh-cn": "空气流量（MAF）传感器B 电路范围/性能 - 空气流量太高",
      "en-us": "Mass or Volume Air Flow B Circuit Range/Performance - Air Flow Too High",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。该故障码表明由于空气流量（MAF）传感器B电路故障而导致空气流量过高。"
    }
  ],
  "P064D": [
    {
      "scope": "所有汽车制造商",
      "code": "P064D",
      "zh-cn": "内部控制模块氧传感器处理器性能（第1排）",
      "en-us": "Internal Control Module O2 Sensor Processor Performance (Bank 1)",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）会监控氧传感器的集成电路。如果ECU发现内部电路或通讯问题，该故障码会出现。故障原因是电子控制单元（ECU）。"
    }
  ],
  "P0B2A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B2A",
      "zh-cn": "混合动力电池B电压高",
      "en-us": "Hybrid Battery B Voltage High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0C5F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C5F",
      "zh-cn": "驱动电机B位置传感器电路B",
      "en-us": "Drive Motor B Position Sensor Circuit B",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P077A": [
    {
      "scope": "所有汽车制造商",
      "code": "P077A",
      "zh-cn": "输出速度传感器电路 - 方向信号丢失",
      "en-us": "Output Speed Sensor Circuit - Loss of Direction Signal",
      "sys": "变速箱",
      "knowledge": "输出速度传感器（OSS）的任务是将变速器输出轴的速度信号传送给电子控制单元（ECU）。"
    }
  ],
  "P0ACC": [
    {
      "scope": "所有汽车制造商",
      "code": "P0ACC",
      "zh-cn": "混合动力电池温度传感器C电路低",
      "en-us": "Hybrid Battery Temperature Sensor C Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0216": [
    {
      "scope": "所有汽车制造商",
      "code": "P0216",
      "zh-cn": "喷油器/喷射正时控制电路",
      "en-us": "Injector/Injection Timing Control Circuit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器正时控制电路出错，该故障码会出现。"
    }
  ],
  "P0999": [
    {
      "scope": "所有汽车制造商",
      "code": "P0999",
      "zh-cn": "换档电磁阀F控制电路高",
      "en-us": "Shift Solenoid F Control Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P006C": [
    {
      "scope": "所有汽车制造商",
      "code": "P006C",
      "zh-cn": "歧管绝对压力（MAP） - 涡轮/超级增压器进口压力相关性",
      "en-us": "MAP - Turbocharger/Supercharger Inlet Pressure Correlation",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "歧管绝对压力（MAP）传感器的作用是测量进气歧管内的压力（真空度）。动力总成控制模块（PCM）然后会将进气歧管压力与大气压力之间的差值（跟发动机负荷成线性关系）作为确定喷油器基本喷油量的一个依据，以帮助发动机在不同负荷下达到最佳空燃比。如果电子控制单元（ECU）发现歧管绝对压力（MAP）传感器跟涡轮/超级增压器进口压力传感器（节气门阀下游）的信号差在设定时间段里（2.5秒）超出校准值（通常是10.35KPa），该故障码会出现。"
    }
  ],
  "P0681": [
    {
      "scope": "所有汽车制造商",
      "code": "P0681",
      "zh-cn": "电热塞电路/开路 - 气缸11",
      "en-us": "Cylinder 11 Glow Plug Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸11电热塞电路发生故障，该故障码会出现。"
    }
  ],
  "P0B9A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B9A",
      "zh-cn": "混合动力电池电压监控T电路",
      "en-us": "Hybrid Battery Voltage Sense T Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0BA3": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BA3",
      "zh-cn": "混合动力电池电压监控U电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense U Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P018F": [
    {
      "scope": "所有汽车制造商",
      "code": "P018F",
      "zh-cn": "燃油系统过压释放阀门频繁启动",
      "en-us": "Fuel System Over Pressure Relief Valve Frequent Activation",
      "sys": "燃油或空气",
      "knowledge": "燃油系统需要保持恒定的压力，油压过低则喷油器喷油太弱或不喷油，油压太高则使油路损毁或喷油器损坏。该故障码表明燃油系统处于压力过高状态，为防止对油路造成破坏，过压释放阀门频繁启动。压力过高可能是燃油压力调节器，油路堵塞，燃油压力传感器，燃油泵控制模块等问题。"
    }
  ],
  "P0113": [
    {
      "scope": "所有汽车制造商",
      "code": "P0113",
      "zh-cn": "进气温度（IAT）传感器1电路高 （第1排）",
      "en-us": "Intake Air Temperature Sensor 1 Circuit High (Bank 1)",
      "sys": "燃油或空气",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。如果电子控制单元（ECU）检测到进气温度（IAT）传感器信号电压高于自检的最大值（4.6伏或-50摄氏度），该故障码会出现。故障原因包括传感器电路短路到正极，传感器故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0009": [
    {
      "scope": "所有汽车制造商",
      "code": "P0009",
      "zh-cn": "发动机位置系统性能 （第2排）",
      "en-us": "Engine Position System Performance (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。凸轮轴的作用是控制气门的开启和闭合。发动机位置系统利用曲轴位置传感器和凸轮轴位置传感器的信号生成一个角度计数器。角度计数器然后被与曲轴轮角度同步，提供发动机的当前位置。如果电子控制单元（ECU）检测到第1排的两个凸轮轴跟曲轴在一定时间段内不吻合，该故障码会出现。"
    }
  ],
  "P0B07": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B07",
      "zh-cn": "辅助变速器液泵电机W相电流低",
      "en-us": "Auxiliary Transmission Fluid Pump Motor Phase W Current Low",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0828": [
    {
      "scope": "所有汽车制造商",
      "code": "P0828",
      "zh-cn": "升档和降挡开关电路高",
      "en-us": "Up and Down Shift Switch Circuit High",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P06C5": [
    {
      "scope": "所有汽车制造商",
      "code": "P06C5",
      "zh-cn": "气缸1电热塞不正确",
      "en-us": "Cylinder 1 Glow Plug Incorrect",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。该故障码表明气缸1电热塞，其电路，接头，或电热赛控制模块（GPCM）出错。"
    }
  ],
  "P0970": [
    {
      "scope": "所有汽车制造商",
      "code": "P0970",
      "zh-cn": "压力控制电磁阀C控制电路低",
      "en-us": "Pressure Control Solenoid C Control Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。该故障码的原因包括压力控制电磁阀本身，电路，接头等。同时要注意，变速箱控制电磁阀故障有些情况下并不并不是因为电子问题，而是由于管路阻塞或者是机械方面的问题。好多时候，仅仅因为变速箱油太脏就会造成很多这方面的故障。"
    }
  ],
  "P06A9": [
    {
      "scope": "所有汽车制造商",
      "code": "P06A9",
      "zh-cn": "传感器参考电压D电路范围/性能",
      "en-us": "Sensor Reference Voltage D Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到5伏参考电压电路D出错。故障原因包括5伏参考电压电路到某个传感器的电路发生短路或短路，一个或多个传感器发生短路或开路，ECU等。"
    }
  ],
  "P0B38": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B38",
      "zh-cn": "电机电子设备冷却泵B控制电路/开路",
      "en-us": "Motor Electronics Coolant Pump B Control Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": "电机电子系统冷却系统（MECS）是一套独立的为变速箱（例如eCVT）电机，控制模块以及直流/直流转换器提供冷却的系统。它拥有自己的散热器，冷却液泵，冷却液温度传感器等。电机电子冷却系统冷却液泵是一个电子控制单元（ECU）控制的12伏电压电泵。"
    }
  ],
  "P0AD3": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AD3",
      "zh-cn": "混合动力电池组冷却风扇3控制电路高",
      "en-us": "Hybrid Battery Pack Cooling Fan 3 Control Circuit High",
      "sys": "混合动力系统",
      "knowledge": "风扇电机控制器负责调节混合动力电池组冷却风扇的电压。如果冷却风扇1控制电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0C3D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C3D",
      "zh-cn": "直流/直流换流器温度传感器B电路",
      "en-us": "DC/DC Converter Temperature Sensor B Circuit",
      "sys": "混合动力系统",
      "knowledge": "直流/直流转换器将HV电池的直流高压（200-400伏特）转化成12伏特电压，从而可以给辅助电池充电并给车内附件供电。"
    }
  ],
  "P00BE": [
    {
      "scope": "所有汽车制造商",
      "code": "P00BE",
      "zh-cn": "空气流量（MAF）传感器B 电路范围/性能 - 空气流量太低",
      "en-us": "Mass or Volume Air Flow B Circuit Range/Performance - Air Flow Too Low",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。该故障码表明由于空气流量（MAF）传感器B电路故障而导致空气流量过低。"
    }
  ],
  "P06B5": [
    {
      "scope": "所有汽车制造商",
      "code": "P06B5",
      "zh-cn": "传感器供电电源B电路高",
      "en-us": "Sensor Power Supply B Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": ""
    }
  ],
  "P0597": [
    {
      "scope": "所有汽车制造商",
      "code": "P0597",
      "zh-cn": "节温器加热器控制电路/开路",
      "en-us": "Thermostat Heater Control Circuit/Open",
      "sys": "车速及怠速控制",
      "knowledge": "节温器的作用是当冷却液温度低的时候关闭，仅允许冷却液在发动机内循环，提高热车速度；当水温超过设定温度的时候，节温器打开，允许冷却液循环到水箱散热器，有效提高降温效率。该故障码表明电子控制单元（ECU）检测到节温器加热器控制电路电压超出校准的正常范围。故障原因包括节温器加热器，其电路，接头，继电器或电子控制模块。"
    }
  ],
  "P0995": [
    {
      "scope": "所有汽车制造商",
      "code": "P0995",
      "zh-cn": "变速器液压传感器/开关F电路高",
      "en-us": "Transmission Fluid Pressure Sensor/Switch F Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0BDB": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BDB",
      "zh-cn": "驱动电机换流器温度传感器E电路",
      "en-us": "Drive Motor Inverter Temperature Sensor E Circuit",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0938": [
    {
      "scope": "所有汽车制造商",
      "code": "P0938",
      "zh-cn": "液压油温度传感器电路范围/性能",
      "en-us": "Hydraulic Oil Temperature Sensor Range/Performance",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P02AC": [
    {
      "scope": "所有汽车制造商",
      "code": "P02AC",
      "zh-cn": "喷油器受限制 - 气缸5",
      "en-us": "Cylinder 5 - Injector Restricted",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第5缸喷油器性能出错。"
    }
  ],
  "P0A11": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A11",
      "zh-cn": "直流/直流转换器启用电路/开路",
      "en-us": "DC/DC Converter Enable Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": "直流/直流转换器将HV电池的直流高压（200-400伏特）转化成12伏特电压，从而可以给辅助电池充电并给车内附件供电。"
    }
  ],
  "P0A45": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A45",
      "zh-cn": "驱动电机B位置传感器电路",
      "en-us": "Drive Motor B Position Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括驱动电机B位置传感器电路，接头，或传感器本身；混合动力驱动电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P0788": [
    {
      "scope": "所有汽车制造商",
      "code": "P0788",
      "zh-cn": "换档正时电磁阀A高",
      "en-us": "Shift Timing Solenoid A High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P06B0": [
    {
      "scope": "所有汽车制造商",
      "code": "P06B0",
      "zh-cn": "传感器供电电源A电路/开路",
      "en-us": "Sensor Power Supply A Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": ""
    }
  ],
  "P0A09": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A09",
      "zh-cn": "直流/直流转换器状态电路低",
      "en-us": "DC/DC Converter Status Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "直流/直流转换器将HV电池的直流高压（200-400伏特）转化成12伏特电压，从而可以给辅助电池充电并给车内附件供电。如果直流/直流转换器发生故障，辅助电池的电压就会越变越低。"
    }
  ],
  "P0B52": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B52",
      "zh-cn": "混合动力电池电压监控E电路高",
      "en-us": "Hybrid Battery Voltage Sense E Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P010E": [
    {
      "scope": "所有汽车制造商",
      "code": "P010E",
      "zh-cn": "空气流量（MAF）传感器B电路间歇/不稳定",
      "en-us": "Mass or Volume Air Flow B Circuit Intermittent/Erratic",
      "sys": "燃油或空气",
      "knowledge": "空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。如果ECU检测空气流量（MAF）传感器信号电压突然变化，该故障码会出现。"
    }
  ],
  "P024E": [
    {
      "scope": "所有汽车制造商",
      "code": "P024E",
      "zh-cn": "增压空气冷却器旁通阀位置传感器A电路低",
      "en-us": "Charge Air Cooler Bypass Position Sensor A Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。增压空气冷却器旁通阀的作用是将一部分空气绕开空气冷却器。这些空气随后再跟经过空气冷却器冷却过的空气混合后进入发动机，以保证进气温度高于露水温度。如果空气冷却器旁通阀位置传感器A电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P084F": [
    {
      "scope": "所有汽车制造商",
      "code": "P084F",
      "zh-cn": "停车档（P）/空档（N）位置开关输出电路",
      "en-us": "Park/Neutral Switch Output Circuit",
      "sys": "变速箱",
      "knowledge": "驻车档/空档位置开关的作用是将自动变速器在驻车档/空档，还是其他挡位的信息输送给电子控制单元（ECU），作为决定发动机怠速，还是增加负荷的参考依据。该开关也被用在起动机继电器电路中，以防止汽车在驻车档/空档之外的其他挡位启动。"
    }
  ],
  "P002B": [
    {
      "scope": "所有汽车制造商",
      "code": "P002B",
      "zh-cn": "B 凸轮轴形面控制电路低 （第1排）",
      "en-us": "B Camshaft Profile Control Circuit Low (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。该故障码表明B（排气/右/后）凸轮轴形面控制电路电压低于校准的最低值。"
    }
  ],
  "P044C": [
    {
      "scope": "所有汽车制造商",
      "code": "P044C",
      "zh-cn": "废气再循环传感器C电路低",
      "en-us": "Exhaust Gas Recirculation Sensor C Circuit Low",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环（EGR）传感器信号电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P02DD": [
    {
      "scope": "所有汽车制造商",
      "code": "P02DD",
      "zh-cn": "喷油器补偿学习在最高限气缸9",
      "en-us": "Cylinder 9 Fuel Injector Offset Learning At Max Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第9缸喷油器补偿学习已经达到了最高学习极限，该故障码会出现。"
    }
  ],
  "P0453": [
    {
      "scope": "所有汽车制造商",
      "code": "P0453",
      "zh-cn": "蒸发排放系统压力传感器/开关高",
      "en-us": "Evaporative Emission System Pressure Sensor/Switch High",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。如果电子控制单元（ECU）探测到蒸发排放控制系统油箱压力传感器到ECU的输入信号高于最高校准值（4.50伏），则该故障码会出现。"
    }
  ],
  "P0C6B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C6B",
      "zh-cn": "发电机位置传感器电路B低",
      "en-us": "Generator Position Sensor Circuit B Low",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括发电机位置传感器电路，接头，或传感器本身；混合动力车辆发电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P0835": [
    {
      "scope": "所有汽车制造商",
      "code": "P0835",
      "zh-cn": "离合器踏板开关B电路高",
      "en-us": "Clutch Pedal Switch B Circuit High",
      "sys": "变速箱",
      "knowledge": "离合器踏板开关的作用是将离合器是否踩下的信息以电信号的形式输送给电子控制单元，作为控制发动机启动和定速巡航系统的重要参数。"
    }
  ],
  "P0C05": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C05",
      "zh-cn": "驱动电机A，U-V-W相电路/开路",
      "en-us": "Drive Motor A Phase U-V-W Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0373": [
    {
      "scope": "所有汽车制造商",
      "code": "P0373",
      "zh-cn": "点火正时参考高解析信号A间歇/不稳定脉冲",
      "en-us": "Timing Reference High Resolution Signal A Intermittent/Erratic Pulses",
      "sys": "点火系统",
      "knowledge": "光学传感器通过数位于喷射泵内的传感器盘上的脉冲来为动力总成控制模块（PCM）提供高解析信号。这个信号是PCM控制燃油和正时的一个重要参考依据之一。该故障码的原因包括光学传感器，其电路，接头或PCM."
    }
  ],
  "P0613": [
    {
      "scope": "所有汽车制造商",
      "code": "P0613",
      "zh-cn": "变速器控制模块（TCU）处理器",
      "en-us": "TCU Processor",
      "sys": "计算机或辅助输出电路",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。该故障码表明变速器控制模块出错。"
    }
  ],
  "P0B23": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B23",
      "zh-cn": "混合动力电池A电压",
      "en-us": "Hybrid Battery A Voltage",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0472": [
    {
      "scope": "所有汽车制造商",
      "code": "P0472",
      "zh-cn": "排气压力传感器A电路低",
      "en-us": "Exhaust Pressure Sensor A Circuit Low",
      "sys": "排放控制",
      "knowledge": "排气压力传感器的作用是将排气系统压力以电信号的形式输送给电子控制单元（ECU）。如果ECU检测到排气压力传感器A信号电路电压在设定的时间段内（2.5秒）低于0.15伏，该故障码会出现。"
    }
  ],
  "P0B31": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B31",
      "zh-cn": "混合动力电池D电压低",
      "en-us": "Hybrid Battery D Voltage Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0539": [
    {
      "scope": "所有汽车制造商",
      "code": "P0539",
      "zh-cn": "空调蒸发器温度传感器电路间歇",
      "en-us": "A/C Evaporator Temperature Sensor Circuit Intermittent",
      "sys": "车速及怠速控制",
      "knowledge": "空调蒸发器温度传感器的作用是将空调蒸发器内的温度以电信号的形式输送给空调控制模块，以便当空调蒸发器内温度过低的时候，关闭空调压缩机，防止空调蒸发器发生冰冻现象。如果电子控制单元（ECU）检测到空调蒸发器温度传感器信号电压突然变化，该故障码会出现。"
    }
  ],
  "P013F": [
    {
      "scope": "所有汽车制造商",
      "code": "P013F",
      "zh-cn": "氧传感器延迟响应  -（空燃比） 稀到浓 （第1排，传感器 2）",
      "en-us": "O2 Sensor Delayed Response - Lean to Rich (Bank 1, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。如果电子控制单元（ECU）发现在空燃比由稀变浓的过程中，没有监测到可以接受的电压变化速率的话，该故障码就会出现。"
    }
  ],
  "P082B": [
    {
      "scope": "所有汽车制造商",
      "code": "P082B",
      "zh-cn": "换档杆X位置电路低",
      "en-us": "Gear Lever X Position Circuit Low",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0243": [
    {
      "scope": "所有汽车制造商",
      "code": "P0243",
      "zh-cn": "涡轮/超级增压器废气门电磁阀A",
      "en-us": "Turbocharger/Supercharger Wastegate Solenoid A",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。废气门电磁阀的作用是通过控制进入涡轮的尾气流量（将其余尾气绕开），来调整涡轮转速，从而调整最大增压压力。如果电子控制单元（ECU）检测到废气门电磁阀A发生故障，该故障码会出现。"
    }
  ],
  "P0208": [
    {
      "scope": "所有汽车制造商",
      "code": "P0208",
      "zh-cn": "喷油器电路/开路 - 第8缸",
      "en-us": "Injector Circuit/Open - Cylinder 8",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器控制电路出错，该故障码会出现。故障原因包括喷油器接口，电路故障，喷油器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P088A": [
    {
      "scope": "所有汽车制造商",
      "code": "P088A",
      "zh-cn": "变速器液过滤器恶化",
      "en-us": "Transmission Fluid Filter Deteriorated",
      "sys": "变速箱",
      "knowledge": "建议更换变速器液滤清器。"
    }
  ],
  "P0A4E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A4E",
      "zh-cn": "发电机位置传感器电路高",
      "en-us": "Generator Position Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括发电机位置传感器电路，接头，或传感器本身；混合动力车辆发电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P0459": [
    {
      "scope": "所有汽车制造商",
      "code": "P0459",
      "zh-cn": "蒸发排放系统吹扫控制阀电路高",
      "en-us": "Evaporative Emission System Purge Control Valve Circuit High",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。电子控制单元（ECU）检测到蒸发排放系统吹扫控制阀控制电路电压高于校准的最高值。故障原因包括EVAP供电电路故障，EVAP电磁阀控制电路故障，EVAP电磁阀故障，EVAP炭罐泄漏，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P021B": [
    {
      "scope": "所有汽车制造商",
      "code": "P021B",
      "zh-cn": "喷油器正时第8缸",
      "en-us": "Cylinder 8 Injection Timing",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器实际正时跟理想喷油正时偏差超过最大极限，该故障码会出现。"
    }
  ],
  "P0335": [
    {
      "scope": "所有汽车制造商",
      "code": "P0335",
      "zh-cn": "曲轴位置（CKP）传感器A电路",
      "en-us": "Crankshaft Position Sensor A Circuit",
      "sys": "点火系统",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。曲轴位置（CKP）传感器(也叫上止点传感器），其作用是检测上止点（TDC）信号、曲轴转角信号和发动机转速信号，并将其输入计算机，从而使计算机能按气缸的点火顺序发出最佳点火时刻指令。如果电子控制单元（ECU）检测到曲轴传感器A电路电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P0006": [
    {
      "scope": "所有汽车制造商",
      "code": "P0006",
      "zh-cn": "燃油切断阀A控制电路低",
      "en-us": "Fuel Shutoff Valve A Control Circuit Low",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油切断阀的作用是在汽车发生紧急情况（例如翻车）的时候切断通往发动机的燃油供给。该故障码表明电子控制单元（ECU）检测到燃油切断阀A控制电路电压低于校准的最低值。"
    }
  ],
  "P0A62": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A62",
      "zh-cn": "驱动电机A，V相电流高",
      "en-us": "Drive Motor A Phase V Current High",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P02F3": [
    {
      "scope": "所有汽车制造商",
      "code": "P02F3",
      "zh-cn": "喷油器电路范围/性能 - 气缸6",
      "en-us": "Cylinder 6 Injector Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第6缸喷油器电路出错，该故障码会出现。"
    }
  ],
  "P007E": [
    {
      "scope": "所有汽车制造商",
      "code": "P007E",
      "zh-cn": "增压空气冷却器温度传感器电路间歇/不稳定障（第1排）",
      "en-us": "Charge Air Cooler Temperature Sensor Circuit Intermittent/Erratic (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。故障原因包括增压空气温度（CAT）传感器，电路，接头，控制模块等。"
    }
  ],
  "P0863": [
    {
      "scope": "所有汽车制造商",
      "code": "P0863",
      "zh-cn": "变速器控制模块（TCU）通信电路",
      "en-us": "TCU Communication Circuit",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。"
    }
  ],
  "P073C": [
    {
      "scope": "所有汽车制造商",
      "code": "P073C",
      "zh-cn": "卡在7档",
      "en-us": "Stuck in Gear 7",
      "sys": "变速箱",
      "knowledge": "车辆行驶中，电子控制单元（ECU）检测到换档电磁阀发生发生故障（卡住）导致变速器卡在7档。故障原因包括换档电磁阀，输入轴速度传感器，输出轴速度传感器，电路，接头，控制模块，以及变速器机械故障等。"
    }
  ],
  "P0A28": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A28",
      "zh-cn": "混合动力电池供电关闭电路低",
      "en-us": "Hybrid Battery Power Off Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池供电关闭（BPO）电路发生故障。故障原因包括BPO电路，和控制模块。"
    }
  ],
  "P0514": [
    {
      "scope": "所有汽车制造商",
      "code": "P0514",
      "zh-cn": "电池温度传感器电路范围/性能",
      "en-us": "Battery Temperature Sensor Circuit Range/Performance",
      "sys": "车速及怠速控制",
      "knowledge": "电池温度传感器位于汽车电池托盘的底部。它的主要作用是将电池温度以电信号的形式传输给电子控制单元（ECU），以帮助决定充电速度。该故障码表明，电池温度传感器电路故障。"
    }
  ],
  "P005F": [
    {
      "scope": "所有汽车制造商",
      "code": "P005F",
      "zh-cn": "涡轮/超级增压器增压控制B 供电电压电路高",
      "en-us": "Turbocharger/Supercharger Boost Control B Supply Voltage Circuit High",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。涡轮/超级增压器增压控制器的作用是当增压压力达到设定值后，气压推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮速度，控制增压水平。该故障码表明涡轮/超级增压器增压控制B供电电压高于校准的最高值。"
    }
  ],
  "P02AF": [
    {
      "scope": "所有汽车制造商",
      "code": "P02AF",
      "zh-cn": "燃油（空燃比）修剪在最低限 - 气缸6",
      "en-us": "Cylinder 6 - Fuel Trim at Min Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最低极限超过一定时间，该故障码会出现。"
    }
  ],
  "P0222": [
    {
      "scope": "所有汽车制造商",
      "code": "P0222",
      "zh-cn": "节气门/踏板位置传感器/开关B电路低",
      "en-us": "Throttle/Pedal Position Sensor/Switch B Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。该故障码表明节气门踏板位置传感器B电路电压在设定的时间段内持续低于校准的最低值（0.17伏）。故障原因包括传感器接口故障，电路短路到接地，传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0299": [
    {
      "scope": "所有汽车制造商",
      "code": "P0299",
      "zh-cn": "涡轮/超级增压器A处于增压不足状态",
      "en-us": "Turbocharger/Supercharger A Underboost Condition",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。为防止涡轮/超级增压器过度增压，当压力到达设定的最高值时，气压会推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮转速，降低增压水平。如果废气门，废气门调节阀，增压旁通阀，增压压力传感器等发生故障，可能会导致系统增压不足。"
    }
  ],
  "P0AD5": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AD5",
      "zh-cn": "混合动力电池组空气流动阀A控制电路/开路",
      "en-us": "Hybrid Battery Pack Air Flow Valve A Control Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0591": [
    {
      "scope": "所有汽车制造商",
      "code": "P0591",
      "zh-cn": "定速巡航系统多功能输入B电路范围/性能",
      "en-us": "Cruise Control Multi-Function Input B Circuit Range/Performance",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。故障原因包括定速巡航多功能输入开关，电路，接头等。"
    }
  ],
  "P0951": [
    {
      "scope": "所有汽车制造商",
      "code": "P0951",
      "zh-cn": "自动换档手动（ASM）变速器控制电路范围/性能",
      "en-us": "Auto Shift Manual Control Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "自动换档手动变速器允许司机将变速器打入手动模式，手动控制升档或降档。"
    }
  ],
  "P0854": [
    {
      "scope": "所有汽车制造商",
      "code": "P0854",
      "zh-cn": "行车档（D）开关输入电路低",
      "en-us": "Drive Switch Input Circuit Low",
      "sys": "变速箱",
      "knowledge": "行车档位置开关的作用是将自动变速器是否在行车档的信息输送给电子控制单元（ECU），作为决定发动机怠速，以及增加负载的参考依据。"
    }
  ],
  "P06A6": [
    {
      "scope": "所有汽车制造商",
      "code": "P06A6",
      "zh-cn": "传感器参考电压A电路范围/性能",
      "en-us": "Sensor Reference Voltage A Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到5伏参考电压电路A出错。故障原因包括5伏参考电压电路到某个传感器的电路发生短路或短路，一个或多个传感器发生短路或开路，ECU等。"
    }
  ],
  "P0829": [
    {
      "scope": "所有汽车制造商",
      "code": "P0829",
      "zh-cn": "5-6换档",
      "en-us": "5-6 Shift",
      "sys": "变速箱",
      "knowledge": "电子控制单元（ECU）指令5-6换档，但没有检测到相应的发动机转速下降。"
    }
  ],
  "P0605": [
    {
      "scope": "所有汽车制造商",
      "code": "P0605",
      "zh-cn": "内部控制模块只读存储器（ROM）错误",
      "en-us": "Internal Control Module Read Only Memory (ROM) Error",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）出错。故障原因包括电子控制模块（PCM或ECM）故障，试图改变模块校准的尝试，模块编程化出错等。该故障码出现后，先删除看是否会再出现。如果很快再出现，的出现大多数情况下意味着电子控制模块需要更换。"
    }
  ],
  "P073A": [
    {
      "scope": "所有汽车制造商",
      "code": "P073A",
      "zh-cn": "卡在5档",
      "en-us": "Stuck in Gear 5",
      "sys": "变速箱",
      "knowledge": "车辆行驶中，电子控制单元（ECU）检测到换档电磁阀发生发生故障（卡住）导致变速器卡在5档。故障原因包括换档电磁阀，输入轴速度传感器，输出轴速度传感器，电路，接头，控制模块，以及变速器机械故障等。"
    }
  ],
  "P0842": [
    {
      "scope": "所有汽车制造商",
      "code": "P0842",
      "zh-cn": "变速器液压力（TFP）传感器/开关A电路低",
      "en-us": "Transmission Fluid Pressure Sensor/Switch A Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P009E": [
    {
      "scope": "所有汽车制造商",
      "code": "P009E",
      "zh-cn": "燃油压力释放控制性能/卡在关闭位置",
      "en-us": "Fuel Pressure Relief Control Performance/Stuck Off",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油系统过压释放阀的作用是在燃油管路因为滤清器太脏，管路阻塞等引起管路压力过大时，释放燃油管路压力。如果燃油压力释放控制发生故障或卡在关的位置，该故障码会出现。"
    }
  ],
  "P0B24": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B24",
      "zh-cn": "混合动力电池A电压不稳定",
      "en-us": "Hybrid Battery A Voltage Unstable",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P024F": [
    {
      "scope": "所有汽车制造商",
      "code": "P024F",
      "zh-cn": "增压空气冷却器旁通阀位置传感器A电路高",
      "en-us": "Charge Air Cooler Bypass Position Sensor A Circuit High",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。增压空气冷却器旁通阀的作用是将一部分空气绕开空气冷却器。这些空气随后再跟经过空气冷却器冷却过的空气混合后进入发动机，以保证进气温度高于露水温度。如果空气冷却器旁通阀位置传感器A电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0717": [
    {
      "scope": "所有汽车制造商",
      "code": "P0717",
      "zh-cn": "输入轴/涡轮速度传感器A电路没有信号",
      "en-us": "Input/Turbine Speed Sensor A Circuit No Signal",
      "sys": "变速箱",
      "knowledge": "涡轮转速传感器（TSS），也叫输入轴转速传感器（ISS），其作用是将输入轴（也就是液力变矩器）的转速以频率的形式输送给变速器控制模块（TCU）,这些信息对于调节液力变矩器锁定离合器尤为关键。该故障码表明输入轴转速传感器信号丢失。故障原因包括TSS传感器，或其电路，接头故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0B8E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B8E",
      "zh-cn": "混合动力电池电压监控Q电路高",
      "en-us": "Hybrid Battery Voltage Sense Q Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0653": [
    {
      "scope": "所有汽车制造商",
      "code": "P0653",
      "zh-cn": "传感器参考电压B电路高",
      "en-us": "Sensor Reference Voltage B Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到5伏参考电压电路B出错。故障原因包括5伏参考电压电路到某个传感器的电路发生短路或短路，一个或多个传感器发生短路或开路，自动变速器液压传感器故障，电磁阀故障，变速器控制模块故障，变速器输入速度（RPM）传感器故障，变速器输出速度（RPM）传感器故障等。"
    }
  ],
  "P0612": [
    {
      "scope": "所有汽车制造商",
      "code": "P0612",
      "zh-cn": "喷油器控制模块继电器控制",
      "en-us": "Fuel Injector Control Module Relay Control",
      "sys": "计算机或辅助输出电路",
      "knowledge": "喷油嘴控制模块（FICM）负责根据来自电子控制模块（ECU）的燃油和正时信息来控制喷油嘴电磁阀。电子控制单元（ECU）通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。P0611表明喷油器控制模块（FICM）继电器控制发生故障。"
    }
  ],
  "P0C20": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C20",
      "zh-cn": "辅助变速器液泵U-V-W相电路/开路",
      "en-us": "Auxiliary Transmission Fluid Pump Phase U-V-W Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0C67": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C67",
      "zh-cn": "发电机位置传感器电路A高",
      "en-us": "Generator Position Sensor Circuit A High",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括发电机位置传感器电路，接头，或传感器本身；混合动力车辆发电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P0610": [
    {
      "scope": "所有汽车制造商",
      "code": "P0610",
      "zh-cn": "控制模块车辆选项错误",
      "en-us": "Control Module Vehicle Options Error",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P0BC4": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BC4",
      "zh-cn": "混合动力电池温度传感器E电路低",
      "en-us": "Hybrid Battery Temperature Sensor E Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P056A": [
    {
      "scope": "所有汽车制造商",
      "code": "P056A",
      "zh-cn": "（智能）定速巡航系统 - 增加车距 - 信号",
      "en-us": "Cruise Control Increase Distance Signal",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。新型汽车装备的智能定速系统可以设定与前方汽车的距离。故障原因包括定速巡航车距范围控制模块，电路，接头，以及电子控制单元。"
    }
  ],
  "P0195": [
    {
      "scope": "所有汽车制造商",
      "code": "P0195",
      "zh-cn": "机油温度传感器电路故障",
      "en-us": "Engine Oil Temperature Sensor Circuit",
      "sys": "燃油或空气",
      "knowledge": "机油温度（EOT）传感器依据热敏电阻的原理将机油温度以电信号的形式传送到电子控制单元（ECU）。如果电子控制单元（ECU）检测到机油温度传感器的信号电压超出了校准的正常范围，该故障码会出现。故障原因包括机油温度传感器，其电路，或接头。"
    }
  ],
  "P0944": [
    {
      "scope": "所有汽车制造商",
      "code": "P0944",
      "zh-cn": "液压装置失压",
      "en-us": "Hydraulic Pressure Unit Loss of Pressure",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P079A": [
    {
      "scope": "所有汽车制造商",
      "code": "P079A",
      "zh-cn": "变速器摩擦衬片A检测到打滑",
      "en-us": "Transmission Friction Element A Slip Detected",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0A3E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A3E",
      "zh-cn": "发电机换流器温度过高",
      "en-us": "Generator Inverter Over Temperature",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。该故障码表明发电机换流器温度传感器显示温度过高。故障原因包括电机电子冷却系统出错，变速器液液面过低，变速器或变速器控制模块出错。"
    }
  ],
  "P02F6": [
    {
      "scope": "所有汽车制造商",
      "code": "P02F6",
      "zh-cn": "喷油器电路范围/性能 - 气缸9",
      "en-us": "Cylinder 9 Injector Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第9缸喷油器电路出错，该故障码会出现。"
    }
  ],
  "P0921": [
    {
      "scope": "所有汽车制造商",
      "code": "P0921",
      "zh-cn": "换档前推执行器 （前推换档杆，奇数齿轮，1,3,5）电路范围/性能",
      "en-us": "Gear Shift Forward Actuator Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0B83": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B83",
      "zh-cn": "混合动力电池电压监控O电路低",
      "en-us": "Hybrid Battery Voltage Sense O Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0342": [
    {
      "scope": "所有汽车制造商",
      "code": "P0342",
      "zh-cn": "凸轮轴位置（CMP）传感器A电路低 （第1排或单个传感器）",
      "en-us": "Camshaft Position Sensor A Circuit Low  (Bank 1 or Single Sensor)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。该故障码表明A（进气/左/前）凸轮轴位置（CMP）传感器信号电压低于校准的最低值。故障原因包括凸轮轴位置（CMP）传感器电路，接头，其本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P07A3": [
    {
      "scope": "所有汽车制造商",
      "code": "P07A3",
      "zh-cn": "变速器摩擦衬片A卡在开的位置",
      "en-us": "Transmission Friction Element A Stuck On",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P04A9": [
    {
      "scope": "所有汽车制造商",
      "code": "P04A9",
      "zh-cn": "排气压力控制阀门B位置传感器/开关电路高",
      "en-us": "Exhaust Pressure Control Valve B Position Sensor/Switch Circuit High",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。如果电子控制单元（ECU）检测到排气压力控制阀门位置传感器信号电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0609": [
    {
      "scope": "所有汽车制造商",
      "code": "P0609",
      "zh-cn": "控制模块车速传感器（VSS）（VSS）输出B",
      "en-us": "Control Module VSS Output B",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。车速传感器（VSS）的作用是将汽车的速度以电信号形式传输给电子控制单元（ECU），作为控制发动机怠速，自动变速器换档，液力变矩器器锁止，发动机冷却风扇的开闭，以及巡航定速等其它功能的参考依据。"
    }
  ],
  "P0A54": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A54",
      "zh-cn": "驱动电机A电流传感器电路高",
      "en-us": "Drive Motor A Current Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）内部故障。"
    }
  ],
  "P0683": [
    {
      "scope": "所有汽车制造商",
      "code": "P0683",
      "zh-cn": "电热塞控制模块到动力总成控制模块（PCM）通讯电路",
      "en-us": "Glow Plug Control Module to PCM Communication Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）失去跟电热塞控制模块（GPCM）的通讯，或者从GPCM收到关于CAN总线连接出错的故障信息，该故障码会出现。"
    }
  ],
  "P0441": [
    {
      "scope": "所有汽车制造商",
      "code": "P0441",
      "zh-cn": "蒸发排放系统吹扫流量不正确",
      "en-us": "Evaporative Emission System Incorrect Purge Flow",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。如果蒸发排放系统空气吹扫流量发生故障，该故障码会出现。故障原因包括排气歧管或排气管泄漏，催化转换器自身故障，发动机冷却液温度（ECT）或缸盖温度（CHT）传感器故障，发动机失火或点火正时过于滞后，机油太脏，前部或后部氧传感器故障，燃油系统压力太高等。"
    }
  ],
  "P0A05": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A05",
      "zh-cn": "电机电子系统冷却液泵A控制电路/开路",
      "en-us": "Motor Electronics Coolant Pump A Control Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": "电机电子系统冷却系统（MECS）是一套独立的为变速箱（例如eCVT）电机，控制模块以及直流/直流转换器提供冷却的系统。它拥有自己的散热器，冷却液泵，冷却液温度传感器等。电机电子冷却系统冷却液泵是一个电子控制单元（ECU）控制的12伏电压电泵。如果控制模块发现将电机电子冷却系统冷却液泵强制接地，却仍有大量电流存在；或者是电机电子系统冷却液泵没有接地，而检测不到电压存在；该故障码会出现。"
    }
  ],
  "P0A43": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A43",
      "zh-cn": "驱动电机A位置传感器电路间歇",
      "en-us": "Drive Motor A Position Sensor Circuit Intermittent",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括驱动电机A位置传感器电路，接头，或传感器本身；混合动力驱动电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P0B20": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B20",
      "zh-cn": "混合动力电池组电压监控D电路低",
      "en-us": "Hybrid Battery Pack Voltage Sense D Circuit Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0BC5": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BC5",
      "zh-cn": "混合动力电池温度传感器E电路高",
      "en-us": "Hybrid Battery Temperature Sensor E Circuit High",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0120": [
    {
      "scope": "所有汽车制造商",
      "code": "P0120",
      "zh-cn": "节气门/油门踏板位置传感器/开关A电路",
      "en-us": "Throttle/Pedal Position Sensor/Switch A Circuit",
      "sys": "燃油或空气",
      "knowledge": "在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。该故障码表明电子节气门位置传感器A信号电路发生故障。"
    }
  ],
  "P0AD1": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AD1",
      "zh-cn": "混合动力电池组冷却风扇3卡在开启位置",
      "en-us": "Hybrid Battery Pack Cooling Fan 3 Stuck On",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块根据来自电池温度传感器的信号来控制电池风扇的开启或关闭。如果实际电池组温度比基于冷却风扇性能估计的电池组温度低出一设定值，控制模块认为电池组风扇卡在开启位置。"
    }
  ],
  "P0051": [
    {
      "scope": "所有汽车制造商",
      "code": "P0051",
      "zh-cn": "热氧传感器加热器控制电路低 （第2排，传感器1）",
      "en-us": "HO2S Heater Control Circuit Low (Bank 2, Sensor 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）通过控制氧传感器加热器的开/关来保持氧传感器780oC的温度。如果加热器的控制电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0665": [
    {
      "scope": "所有汽车制造商",
      "code": "P0665",
      "zh-cn": "进气歧管调谐阀控制电路高（第2排）",
      "en-us": "Intake Manifold Tuning Valve Control Circuit High (Bank 2)",
      "sys": "计算机或辅助输出电路",
      "knowledge": "如果进气歧管通路（runner）的长度最佳，气门关闭所产生的压力波会帮助将油气混合物导入发动机。问题是发动机不同转速对应的最佳进气歧管通路长度也不同。歧管调谐阀（MTV）的作用就是根据发动机转速，将进气导入不同长度的进气歧管通路，以此来优化发动机在不同转速时的扭矩。如果电子控制单元（ECU）在自检时检测到进气歧管调谐阀控制电路电压高于校准的最高值，则该故障码会出现。"
    }
  ],
  "P02D4": [
    {
      "scope": "所有汽车制造商",
      "code": "P02D4",
      "zh-cn": "喷油器补偿学习在最低限气缸5",
      "en-us": "Cylinder 5 Fuel Injector Offset Learning At Min Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第5缸喷油器补偿学习已经达到了最低学习极限，该故障码会出现。"
    }
  ],
  "P0507": [
    {
      "scope": "所有汽车制造商",
      "code": "P0507",
      "zh-cn": "怠速空气控制系统发动机转速比预期值高",
      "en-us": "Idle Air Control System RPM Higher Than Expected",
      "sys": "车速及怠速控制",
      "knowledge": "怠速空气控制（IAC）阀带有一个由准确移动步进电机控制的可移动针阀。在节气门关闭的情况下，IAC阀通过改变旁通管路的空气流量，对怠速进行控制，以适应不同条件下的怠速。如果电子控制单元（ECU）检测到发动机怠速高于设定值时，该故障码会出现。故障原因包括节气门体之后的空气泄漏，IAC控制电路故障，IAC电磁阀故障，节气门阀控制模块故障，电子控制模块（PCM或ECM）故障，车速传感器故障等。"
    }
  ],
  "P0C5C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C5C",
      "zh-cn": "驱动电机A位置传感器电路B低",
      "en-us": "Drive Motor A Position Sensor Circuit B Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0063": [
    {
      "scope": "所有汽车制造商",
      "code": "P0063",
      "zh-cn": "热氧传感器加热器控制电路低 （第2排，传感器3）",
      "en-us": "HO2S Heater Control Circuit Low (Bank 2, Sensor 3)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）通过控制氧传感器加热器的开/关来保持氧传感器780oC的温度。如果加热器的控制电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0024": [
    {
      "scope": "所有汽车制造商",
      "code": "P0024",
      "zh-cn": "B 凸轮轴位置执行器 - 正时过前或系统性能 （第2排）",
      "en-us": "B Camshaft Position - Timing Over-Advanced or System Performance (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。P0024的故障原因包括B排气/右/后凸轮轴正时没有设定好，凸轮轴过前原理机械性卡住，或者是执行器阀门卡在开的位置。"
    }
  ],
  "P0855": [
    {
      "scope": "所有汽车制造商",
      "code": "P0855",
      "zh-cn": "行车档（D）开关输入电路高",
      "en-us": "Drive Switch Input Circuit High",
      "sys": "变速箱",
      "knowledge": "行车档位置开关的作用是将自动变速器是否在行车档的信息输送给电子控制单元（ECU），作为决定发动机怠速，以及增加负载的参考依据。"
    }
  ],
  "P04A2": [
    {
      "scope": "所有汽车制造商",
      "code": "P04A2",
      "zh-cn": "排气压力控制阀门B高",
      "en-us": "Exhaust Pressure Control Valve B High",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。电子控制单元（ECU）检测到排气压力控制阀A电路电压高于校准的最高值。故障原因包括排气翻板阀或其电路。"
    }
  ],
  "P0920": [
    {
      "scope": "所有汽车制造商",
      "code": "P0920",
      "zh-cn": "换档前推执行器 （前推换档杆，奇数齿轮，1,3,5）电路/开路",
      "en-us": "Gear Shift Forward Actuator Circuit/Open",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0803": [
    {
      "scope": "所有汽车制造商",
      "code": "P0803",
      "zh-cn": "升档（跳档）电磁阀控制电路",
      "en-us": "Upshift/Skip Shift Solenoid Control Circuit",
      "sys": "变速箱",
      "knowledge": "对于一些大功率的汽车，为提高汽车的燃油效率和降低排放，当条件满足的时候（低速，小油门，车已预热等），跳档电磁阀会阻止挂入2，3档，相当于强制变速杆从1档直接换到4档。该故障码表明跳档电磁阀控制电路出错。"
    }
  ],
  "P0461": [
    {
      "scope": "所有汽车制造商",
      "code": "P0461",
      "zh-cn": "燃油液位传感器A电路范围/性能",
      "en-us": "Fuel Level Sensor A Circuit Range/Performance",
      "sys": "排放控制",
      "knowledge": "燃油液位传感器利用油箱内的一个浮标和可变电阻的原理将油箱内的燃油液位以电信号的形式输送给电子控制模块。如果电子控制单元（ECU）发现燃油液位输入信号超出校准的范围，该故障码会出现。"
    }
  ],
  "P049D": [
    {
      "scope": "所有汽车制造商",
      "code": "P049D",
      "zh-cn": "废气再循环A控制位置超过学习极限",
      "en-us": "Exhaust Gas Recirculation A Control Position Exceeded Learning Limit",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。"
    }
  ],
  "P0598": [
    {
      "scope": "所有汽车制造商",
      "code": "P0598",
      "zh-cn": "节温器加热器控制电路低",
      "en-us": "Thermostat Heater Control Circuit Low",
      "sys": "车速及怠速控制",
      "knowledge": "节温器的作用是当冷却液温度低的时候关闭，仅允许冷却液在发动机内循环，提高热车速度；当水温超过设定温度的时候，节温器打开，允许冷却液循环到水箱散热器，有效提高降温效率。该故障码表明电子控制单元（ECU）检测到节温器加热器控制电路电压低于校准的最低值。故障原因包括节温器加热器，其电路，接头，或继电器。"
    }
  ],
  "P0339": [
    {
      "scope": "所有汽车制造商",
      "code": "P0339",
      "zh-cn": "曲轴位置（CKP）传感器A电路间歇",
      "en-us": "Crankshaft Position Sensor A Circuit Intermittent",
      "sys": "点火系统",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。曲轴位置（CKP）传感器(也叫上止点传感器），其作用是检测上止点（TDC）信号、曲轴转角信号和发动机转速信号，并将其输入计算机，从而使计算机能按气缸的点火顺序发出最佳点火时刻指令。如果电子控制单元（ECU）检测到曲轴传感器A电路电压突然变化，该故障码会出现。"
    }
  ],
  "P021F": [
    {
      "scope": "所有汽车制造商",
      "code": "P021F",
      "zh-cn": "喷油器正时第12缸",
      "en-us": "Cylinder 12 Injection Timing",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器实际正时跟理想喷油正时偏差超过最大极限，该故障码会出现。"
    }
  ],
  "P0BF8": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BF8",
      "zh-cn": "驱动电机B，V相电流传感器电路高",
      "en-us": "Drive Motor B Phase V Current Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P029A": [
    {
      "scope": "所有汽车制造商",
      "code": "P029A",
      "zh-cn": "燃油（空燃比）修剪在最高限 - 气缸1",
      "en-us": "Cylinder 1 - Fuel Trim at Max Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最大极限超过一定时间，该故障码会出现。"
    }
  ],
  "P023C": [
    {
      "scope": "所有汽车制造商",
      "code": "P023C",
      "zh-cn": "增压空气冷却器冷却液泵控制电路高",
      "en-us": "Charge Air Cooler Coolant Pump Control Circuit High",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。如果增压空气冷却器的冷却液泵控制电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0030": [
    {
      "scope": "所有汽车制造商",
      "code": "P0030",
      "zh-cn": "热氧传感器加热器控制电路 （第1排，传感器1）",
      "en-us": "HO2S Heater Control Circuit (Bank 1, Sensor 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）通过控制氧传感器加热器的开/关来保持氧传感器780oC的温度。如果氧传感器在设定的时间内没有达到要求的温度，或ECU无法维持设定的温度，该故障码会出现。"
    }
  ],
  "P064C": [
    {
      "scope": "所有汽车制造商",
      "code": "P064C",
      "zh-cn": "电热塞控制模块",
      "en-us": "Glow Plug Control Module",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。该故障码表明电热赛控制模块发生故障。故障原因包括电热塞控制模块，电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P079E": [
    {
      "scope": "所有汽车制造商",
      "code": "P079E",
      "zh-cn": "变速器摩擦衬片E检测到打滑",
      "en-us": "Transmission Friction Element E Slip Detected",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0123": [
    {
      "scope": "所有汽车制造商",
      "code": "P0123",
      "zh-cn": "节气门/油门踏板位置传感器/开关A电路高",
      "en-us": "Throttle/Pedal Position Sensor/Switch A Circuit High",
      "sys": "燃油或空气",
      "knowledge": "在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。该故障码表明电子节气门踏板位置传感器A信号电压高于校准的最高值（4.65v）。故障原因包括传感器信号电路短路到正极，传感器本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0696": [
    {
      "scope": "所有汽车制造商",
      "code": "P0696",
      "zh-cn": "风扇3控制电路高",
      "en-us": "Fan 3 Control Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到风扇3（中速）控制变量（FCV）电路电压高于校准的最高值。故障原因包括风扇本身或其控制电路，接头等。"
    }
  ],
  "P068C": [
    {
      "scope": "所有汽车制造商",
      "code": "P068C",
      "zh-cn": "气缸7电热塞控制电路低",
      "en-us": "Cylinder 7 Glow Plug Control Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸7电热塞控制电路电压低于校准的最低值，则该故障码会出现。"
    }
  ],
  "P0AA6": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AA6",
      "zh-cn": "混合动力电池电压系统隔离故障",
      "en-us": "Hybrid Battery Voltage System Isolation Fault",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压系统隔离电阻太低。"
    }
  ],
  "P0246": [
    {
      "scope": "所有汽车制造商",
      "code": "P0246",
      "zh-cn": "涡轮/超级增压器废气门电磁阀A高",
      "en-us": "Turbocharger/Supercharger Wastegate Solenoid A High",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。废气门电磁阀的作用是通过控制进入涡轮的尾气流量（将其余尾气绕开），来调整涡轮转速，从而调整最大增压压力。如果电子控制单元（ECU）检测到废气门电磁阀A电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0B01": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B01",
      "zh-cn": "辅助变速器液泵电机U相电流低",
      "en-us": "Auxiliary Transmission Fluid Pump Motor Phase U Current Low",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0A66": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A66",
      "zh-cn": "驱动电机B，U相电流",
      "en-us": "Drive Motor B Phase U Current",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0046": [
    {
      "scope": "所有汽车制造商",
      "code": "P0046",
      "zh-cn": "涡轮/超级增压器增压控制A电路范围/性能",
      "en-us": "Turbocharger/Supercharger Boost Control A Circuit Range/Performance",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。涡轮/超级增压器增压控制器的作用是当增压压力达到设定值后，气压推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮速度，控制增压水平。该故障码表明涡轮/超级增压器增压控制电路出错。"
    }
  ],
  "P076C": [
    {
      "scope": "所有汽车制造商",
      "code": "P076C",
      "zh-cn": "换档电磁阀H卡在开的位置",
      "en-us": "Shift Solenoid H Stuck On",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P029D": [
    {
      "scope": "所有汽车制造商",
      "code": "P029D",
      "zh-cn": "喷油器泄漏 - 气缸1",
      "en-us": "Cylinder 1 - Injector Leaking",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第1缸喷油器发生泄漏。"
    }
  ],
  "P0638": [
    {
      "scope": "所有汽车制造商",
      "code": "P0638",
      "zh-cn": "节气门执行器控制范围/性能（第1排）",
      "en-us": "Throttle Actuator Control Range/Performance (Bank 1)",
      "sys": "计算机或辅助输出电路",
      "knowledge": "在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。节气门执行器是一个步进电机，它负责按照节气门控制模块的指令来控制节气门的开度。如果电子控制单元（ECU）检测到节气门执行器控制电路出错，该故障码会出现。故障原因包括节气门位置（TP）传感器故障，节气门阀控制模块故障，加速踏板模块故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0AA5": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AA5",
      "zh-cn": "混合动力电池负极接触器电路卡在开启位置",
      "en-us": "Hybrid Battery Negative Contactor Circuit Stuck Open",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果第3系统主继电器（SMR）卡住，有可能会导致高压系统不能关闭。所以，混合动力汽车电子控制单元如果一旦发现其中的任何一个继电器发生故障，便会终止整个系统。"
    }
  ],
  "P00AA": [
    {
      "scope": "所有汽车制造商",
      "code": "P00AA",
      "zh-cn": "进气温度（IAT）传感器1电路 （第2排）",
      "en-us": "Intake Air Temperature Sensor 1 Circuit (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。该故障码表明进气温度（IAT）传感器信号电压超出校准的正常值。"
    }
  ],
  "P0082": [
    {
      "scope": "所有汽车制造商",
      "code": "P0082",
      "zh-cn": "进气阀门控制电磁阀电路低 （第2排）",
      "en-us": "Intake Valve Control Solenoid Circuit Low (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。如果进气凸轮轴调节阀电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0199": [
    {
      "scope": "所有汽车制造商",
      "code": "P0199",
      "zh-cn": "机油温度传感器电路间歇/不稳定",
      "en-us": "Engine Oil Temperature Sensor Circuit Intermittent/Erratic",
      "sys": "燃油或空气",
      "knowledge": "机油温度（EOT）传感器依据热敏电阻的原理将机油温度以电信号的形式传送到电子控制单元（ECU）。如果电子控制单元（ECU）检测到机油温度传感器的信号电压突然变化，该故障码会出现。故障原因包括机油温度传感器，其电路，或接头。"
    }
  ],
  "P0571": [
    {
      "scope": "所有汽车制造商",
      "code": "P0571",
      "zh-cn": "刹车开关A电路",
      "en-us": "Brake Switch A Circuit",
      "sys": "车速及怠速控制",
      "knowledge": "刹车开关的作用是将刹车踏板踩下与否的信息以电信号的形式传送给电子控制单元（ECU），作为停止定速巡航和分离液力变矩器的重要依据。电子控制单元（ECU）在钥匙开，发动机运转的自检中未发现刹车开关信号的变化。故障原因包括刹车灯开关，其电路，或接头。"
    }
  ],
  "P007F": [
    {
      "scope": "所有汽车制造商",
      "code": "P007F",
      "zh-cn": "增压空气冷却器温度传感器， 第1排/第2排相关性",
      "en-us": "Charge Air Cooler Temperature Sensor Bank1/Bank2 Correlation",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。如果第1排与第2排的增压空气冷却器温度传感器信号相差过大，该故障码会出现。"
    }
  ],
  "P0968": [
    {
      "scope": "所有汽车制造商",
      "code": "P0968",
      "zh-cn": "压力控制电磁阀C控制电路/开路",
      "en-us": "Pressure Control Solenoid C Control Circuit/Open",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。该故障码的原因包括压力控制电磁阀本身，电路，接头等。同时要注意，变速箱控制电磁阀故障有些情况下并不并不是因为电子问题，而是由于管路阻塞或者是机械方面的问题。好多时候，仅仅因为变速箱油太脏就会造成很多这方面的故障。"
    }
  ],
  "P052A": [
    {
      "scope": "所有汽车制造商",
      "code": "P052A",
      "zh-cn": "冷车启动A凸轮轴位置正时过于超前 （第1排）",
      "en-us": "Cold Start A Camshaft Position Timing Over-Advanced (Bank 1)",
      "sys": "车速及怠速控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。冷车启动时，如果电子控制单元（ECU）检测到A（进气/左/前）凸轮轴正时超过最大设定值，或者一直处于超前状态，则该故障码会出现。"
    }
  ],
  "P0476": [
    {
      "scope": "所有汽车制造商",
      "code": "P0476",
      "zh-cn": "排气压力控制阀A电路范围/性能",
      "en-us": "Exhaust Pressure Control Valve A Circuit Range/Performance",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。如果电子控制单元（ECU）检测到排气压力控制阀A电路电压出错，该故障码会出现。"
    }
  ],
  "P0BAD": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BAD",
      "zh-cn": "混合动力电池电压监控W电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense W Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0A03": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A03",
      "zh-cn": "电机电子系统冷却液温度传感器电路高",
      "en-us": "Motor Electronics Coolant Temperature Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "电机电子系统冷却系统（MECS）是一套独立的为变速箱（例如eCVT）电机，控制模块以及直流/直流转换器提供冷却的系统。它拥有自己的散热器，冷却液泵，冷却液温度传感器等。电机电子系统冷却液温度（MECT）传感器运用热敏电阻的原理将电机电子系统冷却液的温度以电子形式输送给电子控制单元（ECU）。如果控制模块检测到测得的电机电子系统冷却液温度（MECT）传感器电压高于5.0伏，该故障码会出现。"
    }
  ],
  "P0498": [
    {
      "scope": "所有汽车制造商",
      "code": "P0498",
      "zh-cn": "蒸发排放系统通风阀门控制电路低",
      "en-us": "Evaporative Emission System Vent Valve Control Circuit Low",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。电子控制单元（ECU）检测到蒸发排放（EVAP）系统通风阀门控制电路电压低于校准的最低值。"
    }
  ],
  "P02C6": [
    {
      "scope": "所有汽车制造商",
      "code": "P02C6",
      "zh-cn": "燃油（空燃比）修剪在最高限 - 气缸12",
      "en-us": "Cylinder 12 - Fuel Trim at Max Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最大极限超过一定时间，该故障码会出现。"
    }
  ],
  "P0657": [
    {
      "scope": "所有汽车制造商",
      "code": "P0657",
      "zh-cn": "执行器电源电压A电路/开路",
      "en-us": "Actuator Supply Voltage A Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "动力总成控制模块（PCM）检测到变速器执行器供电A电路电压超出正常范围。故障原因包括电路或接头故障，自动变速器液压传感器故障，电磁阀故障，变速器控制模块故障，变速器输入速度（RPM）传感器故障，变速器输出速度（RPM）传感器故障等。"
    }
  ],
  "P06B6": [
    {
      "scope": "所有汽车制造商",
      "code": "P06B6",
      "zh-cn": "内部控制模块爆震传感器处理器1性能",
      "en-us": "Internal Control Module Knock Sensor Processor 1 Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "动力总成控制模块（PCM）利用爆震传感器探测发动机转速改变时的震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。该故障码表明内部控制模块发生故障。"
    }
  ],
  "P0AEC": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AEC",
      "zh-cn": "混合动力电池温度传感器D电路间歇/不稳定",
      "en-us": "Hybrid Battery Temperature Sensor D Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压突然变化，该故障码会出现。"
    }
  ],
  "P0282": [
    {
      "scope": "所有汽车制造商",
      "code": "P0282",
      "zh-cn": "第8缸喷油器电路低",
      "en-us": "Cylinder 8 Injector Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第8缸喷油器控制电路电压低于校准的最低值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0B0A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B0A",
      "zh-cn": "辅助变速器液泵电机供电电压电路低",
      "en-us": "Auxiliary Transmission Fluid Pump Motor Supply Voltage Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P011C": [
    {
      "scope": "所有汽车制造商",
      "code": "P011C",
      "zh-cn": "（涡轮增压器）增压空气温度（传感器）/进气温度（传感器）相关性 （第1排）",
      "en-us": "Charge Air Temperature/Intake Air Temperature Correlation (Bank 1)",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。如果ECU检测到增压空气温度传感器跟进气温度（IAT）传感器信号差超过了设定的最大值，该故障码会出现。"
    }
  ],
  "P0AB4": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AB4",
      "zh-cn": "混合动力电池组空气温度传感器B电路高",
      "en-us": "Hybrid Battery Pack Air Temperature Sensor B Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车的进气温度（IAT）传感器位于电池总成之内。该故障码的故障原因包括混合动力电池（进气温度（IAT）传感器），电池组控制模块等。"
    }
  ],
  "P0121": [
    {
      "scope": "所有汽车制造商",
      "code": "P0121",
      "zh-cn": "节气门/油门踏板位置传感器/开关A电路范围/性能",
      "en-us": "Throttle/Pedal Position Sensor/Switch A Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。故障原因包括节气门翻板太脏，太粘，或卡住，传感器信号电路开路，传感器地线电路开路，或传感器本身故障等。"
    }
  ],
  "P0089": [
    {
      "scope": "所有汽车制造商",
      "code": "P0089",
      "zh-cn": "燃油压力调节器1 - 性能",
      "en-us": "Fuel Pressure Regulator 1 - Performance",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。P0089表明燃油压力调节器1发生故障。故障原因包括燃油压力调节器阀故障，燃油压力传感器故障，燃油泵控制模块（FPCM）故障，燃油泵故障等。"
    }
  ],
  "P0156": [
    {
      "scope": "所有汽车制造商",
      "code": "P0156",
      "zh-cn": "氧传感器电路（第2排，传感器 2）",
      "en-us": "O2 Sensor Circuit (Bank 2, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）监控加热氧传感器的电路。当ECU检测到用于测定废气中氧含量的电路有问题时，则该故障码会出现。故障原因包括排气歧管或排气管泄漏，氧传感器本身或其电路或接头故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0B70": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B70",
      "zh-cn": "混合动力电池电压监控K电路高",
      "en-us": "Hybrid Battery Voltage Sense K Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0166": [
    {
      "scope": "所有汽车制造商",
      "code": "P0166",
      "zh-cn": "氧传感器电路无作用（第2排，传感器 3）",
      "en-us": "O2 Sensor Circuit No Activity Detected (Bank 2, Sensor 3)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）持续监控加热氧传感器已确定氧传感器在工作。如果加热氧传感器信号值持续停留在默认值，电子控制单元（ECU）就会命令振荡的空气/燃油比以试图监测到信号值的一些变化。如果这时候ECU依然无法检测传感器的信号的变化，该故障码就会出现。"
    }
  ],
  "P0573": [
    {
      "scope": "所有汽车制造商",
      "code": "P0573",
      "zh-cn": "刹车开关A电路高",
      "en-us": "Brake Switch A Circuit High",
      "sys": "车速及怠速控制",
      "knowledge": "刹车开关的作用是将刹车踏板踩下与否的信息以电信号的形式传送给电子控制单元（ECU），作为停止定速巡航和分离液力变矩器的重要依据。电子控制单元（ECU）发现刹车开关电路电压持续很高（卡在关的位置）。故障原因包括刹车灯开关，其电路，或接头"
    }
  ],
  "P0C47": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C47",
      "zh-cn": "混合动力电池组冷却液泵控制电路/开路",
      "en-us": "Hybrid Battery Pack Coolant Pump Control Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0129": [
    {
      "scope": "所有汽车制造商",
      "code": "P0129",
      "zh-cn": "大气压力太低",
      "en-us": "Barometric Pressure Too Low",
      "sys": "燃油或空气",
      "knowledge": "大气压力传感器（有时候也叫高海拔补偿器，HAC）的作用是将大气压力以电信号的形式输送给电子控制模块。大气压力会随天气和海拔高度的变化而变化。压力越小，空气越稀薄。动力总成控制模块（PCM）会根据大气压力的数值来修正燃油供给，以帮助发动机达到最佳空燃比。气压传感器检测到气压过低。故障原因包括气压传感器，电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P0433": [
    {
      "scope": "所有汽车制造商",
      "code": "P0433",
      "zh-cn": "热催化转换器效能低于阈值（第2排）",
      "en-us": "Heated Catalyst Efficiency Below Threshold (Bank 2)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明预热以后催化转换器效能低于设定的最低极限。故障原因包括催化转换器，氧传感器，以及电路，接头等。"
    }
  ],
  "P0978": [
    {
      "scope": "所有汽车制造商",
      "code": "P0978",
      "zh-cn": "换档电磁阀C控制电路范围/性能",
      "en-us": "Shift Solenoid C Control Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0463": [
    {
      "scope": "所有汽车制造商",
      "code": "P0463",
      "zh-cn": "燃油液位传感器A电路高",
      "en-us": "Fuel Level Sensor A Circuit High",
      "sys": "排放控制",
      "knowledge": "燃油液位传感器利用油箱内的一个浮标和可变电阻的原理将油箱内的燃油液位以电信号的形式输送给电子控制模块。如果电子控制单元（ECU）发现燃油液位输入信号高于校准的最大值，该故障码会出现。"
    }
  ],
  "P0566": [
    {
      "scope": "所有汽车制造商",
      "code": "P0566",
      "zh-cn": "定速巡航系统 - OFF（关） - 信号",
      "en-us": "Cruise Control Off Signal",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。在钥匙开发动机运转（KOER）自检中，电子控制单元（ECU）发现定速巡航OFF（关）键没有被按下。故障原因包括定速巡航主开关，电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P0074": [
    {
      "scope": "所有汽车制造商",
      "code": "P0074",
      "zh-cn": "周围空气温度传感器电路间歇性故障",
      "en-us": "Ambient Air Temperature Sensor Circuit Intermittent",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "周围空气温度传感器的作用是将外部空气温度以电信号的形式传输给电子控制单元（ECU），以帮助发动机实现最佳空燃比。如果ECU检测到周围空气温度传感器信号电压突然变化，该故障码会出现。"
    }
  ],
  "P054B": [
    {
      "scope": "所有汽车制造商",
      "code": "P054B",
      "zh-cn": "冷车启动B凸轮轴位置正时过度滞后 （第1排）",
      "en-us": "Cold Start B Camshaft Position Timing Over-Retarded (Bank 1)",
      "sys": "车速及怠速控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。冷车启动时，如果电子控制单元（ECU）检测到B（排气/右/后）凸轮轴正时超过最大设定值，或者一直处于滞后状态，则该故障码会出现。"
    }
  ],
  "P0849": [
    {
      "scope": "所有汽车制造商",
      "code": "P0849",
      "zh-cn": "变速器液压力（TFP）传感器/开关B电路间歇",
      "en-us": "Transmission Fluid Pressure Sensor/Switch B Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0381": [
    {
      "scope": "所有汽车制造商",
      "code": "P0381",
      "zh-cn": "电热塞/加热器指示灯电路",
      "en-us": "Glow Plug/Heater Indicator Circuit",
      "sys": "点火系统",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。该故障码表明电热塞加热器指示灯电路发生故障。"
    }
  ],
  "P0645": [
    {
      "scope": "所有汽车制造商",
      "code": "P0645",
      "zh-cn": "空调离合器继电器控制电路",
      "en-us": "A/C Clutch Relay Control Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "空调的皮带轮在空调关闭的时候只是空转，只有当空调离合器（在电磁阀的作用下）结合时，才会带动压缩机运转。空调离合器继电器的作用就是控制离合器的分离和结合。电子控制单元（ECU）如果发现在空调离合器继电器（A/CCR）控制电路被接地时，仍然检测到明显电流存在，或者是空调离合器继电器控制电路没有被接地，而检测不到电压时，该故障码会出现。"
    }
  ],
  "P0B7A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B7A",
      "zh-cn": "混合动力电池电压监控M电路高",
      "en-us": "Hybrid Battery Voltage Sense M Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0A12": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A12",
      "zh-cn": "直流/直流转换器启用电路低",
      "en-us": "DC/DC Converter Enable Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "直流/直流转换器将HV电池的直流高压（200-400伏特）转化成12伏特电压，从而可以给辅助电池充电并给车内附件供电。"
    }
  ],
  "P0636": [
    {
      "scope": "所有汽车制造商",
      "code": "P0636",
      "zh-cn": "动力转向控制电路低",
      "en-us": "Power Steering Control Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子动力转向（EPS）系统根据车速传感器（VSS）的信号，控制动力转向活塞两侧的旁通液压油流量，从而改变方向盘上的转向力。该故障码表明电子控制单元（ECU）检测到动力转向控制电路电压低于校准的最低值。故障原因包括动力转向压力开关，其电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P0B68": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B68",
      "zh-cn": "混合动力电池电压监控J电路",
      "en-us": "Hybrid Battery Voltage Sense J Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0586": [
    {
      "scope": "所有汽车制造商",
      "code": "P0586",
      "zh-cn": "定速巡航系统通风控制电路/开路",
      "en-us": "Cruise Control Vent Control Circuit/Open",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统通过控制伺服器内的真空来控制节气门角度，从而控制车速。当需要加速时，真空电磁阀开启，与进气歧管（或专门的真空泵）相通，密封套内真空度增大，吸动膜片，克服弹簧力，通过拉线使节气门开度增大，车辆加速行驶。当达到设定车速时，真空电磁阀与通风电磁阀同时关闭，此时密封套内的真空度不变，汽车保持恒速行驶。当需要减速时，通风电磁阀打开，让空气进入密封套，膜片弹簧把膜片压回原位，节气门开度减小，于是汽车减速。P0586表明定速巡航系统通风控制电路出错。故障原因包括定速巡航系统通风口电磁阀，电路，接头等。"
    }
  ],
  "P0C86": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C86",
      "zh-cn": "混合动力电池温度传感器F/G相关性",
      "en-us": "Hybrid Battery Temperature Sensor F/G Correlation",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器F/G的信号差超出了校准的最大极限，该故障码会出现。"
    }
  ],
  "P0AE4": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AE4",
      "zh-cn": "混合动力电池预充电接触器控制电路",
      "en-us": "Hybrid Battery Precharge Contactor Control Circuit",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果混合动力汽车电子控制单元如果发现第1系统主继电器（SMR1）发生故障，该故障码会出现。"
    }
  ],
  "P0718": [
    {
      "scope": "所有汽车制造商",
      "code": "P0718",
      "zh-cn": "输入轴/涡轮速度传感器A电路间歇",
      "en-us": "Input/Turbine Speed Sensor A Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "涡轮转速传感器（TSS），也叫输入轴转速传感器（ISS），其作用是将输入轴（也就是液力变矩器）的转速以频率的形式输送给变速器控制模块（TCU）,这些信息对于调节液力变矩器锁定离合器尤为关键。该故障码表明TSS传感器信号电路突然变化。故障原因包括TSS传感器，或其电路接头故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0AD4": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AD4",
      "zh-cn": "混合动力电池组空气流动系统 - 流动空气不足",
      "en-us": "Hybrid Battery Pack Air Flow System Insufficient Air Flow",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0852": [
    {
      "scope": "所有汽车制造商",
      "code": "P0852",
      "zh-cn": "停车档（P）/空档（N）位置开关 输入电路高",
      "en-us": "Park/Neutral Switch Input Circuit High",
      "sys": "变速箱",
      "knowledge": "驻车档/空档位置开关的作用是将自动变速器在驻车档/空档，还是其他挡位的信息输送给电子控制单元（ECU），作为决定发动机怠速，还是增加负荷的参考依据。该开关也被用在起动机继电器电路中，以防止汽车在驻车档/空档之外的其他挡位启动。"
    }
  ],
  "P0A75": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A75",
      "zh-cn": "发电机W相电流",
      "en-us": "Generator Phase W Current",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控发电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0750": [
    {
      "scope": "所有汽车制造商",
      "code": "P0750",
      "zh-cn": "换档电磁阀A",
      "en-us": "Shift Solenoid A",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0B80": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B80",
      "zh-cn": "混合动力电池电压监控N电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense N Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0AE6": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AE6",
      "zh-cn": "混合动力电池预充电接触器控制电路低",
      "en-us": "Hybrid Battery Precharge Contactor Control Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果混合动力汽车电子控制单元如果发现第1系统主继电器（SMR1）发生故障，该故障码会出现。"
    }
  ],
  "P0B6A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B6A",
      "zh-cn": "混合动力电池电压监控J电路低",
      "en-us": "Hybrid Battery Voltage Sense J Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P099A": [
    {
      "scope": "所有汽车制造商",
      "code": "P099A",
      "zh-cn": "换档电磁阀G控制电路范围/性能",
      "en-us": "Shift Solenoid G Control Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0604": [
    {
      "scope": "所有汽车制造商",
      "code": "P0604",
      "zh-cn": "内部控制模块随机存取存储器（RAM）错误",
      "en-us": "Internal Control Module Random Access Memory (RAM) Error",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。故障原因包括电池电极锈蚀（导致电压不稳），电子控制模块电路故障，重新编程化故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0B3B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B3B",
      "zh-cn": "混合动力电池电压监控A电路",
      "en-us": "Hybrid Battery Voltage Sense A Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0990": [
    {
      "scope": "所有汽车制造商",
      "code": "P0990",
      "zh-cn": "变速器液压传感器/开关E电路高",
      "en-us": "Transmission Fluid Pressure Sensor/Switch E Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P045D": [
    {
      "scope": "所有汽车制造商",
      "code": "P045D",
      "zh-cn": "废气再循环B控制电路高",
      "en-us": "Exhaust Gas Recirculation B Control Circuit High",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环（EGR）阀控制电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0C70": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C70",
      "zh-cn": "混合动力电池温度传感器C/D相关性",
      "en-us": "Hybrid Battery Temperature Sensor C/D Correlation",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器C/D的信号差超出了校准的最大极限，该故障码会出现。"
    }
  ],
  "P021E": [
    {
      "scope": "所有汽车制造商",
      "code": "P021E",
      "zh-cn": "喷油器正时第11缸",
      "en-us": "Cylinder 11 Injection Timing",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器实际正时跟理想喷油正时偏差超过最大极限，该故障码会出现。"
    }
  ],
  "P0A3D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A3D",
      "zh-cn": "驱动电机B换流器温度过高",
      "en-us": "Drive Motor B Inverter Over Temperature",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。驱动电机B换流器温度传感器显示温度过高。故障原因包括电机电子冷却系统出错，变速器液液面过低，变速器或变速器控制模块出错。"
    }
  ],
  "P0251": [
    {
      "scope": "所有汽车制造商",
      "code": "P0251",
      "zh-cn": "喷油泵燃油计量控制A（凸轮/转子/喷油器）",
      "en-us": "Injection Pump Fuel Metering Control A (Cam/Rotor/Injector)",
      "sys": "燃油或空气",
      "knowledge": "故障原因包括燃油控制执行器（FCA），其电路，喷油泵，或电子控制模块（ECU）等。燃油控制执行器（FCA）一般位于喷油泵的后侧，它是一个电控电磁阀门。ECU通过循环打开和关闭FCA来控制进入喷油泵的燃油量。"
    }
  ],
  "P0BB5": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BB5",
      "zh-cn": "混合动力电池电压监控Y电路低",
      "en-us": "Hybrid Battery Voltage Sense Y Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0C7F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C7F",
      "zh-cn": "混合动力电池温度传感器G电路高",
      "en-us": "Hybrid Battery Temperature Sensor G Circuit High",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0C29": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C29",
      "zh-cn": "辅助变速器液泵驱动器电路性能",
      "en-us": "Auxiliary Transmission Fluid Pump Driver Circuit Performance",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0AFC": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AFC",
      "zh-cn": "混合动力电池组传感器模块",
      "en-us": "Hybrid Battery Pack Sensor Module",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0994": [
    {
      "scope": "所有汽车制造商",
      "code": "P0994",
      "zh-cn": "变速器液压传感器/开关F电路低",
      "en-us": "Transmission Fluid Pressure Sensor/Switch F Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0916": [
    {
      "scope": "所有汽车制造商",
      "code": "P0916",
      "zh-cn": "换档位置电路低",
      "en-us": "Gear Shift Position Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档位置（监控换档杆向前/向后的位置，奇/偶档位）电路故障。"
    }
  ],
  "P022D": [
    {
      "scope": "所有汽车制造商",
      "code": "P022D",
      "zh-cn": "增压空气冷却器旁通阀控制B电路/开路",
      "en-us": "Charge Air Cooler Bypass Control B Circuit /Open",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。增压空气冷却器旁通阀的作用是将一部分空气绕开空气冷却器。这些空气随后再跟经过空气冷却器冷却过的空气混合后进入发动机，以保证进气温度高于露水温度。如果空气冷却器旁通阀控制电路故障，该故障码会出现。"
    }
  ],
  "P0444": [
    {
      "scope": "所有汽车制造商",
      "code": "P0444",
      "zh-cn": "蒸发排放系统吹扫控制阀电路开路",
      "en-us": "Evaporative Emission System Purge Control Valve Circuit Open",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。如果电子控制单元（ECU）检测到蒸发排放系统吹扫电磁阀控制电路有开路的情况，则该故障码会出现。故障原因包括EVAP供电电路开路，EVAP电磁阀控制电路开路或短路到接地，EVAP电磁阀本身故障，EVAP炭罐泄漏，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0BC9": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BC9",
      "zh-cn": "混合动力电池组冷却风扇监控电路低",
      "en-us": "Hybrid Battery Pack Cooling Fan Sense Circuit Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0C54": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C54",
      "zh-cn": "驱动电机A位置传感器电路A间歇/不稳定",
      "en-us": "Drive Motor A Position Sensor Circuit A Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0825": [
    {
      "scope": "所有汽车制造商",
      "code": "P0825",
      "zh-cn": "变速杆推/拉开关电路（换档预测）",
      "en-us": "Gear Lever Push-Pull Switch (Shift Anticipate)",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P06A3": [
    {
      "scope": "所有汽车制造商",
      "code": "P06A3",
      "zh-cn": "传感器参考电压D电路/开路",
      "en-us": "Sensor Reference Voltage D Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到5伏参考电压电路D出错。故障原因包括5伏参考电压电路到某个传感器的电路发生短路或短路，一个或多个传感器发生短路或开路，ECU等。"
    }
  ],
  "P0558": [
    {
      "scope": "所有汽车制造商",
      "code": "P0558",
      "zh-cn": "刹车助力器压力传感器电路高",
      "en-us": "Brake Booster Pressure Sensor Circuit High",
      "sys": "车速及怠速控制",
      "knowledge": "刹车助力器应用发动机进气系统（或者是专门的真空泵）产生的真空来协助制动。刹车助力器压力传感器的作用是检测助力器里的真空压力。如果电子控制单元（ECU）检测到刹车助力器压力传感器电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P00B6": [
    {
      "scope": "所有汽车制造商",
      "code": "P00B6",
      "zh-cn": "（水箱）散热器冷却液温度/发动机冷却液温度相关性",
      "en-us": "Radiator Coolant Temperature/Engine Coolant Temperature Correlation",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "如果电子控制单元检测到（水箱）散热器冷却液温度传感器与发动机冷却液（ECT）温度的信号超过设定的最大值，该故障码会出现。"
    }
  ],
  "P07BB": [
    {
      "scope": "所有汽车制造商",
      "code": "P07BB",
      "zh-cn": "变速器驻车档位置传感器/开关B电路性能/低",
      "en-us": "Transmission Park Position Sensor/Switch B Circuit Performance/Low",
      "sys": "变速箱",
      "knowledge": "驻车档位置传感器的作用是将变速杆是否在驻车档的位置的信号输送给电子控制单元（ECU）。如果ECU检测到驻车档位置传感器电路出错，该故障码会出现。"
    }
  ],
  "P0B06": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B06",
      "zh-cn": "辅助变速器液泵电机W相电流",
      "en-us": "Auxiliary Transmission Fluid Pump Motor Phase W Current",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P099F": [
    {
      "scope": "所有汽车制造商",
      "code": "P099F",
      "zh-cn": "换档电磁阀H控制电路高",
      "en-us": "Shift Solenoid H Control Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0134": [
    {
      "scope": "所有汽车制造商",
      "code": "P0134",
      "zh-cn": "氧传感器电路无作用（第1排，传感器 1）",
      "en-us": "O2 Sensor Circuit No Activity Detected (Bank 1, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）持续监控加热氧传感器已确定氧传感器在工作。如果加热氧传感器信号值持续停留在默认值，电子控制单元（ECU）就会命令振荡的空气/燃油比以试图监测到信号值的一些变化。如果这时候ECU依然无法检测传感器的信号的变化，该故障码就会出现。故障原因包括排气歧管或排气管泄漏，氧传感器本身或其电路或接头故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0165": [
    {
      "scope": "所有汽车制造商",
      "code": "P0165",
      "zh-cn": "氧传感器电路反应太慢（第2排，传感器 3）",
      "en-us": "O2 Sensor Circuit Slow Response (Bank 2, Sensor 3)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。当电压变化速率低于校准值时，电子控制单元（ECU）就会开始修改空燃比试图提高氧传感器的电压变化速率。如果ECU已经达到了可以接受的燃油修剪限制或者已超过了可接受的燃油修剪的时间长度，而仍然没有监测到可以接受的电压变化速率的话，该故障码就会出现。故障原因包括氧传感器由于燃油中含硅而被污染，氧传感器信号电路开路，氧传感器本身故障，排气管或排气歧管泄漏，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P076E": [
    {
      "scope": "所有汽车制造商",
      "code": "P076E",
      "zh-cn": "换档电磁阀H间歇",
      "en-us": "Shift Solenoid H Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P007B": [
    {
      "scope": "所有汽车制造商",
      "code": "P007B",
      "zh-cn": "增压空气冷却器温度传感器电路范围/性能（第1排）",
      "en-us": "Charge Air Cooler Temperature Sensor Circuit",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。故障原因包括增压空气温度（CAT）传感器，电路，接头，控制模块等。"
    }
  ],
  "P0B88": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B88",
      "zh-cn": "混合动力电池电压监控P电路低",
      "en-us": "Hybrid Battery Voltage Sense P Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0289": [
    {
      "scope": "所有汽车制造商",
      "code": "P0289",
      "zh-cn": "第10缸喷油器电路高",
      "en-us": "Cylinder 10 Injector Circuit High",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第10缸喷油器控制电路电压高于校准的最高值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0B60": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B60",
      "zh-cn": "混合动力电池电压监控H电路低",
      "en-us": "Hybrid Battery Voltage Sense H Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0475": [
    {
      "scope": "所有汽车制造商",
      "code": "P0475",
      "zh-cn": "排气压力控制阀A电路",
      "en-us": "Exhaust Pressure Control Valve A Circuit",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。如果电子控制单元（ECU）检测到排气压力控制阀A电路电压超出校准的正常值，该故障码会出现。"
    }
  ],
  "P0AB5": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AB5",
      "zh-cn": "混合动力电池组空气温度传感器B电路间歇/不稳定",
      "en-us": "Hybrid Battery Pack Air Temperature Sensor B Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车的进气温度（IAT）传感器位于电池总成之内。该故障码的故障原因包括混合动力电池（进气温度（IAT）传感器），电池组控制模块等。"
    }
  ],
  "P074C": [
    {
      "scope": "所有汽车制造商",
      "code": "P074C",
      "zh-cn": "不能挂4档",
      "en-us": "Unable To Engage Gear 4",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0BFC": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BFC",
      "zh-cn": "驱动电机B，W相电流传感器电路高",
      "en-us": "Drive Motor B Phase W Current Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0963": [
    {
      "scope": "所有汽车制造商",
      "code": "P0963",
      "zh-cn": "压力控制电磁阀A控制电路高",
      "en-us": "Pressure Control Solenoid A Control Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。该故障码的原因包括压力控制电磁阀本身，电路，接头等。同时要注意，变速箱控制电磁阀故障有些情况下并不并不是因为电子问题，而是由于管路阻塞或者是机械方面的问题。好多时候，仅仅因为变速箱油太脏就会造成很多这方面的故障。"
    }
  ],
  "P0B72": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B72",
      "zh-cn": "混合动力电池电压监控L电路",
      "en-us": "Hybrid Battery Voltage Sense L Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0312": [
    {
      "scope": "所有汽车制造商",
      "code": "P0312",
      "zh-cn": "第12缸检测到失火",
      "en-us": "Cylinder 12 Misfire Detected",
      "sys": "点火系统",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。如果电子控制单元（ECU）检测到可能会对催化转换器造成破坏的失火，故障指示灯会闪烁，此时应立即关闭发动机。该故障码表明电子控制单元（ECU）检测到该气缸12失火。故障原因包括点火系统故障，燃油输送故障，进气歧管或EGR，PCV的空气泄漏，机械性气缸故障等。"
    }
  ],
  "P0767": [
    {
      "scope": "所有汽车制造商",
      "code": "P0767",
      "zh-cn": "换档电磁阀D卡在开的位置",
      "en-us": "Shift Solenoid D Stuck On",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P000A": [
    {
      "scope": "所有汽车制造商",
      "code": "P000A",
      "zh-cn": "A凸轮轴位置执行器反应太慢 （第1排）",
      "en-us": "A Camshaft Position Slow Response (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。P000A的故障原因包括进气/左/前凸轮轴调节阀（机油控制阀），其电路，接头，机油太脏或ECU。"
    }
  ],
  "P029F": [
    {
      "scope": "所有汽车制造商",
      "code": "P029F",
      "zh-cn": "燃油（空燃比）修剪在最低限 - 气缸2",
      "en-us": "Cylinder 2 - Fuel Trim at Min Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最低极限超过一定时间，该故障码会出现。"
    }
  ],
  "P0962": [
    {
      "scope": "所有汽车制造商",
      "code": "P0962",
      "zh-cn": "压力控制电磁阀A控制电路低",
      "en-us": "Pressure Control Solenoid A Control Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。该故障码的原因包括压力控制电磁阀本身，电路，接头等。同时要注意，变速箱控制电磁阀故障有些情况下并不并不是因为电子问题，而是由于管路阻塞或者是机械方面的问题。好多时候，仅仅因为变速箱油太脏就会造成很多这方面的故障。"
    }
  ],
  "P0BBE": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BBE",
      "zh-cn": "混合动力电池组电压变化",
      "en-us": "Hybrid Battery Pack Voltage Variation",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0867": [
    {
      "scope": "所有汽车制造商",
      "code": "P0867",
      "zh-cn": "变速器液压力",
      "en-us": "Transmission Fluid Pressure",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器将变速器液压力已电信号的形式输送给变速器控制模块（TCU），变速器液压力控制电磁阀负责控制变速器液压力。"
    }
  ],
  "P0014": [
    {
      "scope": "所有汽车制造商",
      "code": "P0014",
      "zh-cn": "B凸轮轴位置执行器 - 正时过前或系统性能 （第1排）",
      "en-us": "B Camshaft Position - Timing Over-Advanced or System Performance (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。P0014的故障原因包括B进气/左/前凸轮轴正时没有设定好，凸轮轴过前原理机械性卡住，或者是执行器阀门卡在开的位置。"
    }
  ],
  "P0485": [
    {
      "scope": "所有汽车制造商",
      "code": "P0485",
      "zh-cn": "风扇电源/接地电路",
      "en-us": "Fan Power/Ground Circuit",
      "sys": "排放控制",
      "knowledge": ""
    }
  ],
  "P02AD": [
    {
      "scope": "所有汽车制造商",
      "code": "P02AD",
      "zh-cn": "喷油器泄漏 - 气缸5",
      "en-us": "Cylinder 5 - Injector Leaking",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第5缸喷油器发生泄漏。"
    }
  ],
  "P0239": [
    {
      "scope": "所有汽车制造商",
      "code": "P0239",
      "zh-cn": "涡轮/超级增压器增压传感器B电路",
      "en-us": "Turbocharger/Supercharger Boost Sensor B Circuit",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。增压传感器，也叫增压压力传感器（BPS），其作用是将增压压力以电信号的形式传输给电子控制单元（ECU）。如果ECU检测到增压传感器（BPS）信号超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P0068": [
    {
      "scope": "所有汽车制造商",
      "code": "P0068",
      "zh-cn": "歧管绝对压力（MAP）/空气流量（MAF） - 节气门位置相关性",
      "en-us": "MAP/MAF - Throttle Position Correlation",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "歧管绝对压力（MAP）传感器的作用是测量进气歧管内的压力（真空度）。动力总成控制模块（PCM）然后会将进气歧管压力与大气压力之间的差值（跟发动机负荷成线性关系）作为确定喷油器基本喷油量的一个依据，以帮助发动机在不同负荷下达到最佳空燃比。空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。节气门位置（TP）传感器的作用是将节气门开度以电信号的形式输送给电子控制单元（ECU），作为控制发动机喷油的基本参数之一。如果ECU发现歧管绝对压力（MAP）传感器/空气流量（MAF）传感器跟节气门位置（TP）传感器推算的负载相差太大，则该故障码会出现。"
    }
  ],
  "P0B4D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B4D",
      "zh-cn": "混合动力电池电压监控D电路高",
      "en-us": "Hybrid Battery Voltage Sense D Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0789": [
    {
      "scope": "所有汽车制造商",
      "code": "P0789",
      "zh-cn": "换档正时电磁阀A间歇",
      "en-us": "Shift Timing Solenoid A Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0B27": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B27",
      "zh-cn": "混合动力电池B电压",
      "en-us": "Hybrid Battery B Voltage",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0278": [
    {
      "scope": "所有汽车制造商",
      "code": "P0278",
      "zh-cn": "第6缸贡献/平衡错误",
      "en-us": "Cylinder 6 Contribution/Balance",
      "sys": "燃油或空气",
      "knowledge": "电子控制单元（ECU）检测到第6缸的曲轴加速贡献低于校准值。故障原因包括第6缸喷油系统；或其它影响第6缸的发动机问题。"
    }
  ],
  "P0562": [
    {
      "scope": "所有汽车制造商",
      "code": "P0562",
      "zh-cn": "系统电压太低",
      "en-us": "System Voltage Low",
      "sys": "车速及怠速控制",
      "knowledge": "电子控制单元发现系统电压在多达5秒的时间内持续低于10伏。故障原因包括发电机故障，电池故障，电池电极锈蚀，保险丝坏掉，电压调节器故障等。"
    }
  ],
  "P0C2D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C2D",
      "zh-cn": "辅助变速器液泵控制模块回馈信号低",
      "en-us": "Auxiliary Transmission Fluid Pump Control Module Feedback Signal Low",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0205": [
    {
      "scope": "所有汽车制造商",
      "code": "P0205",
      "zh-cn": "喷油器电路/开路 - 第5缸",
      "en-us": "Injector Circuit/Open - Cylinder 5",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器控制电路出错，该故障码会出现。故障原因包括喷油器接口，电路故障，喷油器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0A64": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A64",
      "zh-cn": "驱动电机A，W相电流低",
      "en-us": "Drive Motor A Phase W Current Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0756": [
    {
      "scope": "所有汽车制造商",
      "code": "P0756",
      "zh-cn": "换档电磁阀B性能/卡在关的位置",
      "en-us": "Shift Solenoid B Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0969": [
    {
      "scope": "所有汽车制造商",
      "code": "P0969",
      "zh-cn": "压力控制电磁阀C控制电路范围/性能",
      "en-us": "Pressure Control Solenoid C Control Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。该故障码的原因包括压力控制电磁阀本身，电路，接头等。同时要注意，变速箱控制电磁阀故障有些情况下并不并不是因为电子问题，而是由于管路阻塞或者是机械方面的问题。好多时候，仅仅因为变速箱油太脏就会造成很多这方面的故障。"
    }
  ],
  "P0526": [
    {
      "scope": "所有汽车制造商",
      "code": "P0526",
      "zh-cn": "风扇速度传感器电路",
      "en-us": "Fan Speed Sensor Circuit",
      "sys": "车速及怠速控制",
      "knowledge": "故障原因包括风扇速度传感器，其电路，接头，或电子控制单元（ECU）等。"
    }
  ],
  "P0A72": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A72",
      "zh-cn": "发电机V相电流",
      "en-us": "Generator Phase V Current",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控发电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0955": [
    {
      "scope": "所有汽车制造商",
      "code": "P0955",
      "zh-cn": "自动换档手动（ASM）变速器模式（动力/冬季/运动/等）电路",
      "en-us": "Auto Shift Manual Mode Circuit",
      "sys": "变速箱",
      "knowledge": "自动换档手动变速器允许司机将变速器打入手动模式，手动控制升档或降档。"
    }
  ],
  "P0977": [
    {
      "scope": "所有汽车制造商",
      "code": "P0977",
      "zh-cn": "换档电磁阀B控制电路高",
      "en-us": "Shift Solenoid B Control Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P011A": [
    {
      "scope": "所有汽车制造商",
      "code": "P011A",
      "zh-cn": "发动机冷却液温度（ECT）传感器1/2的相关性",
      "en-us": "Engine Coolant Temperature Sensor 1/2 Correlation",
      "sys": "燃油或空气",
      "knowledge": "发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。如果ECU检测到发动机冷却液温度（ECT）传感器1跟2信号差超过了设定的最大值，该故障码会出现。"
    }
  ],
  "P0670": [
    {
      "scope": "所有汽车制造商",
      "code": "P0670",
      "zh-cn": "电热塞控制模块控制电路/开路",
      "en-us": "Glow Plug Control Module Control Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到电热塞控制模块（GPCM）电路电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P078C": [
    {
      "scope": "所有汽车制造商",
      "code": "P078C",
      "zh-cn": "换档正时电磁阀B低",
      "en-us": "Shift Timing Solenoid B Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0868": [
    {
      "scope": "所有汽车制造商",
      "code": "P0868",
      "zh-cn": "变速器液压力低",
      "en-us": "Transmission Fluid Pressure Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器将变速器液压力已电信号的形式输送给变速器控制模块（TCU），变速器液压力控制电磁阀负责控制变速器液压力。"
    }
  ],
  "P0447": [
    {
      "scope": "所有汽车制造商",
      "code": "P0447",
      "zh-cn": "蒸发排放系统通风控制电路开路",
      "en-us": "Evaporative Emission System Vent Control Circuit Open",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。如果电子控制单元（ECU）检测到蒸发排放系统通风控制电路有开路的情况，则该故障码会出现。"
    }
  ],
  "P0200": [
    {
      "scope": "所有汽车制造商",
      "code": "P0200",
      "zh-cn": "喷油器电路/开路",
      "en-us": "Injector Circuit/Open",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器控制电路出错，该故障码会出现。"
    }
  ],
  "P0C22": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C22",
      "zh-cn": "辅助变速器液泵U-V-W相电路高",
      "en-us": "Auxiliary Transmission Fluid Pump Phase U-V-W Circuit High",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0ADD": [
    {
      "scope": "所有汽车制造商",
      "code": "P0ADD",
      "zh-cn": "混合动力电池负极接触器控制电路/开路",
      "en-us": "Hybrid Battery Negative Contactor Control Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果混合动力电子控制单元发现第3系统主继电器（SMR）发生故障，该故障码会出现。"
    }
  ],
  "P0378": [
    {
      "scope": "所有汽车制造商",
      "code": "P0378",
      "zh-cn": "点火正时参考高解析信号B间歇/不稳定脉冲",
      "en-us": "Timing Reference High Resolution Signal B Intermittent/Erratic Pulses",
      "sys": "点火系统",
      "knowledge": "光学传感器通过数位于喷射泵内的传感器盘上的脉冲来为动力总成控制模块（PCM）提供高解析信号。这个信号是PCM控制燃油和正时的一个重要参考依据之一。该故障码的原因包括光学传感器，其电路，接头或PCM."
    }
  ],
  "P0206": [
    {
      "scope": "所有汽车制造商",
      "code": "P0206",
      "zh-cn": "喷油器电路/开路 - 第6缸",
      "en-us": "Injector Circuit/Open - Cylinder 6",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器控制电路出错，该故障码会出现。故障原因包括喷油器接口，电路故障，喷油器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0663": [
    {
      "scope": "所有汽车制造商",
      "code": "P0663",
      "zh-cn": "进气歧管调谐阀控制电路/开路（第2排）",
      "en-us": "Intake Manifold Tuning Valve Control Circuit/Open (Bank 2)",
      "sys": "计算机或辅助输出电路",
      "knowledge": "如果进气歧管通路（runner）的长度最佳，气门关闭所产生的压力波会帮助将油气混合物导入发动机。问题是发动机不同转速对应的最佳进气歧管通路长度也不同。歧管调谐阀（MTV）的作用就是根据发动机转速，将进气导入不同长度的进气歧管通路，以此来优化发动机在不同转速时的扭矩。如果电子控制单元（ECU）在自检时检测到进气歧管调谐阀控制电路电压超出校准正的常值，则该故障码会出现。"
    }
  ],
  "P0A57": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A57",
      "zh-cn": "驱动电机B电流传感器电路低",
      "en-us": "Drive Motor B Current Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）内部故障。"
    }
  ],
  "P0C3C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C3C",
      "zh-cn": "直流/直流换流器温度传感器A电路间歇/不稳定",
      "en-us": "DC/DC Converter Temperature Sensor A Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "直流/直流转换器将HV电池的直流高压（200-400伏特）转化成12伏特电压，从而可以给辅助电池充电并给车内附件供电。"
    }
  ],
  "P00A1": [
    {
      "scope": "所有汽车制造商",
      "code": "P00A1",
      "zh-cn": "增压空气冷却器温度传感器电路范围/性能 （第2排）",
      "en-us": "Charge Air Cooler Temperature Sensor Circuit (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。该故障码的原因包括增压空气冷却器温度传感器，其电路，或接头问题。"
    }
  ],
  "P0269": [
    {
      "scope": "所有汽车制造商",
      "code": "P0269",
      "zh-cn": "第3缸贡献/平衡错误",
      "en-us": "Cylinder 3 Contribution/Balance",
      "sys": "燃油或空气",
      "knowledge": "电子控制单元（ECU）检测到第3缸的曲轴加速贡献低于校准值。故障原因包括第3缸喷油系统；或其它影响第3缸的发动机问题。"
    }
  ],
  "P0A27": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A27",
      "zh-cn": "混合动力电池供电关闭电路",
      "en-us": "Hybrid Battery Power Off Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池供电关闭（BPO）电路发生故障。故障原因包括BPO电路，和控制模块。"
    }
  ],
  "P0581": [
    {
      "scope": "所有汽车制造商",
      "code": "P0581",
      "zh-cn": "定速巡航系统多功能输入A电路高",
      "en-us": "Cruise Control Multi-Function Input A Circuit High",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。电子控制单元（ECU）检测到定速巡航多功能输入开关A电路电压高于校准的最高值。故障原因包括多功能开关，电路，接头，机械故障等。"
    }
  ],
  "P0B62": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B62",
      "zh-cn": "混合动力电池电压监控H电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense H Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0C59": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C59",
      "zh-cn": "驱动电机B位置传感器电路A间歇/不稳定",
      "en-us": "Drive Motor B Position Sensor Circuit A Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0C38": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C38",
      "zh-cn": "直流/直流换流器温度传感器A电路",
      "en-us": "DC/DC Converter Temperature Sensor A Circuit",
      "sys": "混合动力系统",
      "knowledge": "直流/直流转换器将HV电池的直流高压（200-400伏特）转化成12伏特电压，从而可以给辅助电池充电并给车内附件供电。"
    }
  ],
  "P0529": [
    {
      "scope": "所有汽车制造商",
      "code": "P0529",
      "zh-cn": "风扇速度传感器电路间歇",
      "en-us": "Fan Speed Sensor Circuit Intermittent",
      "sys": "车速及怠速控制",
      "knowledge": "故障原因包括风扇速度传感器，其电路，接头，或电子控制单元（ECU）等。"
    }
  ],
  "P0B8C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B8C",
      "zh-cn": "混合动力电池电压监控Q电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense Q Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0784": [
    {
      "scope": "所有汽车制造商",
      "code": "P0784",
      "zh-cn": "4-5档换档",
      "en-us": "4-5 Shift",
      "sys": "变速箱",
      "knowledge": "电子控制单元（ECU）指令4-5换档，但没有检测到相应的发动机转速下降。故障原因包括换档电磁阀1故障，换档电磁阀2故障，变速器摩擦材料故障，或其他变速器内部故障。"
    }
  ],
  "P0ADF": [
    {
      "scope": "所有汽车制造商",
      "code": "P0ADF",
      "zh-cn": "混合动力电池负极接触器控制电路低",
      "en-us": "Hybrid Battery Negative Contactor Control Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果混合动力电子控制单元发现第3系统主继电器（SMR）发生故障，该故障码会出现。"
    }
  ],
  "P0A2B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A2B",
      "zh-cn": "驱动电机A温度传感器电路范围/性能",
      "en-us": "Drive Motor A Temperature Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "驱动电机A温度传感器电路发生故障。故障原因包括电路，接头，电子控制单元，驱动电机等。有些车辆的驱动电机温度传感器跟驱动电机是一体的。所以，如果确定是该温度传感器本身的问题，有可能需要换掉整个驱动电机。"
    }
  ],
  "P0AED": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AED",
      "zh-cn": "驱动电机换流器温度传感器A电路",
      "en-us": "Drive Motor Inverter Temperature Sensor A Circuit",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P070C": [
    {
      "scope": "所有汽车制造商",
      "code": "P070C",
      "zh-cn": "变速器液位传感器电路低",
      "en-us": "Transmission Fluid Level Sensor Circuit Low",
      "sys": "变速箱",
      "knowledge": "变速器液位传感器的作用是将变速器液液面以电信号的形式输送给电子控制单元（ECU）。该故障码表明变速器液位传感器信号电路电压低于校准的最低值。故障原因包括变速器液位传感器，电路，接头，或ECU。"
    }
  ],
  "P0486": [
    {
      "scope": "所有汽车制造商",
      "code": "P0486",
      "zh-cn": "废气再循环传感器B电路",
      "en-us": "Exhaust Gas Recirculation Sensor B Circuit",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环传感器B信号电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P0926": [
    {
      "scope": "所有汽车制造商",
      "code": "P0926",
      "zh-cn": "换档后拉执行器 （后拉换档杆，偶数齿轮，2,4,6）电路低",
      "en-us": "Gear Shift Reverse Actuator Circuit Low",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P081D": [
    {
      "scope": "所有汽车制造商",
      "code": "P081D",
      "zh-cn": "空档输入电路",
      "en-us": "Neutral Input Circuit",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0355": [
    {
      "scope": "所有汽车制造商",
      "code": "P0355",
      "zh-cn": "点火线圈E主/次电路",
      "en-us": "Ignition Coil E Primary/Secondary Circuit",
      "sys": "点火系统",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。电子控制单元（ECU）持续监测每个点火主电路。如果ECU没有收到有效的来自点火模块（集成在ECU）的点火诊断监控器（IDM）脉冲信号，该故障码会出现。故障原因包括点火启动/运行电路，点火线圈电路，点火线圈本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P02C2": [
    {
      "scope": "所有汽车制造商",
      "code": "P02C2",
      "zh-cn": "燃油（空燃比）修剪在最高限 - 气缸11",
      "en-us": "Cylinder 11 - Fuel Trim at Max Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最大极限超过一定时间，该故障码会出现。"
    }
  ],
  "P0875": [
    {
      "scope": "所有汽车制造商",
      "code": "P0875",
      "zh-cn": "变速器液压力（TFP）传感器/开关D电路",
      "en-us": "Transmission Fluid Pressure Sensor/Switch D Circuit",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0872": [
    {
      "scope": "所有汽车制造商",
      "code": "P0872",
      "zh-cn": "变速器液压力（TFP）传感器/开关C电路低",
      "en-us": "Transmission Fluid Pressure Sensor/Switch C Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P00BD": [
    {
      "scope": "所有汽车制造商",
      "code": "P00BD",
      "zh-cn": "空气流量（MAF）传感器A 电路范围/性能 - 空气流量太高",
      "en-us": "Mass or Volume Air Flow A Circuit Range/Performance - Air Flow Too High",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。该故障码表明由于空气流量（MAF）传感器A电路故障而导致空气流量过高。"
    }
  ],
  "P0779": [
    {
      "scope": "所有汽车制造商",
      "code": "P0779",
      "zh-cn": "压力控制电磁阀B间歇",
      "en-us": "Pressure Control Solenoid B Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。故障原因包括压力控制电磁阀控制电路，接头，或电磁阀本身。控制模块故障也会导致该故障码出现。"
    }
  ],
  "P0297": [
    {
      "scope": "所有汽车制造商",
      "code": "P0297",
      "zh-cn": "汽车处于速度过快状态",
      "en-us": "Vehicle Overspeed Condition",
      "sys": "燃油或空气",
      "knowledge": "如果电子控制单元（ECU）发现车速超出了校准的最大极限，则该故障码会出现。该故障码表明发动机在高RPM运行时间过长。这个故障码的出现表明电子控制模块已通过限制喷油器的方式临时限制发动机转速。"
    }
  ],
  "P0AEF": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AEF",
      "zh-cn": "驱动电机换流器温度传感器A电路低",
      "en-us": "Drive Motor Inverter Temperature Sensor A Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0B56": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B56",
      "zh-cn": "混合动力电池电压监控F电路低",
      "en-us": "Hybrid Battery Voltage Sense F Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0B46": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B46",
      "zh-cn": "混合动力电池电压监控C电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense C Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0084": [
    {
      "scope": "所有汽车制造商",
      "code": "P0084",
      "zh-cn": "排气阀门控制电磁阀电路 （第2排）",
      "en-us": "Exhaust Valve Control Solenoid Circuit (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。如果排气凸轮轴调节阀电路电压超出校准的最大范围，该故障码会出现。"
    }
  ],
  "P0A1A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A1A",
      "zh-cn": "发电机控制模块",
      "en-us": "Generator Control Module",
      "sys": "混合动力系统",
      "knowledge": "发电机控制模块（GCM）发生内部故障。可能故障原因包括GCM处理器，模拟转数字转化器，供电电压，串行通讯等。"
    }
  ],
  "P0793": [
    {
      "scope": "所有汽车制造商",
      "code": "P0793",
      "zh-cn": "中间轴转速传感器A电路没有信号",
      "en-us": "Intermediate Shaft Speed Sensor A Circuit No Signal",
      "sys": "变速箱",
      "knowledge": "变速器的主要部件包括位于中间轴上的行星齿轮系统。它的一端连接输入轴，另外一端连接输出轴。故障原因包括中间轴转速（ISS）传感器，电路，接头，控制模块等。"
    }
  ],
  "P0209": [
    {
      "scope": "所有汽车制造商",
      "code": "P0209",
      "zh-cn": "喷油器电路/开路 - 第9缸",
      "en-us": "Injector Circuit/Open - Cylinder 9",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器控制电路出错，该故障码会出现。故障原因包括喷油器接口，电路故障，喷油器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P07A1": [
    {
      "scope": "所有汽车制造商",
      "code": "P07A1",
      "zh-cn": "变速器摩擦衬片H检测到打滑",
      "en-us": "Transmission Friction Element H Slip Detected",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P046C": [
    {
      "scope": "所有汽车制造商",
      "code": "P046C",
      "zh-cn": "废气再循环传感器A电路范围/性能",
      "en-us": "Exhaust Gas Recirculation Sensor A Circuit Range/Performance",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。该故障码表明废气再循环传感器A信号电压出错。"
    }
  ],
  "P0699": [
    {
      "scope": "所有汽车制造商",
      "code": "P0699",
      "zh-cn": "传感器参考电压C电路高",
      "en-us": "Sensor Reference Voltage C Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到5伏参考电压电路C出错。故障原因包括5伏参考电压电路到某个传感器的电路发生短路或短路，一个或多个传感器发生短路或开路，ECU等。"
    }
  ],
  "P06B4": [
    {
      "scope": "所有汽车制造商",
      "code": "P06B4",
      "zh-cn": "传感器供电电源B电路低",
      "en-us": "Sensor Power Supply B Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": ""
    }
  ],
  "P002A": [
    {
      "scope": "所有汽车制造商",
      "code": "P002A",
      "zh-cn": "B 凸轮轴形面控制电路开路  （第1排）",
      "en-us": "B Camshaft Profile Control Circuit/Open (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。该故障码表明B（排气/右/后）凸轮轴形面控制电路发生故障。"
    }
  ],
  "P0984": [
    {
      "scope": "所有汽车制造商",
      "code": "P0984",
      "zh-cn": "换档电磁阀E控制电路范围/性能",
      "en-us": "Shift Solenoid E Control Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0419": [
    {
      "scope": "所有汽车制造商",
      "code": "P0419",
      "zh-cn": "二次空气喷射系统控制B电路",
      "en-us": "Secondary Air Injection System Control B Circuit",
      "sys": "排放控制",
      "knowledge": "在发动机刚刚启动时，二次空气喷射系统通过往排气歧管强制输入空气来氧化产生的碳氢化合物，一氧化碳等有害气体。这个过程也同时加速了催化转换器的暖化过程。如果电子控制单元（ECU）检测到二次空气喷射系统控制电磁阀电路有开路或短路的情况，该故障码会出现。"
    }
  ],
  "P0A13": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A13",
      "zh-cn": "直流/直流转换器启用电路高",
      "en-us": "DC/DC Converter Enable Circuit High",
      "sys": "混合动力系统",
      "knowledge": "直流/直流转换器将HV电池的直流高压（200-400伏特）转化成12伏特电压，从而可以给辅助电池充电并给车内附件供电。"
    }
  ],
  "P0764": [
    {
      "scope": "所有汽车制造商",
      "code": "P0764",
      "zh-cn": "换档电磁阀C间歇",
      "en-us": "Shift Solenoid C Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0019": [
    {
      "scope": "所有汽车制造商",
      "code": "P0019",
      "zh-cn": "曲轴位置/凸轮轴位置相关性 （第2排,传感器B）",
      "en-us": "Crankshaft Position - Camshaft Position Correlation (Bank 2, Sensor B)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。凸轮轴的作用是控制气门的开启和闭合。电子控制单元（ECU）会持续监控可变凸轮轴的正时位置，检查凸轮轴和曲轴之间的相对位置。如果相对位置错位超出了1个轮齿，则该故障码会出现。故障原因包括凸轮轴位置传感器本身或其电路故障，曲轴位置传感器本身或其电路故障，发动机速度传感器故障，机油被污染，可变凸轮轴电磁阀卡住等。"
    }
  ],
  "P0821": [
    {
      "scope": "所有汽车制造商",
      "code": "P0821",
      "zh-cn": "换档杆X位置传感器电路",
      "en-us": "Gear Lever X Position Circuit",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P029E": [
    {
      "scope": "所有汽车制造商",
      "code": "P029E",
      "zh-cn": "燃油（空燃比）修剪在最高限 - 气缸2",
      "en-us": "Cylinder 2 - Fuel Trim at Max Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最大极限超过一定时间，该故障码会出现。"
    }
  ],
  "P0C45": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C45",
      "zh-cn": "混合动力电池组冷却液温度传感器电路高",
      "en-us": "Hybrid Battery Pack Coolant Temperature Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P004A": [
    {
      "scope": "所有汽车制造商",
      "code": "P004A",
      "zh-cn": "涡轮/超级增压器增压控制B电路/开路",
      "en-us": "Turbocharger/Supercharger Boost Control B Circuit/Open",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。涡轮/超级增压器增压控制器的作用是当增压压力达到设定值后，气压推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮速度，控制增压水平。该故障码表明涡轮/超级增压器增压控制电路电压超出校准的正常范围。"
    }
  ],
  "P0167": [
    {
      "scope": "所有汽车制造商",
      "code": "P0167",
      "zh-cn": "氧传感器加热器电路（第2排，传感器 3）",
      "en-us": "O2 Sensor Heater Circuit (Bank 2, Sensor 3)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）持续监测加热氧传感器加热器，以确保没有开路，短路，或电流消耗过度的情况。如果电流消耗超过校准的极限，或监测到开路或短路，该故障码就会出现。故障原因包括氧传感器加热器电路，接头故障，氧传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0559": [
    {
      "scope": "所有汽车制造商",
      "code": "P0559",
      "zh-cn": "刹车助力器压力传感器电路间歇",
      "en-us": "Brake Booster Pressure Sensor Circuit Intermittent",
      "sys": "车速及怠速控制",
      "knowledge": "刹车助力器应用发动机进气系统（或者是专门的真空泵）产生的真空来协助制动。刹车助力器压力传感器的作用是检测助力器里的真空压力。如果电子控制单元（ECU）检测到刹车助力器压力传感器电路电压突然变化，该故障码会出现。"
    }
  ],
  "P0C19": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C19",
      "zh-cn": "驱动电机A输送扭力性能",
      "en-us": "Drive Motor A Torque Delivered Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0078": [
    {
      "scope": "所有汽车制造商",
      "code": "P0078",
      "zh-cn": "排气阀门控制电磁阀电路 （第1排）",
      "en-us": "Exhaust Valve Control Solenoid Circuit (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。该故障码表明排气凸轮轴调节阀发生故障。"
    }
  ],
  "P0791": [
    {
      "scope": "所有汽车制造商",
      "code": "P0791",
      "zh-cn": "中间轴转速传感器A电路",
      "en-us": "Intermediate Shaft Speed Sensor A Circuit",
      "sys": "变速箱",
      "knowledge": "变速器的主要部件包括位于中间轴上的行星齿轮系统。它的一端连接输入轴，另外一端连接输出轴。故障原因包括中间轴转速（ISS）传感器，电路，接头，控制模块等。"
    }
  ],
  "P0B4E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B4E",
      "zh-cn": "混合动力电池电压监控D电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense D Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0B9D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B9D",
      "zh-cn": "混合动力电池电压监控T电路高",
      "en-us": "Hybrid Battery Voltage Sense T Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P049A": [
    {
      "scope": "所有汽车制造商",
      "code": "P049A",
      "zh-cn": "废气再循环B流量",
      "en-us": "Exhaust Gas Recirculation B Flow",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。该故障码表明废气再循环B的流量超出了正常范围。"
    }
  ],
  "P0712": [
    {
      "scope": "所有汽车制造商",
      "code": "P0712",
      "zh-cn": "变速器液温传感器A电路低",
      "en-us": "Transmission Fluid Temperature Sensor A Circuit Low",
      "sys": "变速箱",
      "knowledge": "变速器液温度（TFT）传感器依据热敏电阻的原理将变速器液温度以电信号的形式传送到电子控制单元（ECU）。其主要作用是当温度过高时，变速器控制模块（TCU）会降挡减速。对于有些新型汽车，TCU运用此温度信号判断变速器液粘度，从而调整管路压力和电磁阀压力。如果电子控制单元（ECU）检测到变速器液温度（TFT）传感器信号电压持续低于校准最低值（温度高于157摄氏度），该故障码会出现。故障原因包括TFT传感器电路断路或短路到接地，接头故障，TFT传感器校准失调或本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0C3F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C3F",
      "zh-cn": "直流/直流换流器温度传感器B电路低",
      "en-us": "DC/DC Converter Temperature Sensor B Low",
      "sys": "混合动力系统",
      "knowledge": "直流/直流转换器将HV电池的直流高压（200-400伏特）转化成12伏特电压，从而可以给辅助电池充电并给车内附件供电。"
    }
  ],
  "P0787": [
    {
      "scope": "所有汽车制造商",
      "code": "P0787",
      "zh-cn": "换档正时电磁阀A低",
      "en-us": "Shift Timing Solenoid A Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0179": [
    {
      "scope": "所有汽车制造商",
      "code": "P0179",
      "zh-cn": "燃油成分传感器电路高",
      "en-us": "Fuel Composition Sensor Circuit High",
      "sys": "燃油或空气",
      "knowledge": "燃油组分传感器的作用是将汽油中的乙醇含量以电信号的形式传输给电子控制单元（ECU），作为修改喷油器脉冲宽度和点火正时的依据。如果ECU检测到燃油成分传感器信号电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0410": [
    {
      "scope": "所有汽车制造商",
      "code": "P0410",
      "zh-cn": "二次空气喷射系统故障",
      "en-us": "Secondary Air Injection System",
      "sys": "排放控制",
      "knowledge": "在发动机刚刚启动时，二次空气喷射系统通过往排气歧管强制输入空气来氧化产生的碳氢化合物，一氧化碳等有害气体。这个过程也同时加速了催化转换器的暖化过程。如果电子控制单元（ECU）检测到空气流量低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0619": [
    {
      "scope": "所有汽车制造商",
      "code": "P0619",
      "zh-cn": "替代燃油控制模块随机存取存储器（RAM）/只读存储器（ROM）错误",
      "en-us": "Alternative Fuel Control Module RAM/ROM Error",
      "sys": "计算机或辅助输出电路",
      "knowledge": "替代燃油控制模块故障。"
    }
  ],
  "P050F": [
    {
      "scope": "所有汽车制造商",
      "code": "P050F",
      "zh-cn": "刹车辅助真空太低",
      "en-us": "Brake Assist Vacuum Too Low",
      "sys": "车速及怠速控制",
      "knowledge": "刹车助力器应用发动机进气系统（或者是专门的真空泵）产生的真空来协助制动。刹车助力器压力传感器的作用是检测助力器里的真空压力。该故障码表明刹车助力器压力传感器检测到刹车助力器真空太低。"
    }
  ],
  "P0B79": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B79",
      "zh-cn": "混合动力电池电压监控M电路低",
      "en-us": "Hybrid Battery Voltage Sense M Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0B48": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B48",
      "zh-cn": "混合动力电池电压监控C电路高",
      "en-us": "Hybrid Battery Voltage Sense C Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P00AB": [
    {
      "scope": "所有汽车制造商",
      "code": "P00AB",
      "zh-cn": "进气温度（IAT）传感器1电路范围/性能 （第2排）",
      "en-us": "Intake Air Temperature Sensor 1 Circuit Range/Performance (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。电子控制单元（ECU）在发动机关闭一定时间（通常为6小时）后，会通过比较进气温度（IAT）传感器跟发动机冷却液温度（ECT）传感器的读数来判定进气温度（IAT）传感器的合理性。如果发动机在下次启动时进气温度（IAT）传感器的读数跟发动机冷却液温度（ECT）传感器读书的差别超过了设定校准的值（通常17℃），则该故障码会出现。"
    }
  ],
  "P07A2": [
    {
      "scope": "所有汽车制造商",
      "code": "P07A2",
      "zh-cn": "变速器摩擦衬片A性能/卡在关的位置",
      "en-us": "Transmission Friction Element A Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0344": [
    {
      "scope": "所有汽车制造商",
      "code": "P0344",
      "zh-cn": "凸轮轴位置（CMP）传感器A电路间歇 （第1排或单个传感器）",
      "en-us": "Camshaft Position Sensor A Circuit Intermittent  (Bank 1 or Single Sensor)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。如果电子控制单元（ECU）在设定的时间段内检测到A（进气/左/前）凸轮轴位置（CMP）传感器信号不稳定时，该故障码会出现。"
    }
  ],
  "P0A44": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A44",
      "zh-cn": "驱动电机A位置传感器电路超速",
      "en-us": "Drive Motor A Position Sensor Circuit Overspeed",
      "sys": "混合动力系统",
      "knowledge": "驱动电机超过了校准的最大发动机转速极限。"
    }
  ],
  "P0BCA": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BCA",
      "zh-cn": "混合动力电池组冷却风扇监控电路高",
      "en-us": "Hybrid Battery Pack Cooling Fan Sense Circuit High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0C1C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C1C",
      "zh-cn": "辅助变速器液泵控制模块内部温度传感器电路",
      "en-us": "Auxiliary Transmission Fluid Pump Control Module Internal Temperature Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "该故障码表明控制模块内部温度传感器信号电路电压超出了校准的最大范围。故障原因内部温度传感器，电路，接头，或控制模块。"
    }
  ],
  "P0740": [
    {
      "scope": "所有汽车制造商",
      "code": "P0740",
      "zh-cn": "液力变矩器离合器电路/开路",
      "en-us": "Torque Converter Clutch Circuit/Open",
      "sys": "变速箱",
      "knowledge": "液力变矩器的作用就像手动变速器里的离合器，允许来自发动机的扭力跟变速器暂时断开，从而实现平稳换档。但不同的是，液力变矩器可以起到像降挡一样的增加力扭力的作用。电子控制单元（ECU）检测到液力变矩器离合器（TCC）电磁阀控制电路输出在指定时间段里跟指令输出不一致。故障原因包括TCC执行器控制电路或接头故障，TCC执行器故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0187": [
    {
      "scope": "所有汽车制造商",
      "code": "P0187",
      "zh-cn": "燃油温度传感器B电路低入",
      "en-us": "Fuel Temperature Sensor B Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "燃油温度传感器负责监控通往燃油泵的燃油温度，以避免因温度过高（120摄氏度）造成蒸气锁现象，而造成对燃油泵或喷油器的破坏。电子控制单元（ECU）持续监测燃油温度传感器信号电压。如果这个电压在设定时间段里低于最低校准值（0.1伏或106摄氏度），则该故障码会出现。"
    }
  ],
  "P082C": [
    {
      "scope": "所有汽车制造商",
      "code": "P082C",
      "zh-cn": "换档杆X位置电路高",
      "en-us": "Gear Lever X Position Circuit High",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0C37": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C37",
      "zh-cn": "混合动力电池温度传感器F电路间歇/不稳定",
      "en-us": "Hybrid Battery Temperature Sensor F Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压突然变化，该故障码会出现。"
    }
  ],
  "P02A5": [
    {
      "scope": "所有汽车制造商",
      "code": "P02A5",
      "zh-cn": "喷油器泄漏 - 气缸3",
      "en-us": "Cylinder 3 - Injector Leaking",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第3缸喷油器发生泄漏。"
    }
  ],
  "P0286": [
    {
      "scope": "所有汽车制造商",
      "code": "P0286",
      "zh-cn": "第9缸喷油器电路高",
      "en-us": "Cylinder 9 Injector Circuit High",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第9缸喷油器控制电路电压高于校准的最高值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0AAA": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AAA",
      "zh-cn": "混合动力电池电压隔离传感器电路高",
      "en-us": "Hybrid Battery Voltage Isolation Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0654": [
    {
      "scope": "所有汽车制造商",
      "code": "P0654",
      "zh-cn": "发动机转速（RPM）输出电路",
      "en-us": "Engine RPM Output Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": ""
    }
  ],
  "P004F": [
    {
      "scope": "所有汽车制造商",
      "code": "P004F",
      "zh-cn": "涡轮/超级增压器增压控制B电路间歇/不稳定",
      "en-us": "Turbocharger/Supercharger Boost Control B Circuit Intermittent/Erratic",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。涡轮/超级增压器增压控制器的作用是当增压压力达到设定值后，气压推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮速度，控制增压水平。该故障码表明涡轮/超级增压器增压控制B电路电压突然变化。"
    }
  ],
  "P0625": [
    {
      "scope": "所有汽车制造商",
      "code": "P0625",
      "zh-cn": "发电机磁场/F-端子电路低",
      "en-us": "Generator Field/F Terminal Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）通过发电机开启信号电路来控制发电机。当需要发电机运转的时候，ECU会通过发电机开启信号电路来发送1个5伏的信号到电压调节器。电压调节器收到这个信号后便会开始控制发电机磁场电路。电子控制单元（ECU）如果发现发电机负载低于正常值，该故障码会出现。最大的可能是发电机根本没有输出。"
    }
  ],
  "P0C3A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C3A",
      "zh-cn": "直流/直流换流器温度传感器A电路低",
      "en-us": "DC/DC Converter Temperature Sensor A Low",
      "sys": "混合动力系统",
      "knowledge": "直流/直流转换器将HV电池的直流高压（200-400伏特）转化成12伏特电压，从而可以给辅助电池充电并给车内附件供电。"
    }
  ],
  "P0870": [
    {
      "scope": "所有汽车制造商",
      "code": "P0870",
      "zh-cn": "变速器液压力（TFP）传感器/开关C电路",
      "en-us": "Transmission Fluid Pressure Sensor/Switch C Circuit",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P013D": [
    {
      "scope": "所有汽车制造商",
      "code": "P013D",
      "zh-cn": "氧传感器慢响应 - （空燃比）稀到浓 （第2排，传感器 2）",
      "en-us": "O2 Sensor Slow Response - Lean to Rich (Bank 2, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。如果电子控制单元（ECU）发现在空燃比由稀变浓的过程中，没有监测到可以接受的电压变化速率的话，该故障码就会出现。"
    }
  ],
  "P0933": [
    {
      "scope": "所有汽车制造商",
      "code": "P0933",
      "zh-cn": "液压传感器电路范围/性能",
      "en-us": "Hydraulic Pressure Sensor Range/Performance",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0103": [
    {
      "scope": "所有汽车制造商",
      "code": "P0103",
      "zh-cn": "空气流量（MAF）传感器A电路高",
      "en-us": "Mass or Volume Air Flow A Circuit High",
      "sys": "燃油或空气",
      "knowledge": "空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。如果ECU检测空气流量（MAF）传感器信号电压高于校准的最高值（0.46v），该故障码会出现。故障原因包括传感器信号电路短路到正极，传感器本身，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0B13": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B13",
      "zh-cn": "混合动力电池组电流传感器A/B相关性",
      "en-us": "Hybrid Battery Pack Current Sensor A/B Correlation",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P003D": [
    {
      "scope": "所有汽车制造商",
      "code": "P003D",
      "zh-cn": "A凸轮轴形面控制卡在开启位置 （第1排）",
      "en-us": "A Camshaft Profile Control Stuck On (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。该故障码表明A（进气/左/前）凸轮轴形面控制发生故障或卡在打开位置 。"
    }
  ],
  "P0C40": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C40",
      "zh-cn": "直流/直流换流器温度传感器B电路高",
      "en-us": "DC/DC Converter Temperature Sensor B High",
      "sys": "混合动力系统",
      "knowledge": "直流/直流转换器将HV电池的直流高压（200-400伏特）转化成12伏特电压，从而可以给辅助电池充电并给车内附件供电。"
    }
  ],
  "P0338": [
    {
      "scope": "所有汽车制造商",
      "code": "P0338",
      "zh-cn": "曲轴位置（CKP）传感器A电路高",
      "en-us": "Crankshaft Position Sensor A Circuit High",
      "sys": "点火系统",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。曲轴位置（CKP）传感器(也叫上止点传感器），其作用是检测上止点（TDC）信号、曲轴转角信号和发动机转速信号，并将其输入计算机，从而使计算机能按气缸的点火顺序发出最佳点火时刻指令。如果电子控制单元（ECU）检测到曲轴传感器A电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P020E": [
    {
      "scope": "所有汽车制造商",
      "code": "P020E",
      "zh-cn": "喷油器正时 - 第5缸",
      "en-us": "Cylinder 5 Injection Timing",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器实际正时跟理想喷油正时偏差超过最大极限，该故障码会出现。"
    }
  ],
  "P0A71": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A71",
      "zh-cn": "发电机U相电流高",
      "en-us": "Generator Phase U Current High",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控发电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P072F": [
    {
      "scope": "所有汽车制造商",
      "code": "P072F",
      "zh-cn": "卡在4档",
      "en-us": "Stuck in Gear 4",
      "sys": "变速箱",
      "knowledge": "车辆行驶中，电子控制单元（ECU）检测到换档电磁阀发生发生故障（卡住）导致变速器卡在4档。故障原因包括换档电磁阀，输入轴速度传感器，输出轴速度传感器，电路，接头，控制模块，以及变速器机械故障等。"
    }
  ],
  "P0B09": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B09",
      "zh-cn": "辅助变速器液泵电机供电电压电路/开路",
      "en-us": "Auxiliary Transmission Fluid Pump Motor Supply Voltage Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0760": [
    {
      "scope": "所有汽车制造商",
      "code": "P0760",
      "zh-cn": "换档电磁阀C",
      "en-us": "Shift Solenoid C",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0AB1": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AB1",
      "zh-cn": "混合动力电池组空气温度传感器B电路",
      "en-us": "Hybrid Battery Pack Air Temperature Sensor B Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车的进气温度（IAT）传感器位于电池总成之内。该故障码的故障原因包括混合动力电池（进气温度（IAT）传感器），电池组控制模块等。"
    }
  ],
  "P07AE": [
    {
      "scope": "所有汽车制造商",
      "code": "P07AE",
      "zh-cn": "变速器摩擦衬片G性能/卡在关的位置",
      "en-us": "Transmission Friction Element G Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0AB3": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AB3",
      "zh-cn": "混合动力电池组空气温度传感器B电路低",
      "en-us": "Hybrid Battery Pack Air Temperature Sensor B Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车的进气温度（IAT）传感器位于电池总成之内。该故障码的故障原因包括混合动力电池（进气温度（IAT）传感器），电池组控制模块等。"
    }
  ],
  "P0309": [
    {
      "scope": "所有汽车制造商",
      "code": "P0309",
      "zh-cn": "第9缸检测到失火",
      "en-us": "Cylinder 9 Misfire Detected",
      "sys": "点火系统",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。如果电子控制单元（ECU）检测到可能会对催化转换器造成破坏的失火，故障指示灯会闪烁，此时应立即关闭发动机。该故障码表明电子控制单元（ECU）检测到该气缸9失火。故障原因包括点火系统故障，燃油输送故障，进气歧管或EGR，PCV的空气泄漏，机械性气缸故障等。"
    }
  ],
  "P0755": [
    {
      "scope": "所有汽车制造商",
      "code": "P0755",
      "zh-cn": "换档电磁阀B",
      "en-us": "Shift Solenoid B",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0371": [
    {
      "scope": "所有汽车制造商",
      "code": "P0371",
      "zh-cn": "点火正时参考高解析信号A太多脉冲",
      "en-us": "Timing Reference High Resolution Signal A Too Many Pulses",
      "sys": "点火系统",
      "knowledge": "光学传感器通过数位于喷射泵内的传感器盘上的脉冲来为动力总成控制模块（PCM）提供高解析信号。这个信号是PCM控制燃油和正时的一个重要参考依据之一。该故障码的原因包括光学传感器，其电路，接头或PCM."
    }
  ],
  "P0099": [
    {
      "scope": "所有汽车制造商",
      "code": "P0099",
      "zh-cn": "进气温度（IAT）传感器2电路间歇 /不稳定 （第1排）",
      "en-us": "Intake Air Temperature Sensor 2 Circuit Intermittent/Erratic (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。如果电子控制单元（ECU）检测到进气温度（IAT）传感器信号电压突然变化，该故障码会出现。"
    }
  ],
  "P0534": [
    {
      "scope": "所有汽车制造商",
      "code": "P0534",
      "zh-cn": "空调制冷剂泄漏",
      "en-us": "A/C Refrigerant Charge Loss",
      "sys": "车速及怠速控制",
      "knowledge": "电子控制单元（ECU）检测到经常的空调压缩机离合器循环，因而推断空调制冷剂发生泄漏。故障原因包括空调循环压力开关或其电路，接头故障，空调机械故障等（空调制冷剂太少，或坏掉的空调循环开关）。"
    }
  ],
  "P0A21": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A21",
      "zh-cn": "电机转矩传感器电路间歇",
      "en-us": "Motor Torque Sensor Circuit Intermittent",
      "sys": "混合动力系统",
      "knowledge": "控制模块检测到电机转矩传感器信号超出校准的正常范围。"
    }
  ],
  "P0BF5": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BF5",
      "zh-cn": "驱动电机B，V相电流传感器电路",
      "en-us": "Drive Motor B Phase V Current Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0C83": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C83",
      "zh-cn": "混合动力电池温度传感器H电路低",
      "en-us": "Hybrid Battery Temperature Sensor H Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0C0B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C0B",
      "zh-cn": "驱动电机A换流器电源供应 - 电路/开路",
      "en-us": "Drive Motor A Inverter Power Supply Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P0511": [
    {
      "scope": "所有汽车制造商",
      "code": "P0511",
      "zh-cn": "怠速空气控制电路",
      "en-us": "Idle Air Control Circuit",
      "sys": "车速及怠速控制",
      "knowledge": "怠速空气控制（IAC）阀带有一个由准确移动步进电机控制的可移动针阀。在节气门关闭的情况下，IAC阀通过改变旁通管路的空气流量，对怠速进行控制，以适应不同条件下的怠速。如果电子控制单元（ECU）检测到怠速空气控制（IAC）阀控制电路的电压超出正常范围，该故障码会出现。故障原因包括IAC控制电路，接头故障，IAC执行器故障，或电子控制模块（PCM或ECM）故障。"
    }
  ],
  "P00A7": [
    {
      "scope": "所有汽车制造商",
      "code": "P00A7",
      "zh-cn": "进气温度（IAT）传感器2电路低 （第2排）",
      "en-us": "Intake Air Temperature Sensor 2 Circuit Low (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。如果电子控制单元（ECU）检测到进气温度（IAT）传感器信号电压低于自检的最小值（0.2伏或121摄氏度），该故障码会出现。"
    }
  ],
  "P080B": [
    {
      "scope": "所有汽车制造商",
      "code": "P080B",
      "zh-cn": "升档/降挡电磁阀控制电路范围/性能",
      "en-us": "Upshift/Skip Shift Solenoid Control Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "对于一些大功率的汽车，为提高汽车的燃油效率和降低排放，当条件满足的时候（低速，小油门，车已预热等），跳档电磁阀会阻止挂入2，3档，相当于强制变速杆从1档直接换到4档。该故障码表明跳档电磁阀控制电路出错。"
    }
  ],
  "P068E": [
    {
      "scope": "所有汽车制造商",
      "code": "P068E",
      "zh-cn": "气缸8电热塞控制电路低",
      "en-us": "Cylinder 8 Glow Plug Control Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸8电热塞控制电路电压低于校准的最低值，则该故障码会出现。"
    }
  ],
  "P0728": [
    {
      "scope": "所有汽车制造商",
      "code": "P0728",
      "zh-cn": "发动机转速输入电路间歇",
      "en-us": "Engine Speed Input Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "发动机转速（也称为输入轴转速）是变速器控制模块（TCU）测定齿轮比和换档等的一个重要依据。故障原因包括发动机转速传感器，电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P0B1A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B1A",
      "zh-cn": "混合动力电池组电压监控C电路范围/性能",
      "en-us": "Hybrid Battery Pack Voltage Sense C Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P063A": [
    {
      "scope": "所有汽车制造商",
      "code": "P063A",
      "zh-cn": "发电机电压监控电路",
      "en-us": "Generator Voltage Sense Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发电机电压监控电路的作用是将发电机电压信号输送给电子控制单元（ECU），作为控制充电速度和判定发电机是否正常工作的参考依据。该故障码表明电子控制单元（ECU）检测到发电机电压监控电路出错。故障原因包括发电机电压监控电路，发电机，或ECU。"
    }
  ],
  "P0496": [
    {
      "scope": "所有汽车制造商",
      "code": "P0496",
      "zh-cn": "蒸发排放系统高吹扫流速",
      "en-us": "Evaporative Emission System High Purge Flow",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。该故障码表明蒸发排放系统的吹扫流速过高。"
    }
  ],
  "P0981": [
    {
      "scope": "所有汽车制造商",
      "code": "P0981",
      "zh-cn": "换档电磁阀D控制电路范围/性能",
      "en-us": "Shift Solenoid D Control Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0C35": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C35",
      "zh-cn": "混合动力电池温度传感器F电路低",
      "en-us": "Hybrid Battery Temperature Sensor F Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0C58": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C58",
      "zh-cn": "驱动电机B位置传感器电路A高",
      "en-us": "Drive Motor B Position Sensor Circuit A High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P075B": [
    {
      "scope": "所有汽车制造商",
      "code": "P075B",
      "zh-cn": "换档电磁阀G性能/卡在关的位置",
      "en-us": "Shift Solenoid G Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P06A0": [
    {
      "scope": "所有汽车制造商",
      "code": "P06A0",
      "zh-cn": "可变（排量）空调压缩机控制电路",
      "en-us": "Variable A/C Compressor Control Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "可变（排量）空调压缩机通过改变冲溅板的角度来控制压缩机制冷剂被压缩的排量。该故障码表明可变（排量）空调压缩机控制电路发生故障。"
    }
  ],
  "P074E": [
    {
      "scope": "所有汽车制造商",
      "code": "P074E",
      "zh-cn": "不能挂6档",
      "en-us": "Unable To Engage Gear 6",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0480": [
    {
      "scope": "所有汽车制造商",
      "code": "P0480",
      "zh-cn": "风扇1控制电路",
      "en-us": "Fan 1 Control Circuit",
      "sys": "排放控制",
      "knowledge": "电子控制单元（ECU）如果发现低速风扇控制电路在接地（风扇开）的情况下，仍有明显电流消耗；或低速风扇控制电路没有接地（风扇关），而探测不到电压时；该故障码会出现。"
    }
  ],
  "P0332": [
    {
      "scope": "所有汽车制造商",
      "code": "P0332",
      "zh-cn": "爆震传感器2电路低（第2排）",
      "en-us": "Knock Sensor 2 Circuit Low (Bank 2)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压低于校准的最低值，该故障码会出现。故障原因包括爆震传感器电路故障，爆震传感器松动，爆震传感器本身故障，所用燃油油号不正确，发动机的模部件松动，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0454": [
    {
      "scope": "所有汽车制造商",
      "code": "P0454",
      "zh-cn": "蒸发排放系统压力传感器/开关间歇",
      "en-us": "Evaporative Emission System Pressure Sensor/Switch Intermittent",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。如果电子控制单元（ECU）检测到油箱压力在0.1秒之内变化超过36厘米水柱，该故障码会出现。"
    }
  ],
  "P0BBC": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BBC",
      "zh-cn": "混合动力电池电压监控Z电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense Z Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0018": [
    {
      "scope": "所有汽车制造商",
      "code": "P0018",
      "zh-cn": "曲轴位置/凸轮轴位置相关性 （第2排,传感器A）",
      "en-us": "Crankshaft Position - Camshaft Position Correlation (Bank 2, Sensor A)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。凸轮轴的作用是控制气门的开启和闭合。电子控制单元（ECU）会持续监控可变凸轮轴的正时位置，检查凸轮轴和曲轴之间的相对位置。如果相对位置错位超出了1个轮齿，则该故障码会出现。故障原因包括凸轮轴位置传感器本身或其电路故障，曲轴位置传感器本身或其电路故障，发动机速度传感器故障，机油被污染，可变凸轮轴电磁阀卡住等。"
    }
  ],
  "P0881": [
    {
      "scope": "所有汽车制造商",
      "code": "P0881",
      "zh-cn": "变速器控制模块（TCU）电源输入信号范围/性能",
      "en-us": "TCU Power Input Signal Range/Performance",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。"
    }
  ],
  "P0971": [
    {
      "scope": "所有汽车制造商",
      "code": "P0971",
      "zh-cn": "压力控制电磁阀C控制电路高",
      "en-us": "Pressure Control Solenoid C Control Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。该故障码的原因包括压力控制电磁阀本身，电路，接头等。同时要注意，变速箱控制电磁阀故障有些情况下并不并不是因为电子问题，而是由于管路阻塞或者是机械方面的问题。好多时候，仅仅因为变速箱油太脏就会造成很多这方面的故障。"
    }
  ],
  "P0898": [
    {
      "scope": "所有汽车制造商",
      "code": "P0898",
      "zh-cn": "变速器控制系统MIL（故障指示灯）请求电路低",
      "en-us": "Transmission Control System MIL Request Circuit Low",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。如果变速器控制模块（TCM）检测到故障，就会请求动力总成控制模块（PCM）点亮故障指示灯。故障指示灯（MIL）也叫检查引擎灯，其作用是当控制模块检测到故障时，点亮仪表盘上的一个黄色或红色的发动机符号。"
    }
  ],
  "P0C55": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C55",
      "zh-cn": "驱动电机B位置传感器电路A",
      "en-us": "Drive Motor B Position Sensor Circuit A",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P083A": [
    {
      "scope": "所有汽车制造商",
      "code": "P083A",
      "zh-cn": "变速器液压力（TFP）传感器/开关G电路",
      "en-us": "Transmission Fluid Pressure Sensor/Switch G Circuit",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0A74": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A74",
      "zh-cn": "发电机V相电流高",
      "en-us": "Generator Phase V Current High",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控发电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0865": [
    {
      "scope": "所有汽车制造商",
      "code": "P0865",
      "zh-cn": "变速器控制模块（TCU）通信电路低",
      "en-us": "TCU Communication Circuit Low",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。"
    }
  ],
  "P02AE": [
    {
      "scope": "所有汽车制造商",
      "code": "P02AE",
      "zh-cn": "燃油（空燃比）修剪在最高限 - 气缸6",
      "en-us": "Cylinder 6 - Fuel Trim at Max Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最大极限超过一定时间，该故障码会出现。"
    }
  ],
  "P07A4": [
    {
      "scope": "所有汽车制造商",
      "code": "P07A4",
      "zh-cn": "变速器摩擦衬片B性能/卡在关的位置",
      "en-us": "Transmission Friction Element B Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0BF3": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BF3",
      "zh-cn": "驱动电机B，U相电流传感器电路低",
      "en-us": "Drive Motor B Phase U Current Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P04A8": [
    {
      "scope": "所有汽车制造商",
      "code": "P04A8",
      "zh-cn": "排气压力控制阀门B位置传感器/开关电路低",
      "en-us": "Exhaust Pressure Control Valve B Position Sensor/Switch Circuit Low",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。如果电子控制单元（ECU）检测到排气压力控制阀门位置传感器信号电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P00A5": [
    {
      "scope": "所有汽车制造商",
      "code": "P00A5",
      "zh-cn": "进气温度（IAT）传感器2电路 （第2排）",
      "en-us": "Intake Air Temperature Sensor 2 Circuit (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。该故障码表明进气温度（IAT）传感器信号电压超出校准的正常值。"
    }
  ],
  "P045C": [
    {
      "scope": "所有汽车制造商",
      "code": "P045C",
      "zh-cn": "废气再循环B控制电路低",
      "en-us": "Exhaust Gas Recirculation B Control Circuit Low",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环（EGR）阀控制电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0509": [
    {
      "scope": "所有汽车制造商",
      "code": "P0509",
      "zh-cn": "怠速空气控制系统电路高",
      "en-us": "Idle Air Control System Circuit High",
      "sys": "车速及怠速控制",
      "knowledge": "怠速空气控制（IAC）阀带有一个由准确移动步进电机控制的可移动针阀。在节气门关闭的情况下，IAC阀通过改变旁通管路的空气流量，对怠速进行控制，以适应不同条件下的怠速。如果电子控制单元（ECU）检测到怠速空气控制系统电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0A9B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A9B",
      "zh-cn": "混合动力电池温度传感器A电路",
      "en-us": "Hybrid Battery Temperature Sensor A Circuit",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压超出正常范围，该故障码会出现。"
    }
  ],
  "P06C3": [
    {
      "scope": "所有汽车制造商",
      "code": "P06C3",
      "zh-cn": "气缸11电热塞电路范围/性能",
      "en-us": "Cylinder 11 Glow Plug Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸11电热塞电路发生故障，则该故障码会出现。"
    }
  ],
  "P0A90": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A90",
      "zh-cn": "驱动电机A性能",
      "en-us": "Drive Motor A Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车驱动电机A故障"
    }
  ],
  "P0407": [
    {
      "scope": "所有汽车制造商",
      "code": "P0407",
      "zh-cn": "废气再循环阀传感器B电路低",
      "en-us": "Exhaust Gas Recirculation Sensor B Circuit Low",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环（EGR）传感器的信号电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0C41": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C41",
      "zh-cn": "直流/直流换流器温度传感器B电路间歇/不稳定",
      "en-us": "DC/DC Converter Temperature Sensor B Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "直流/直流转换器将HV电池的直流高压（200-400伏特）转化成12伏特电压，从而可以给辅助电池充电并给车内附件供电。"
    }
  ],
  "P0BE5": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BE5",
      "zh-cn": "驱动电机A，U相电流传感器电路",
      "en-us": "Drive Motor A Phase U Current Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P042F": [
    {
      "scope": "所有汽车制造商",
      "code": "P042F",
      "zh-cn": "废气再循环A控制卡在关的位置",
      "en-us": "Exhaust Gas Recirculation A Control Stuck Closed",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果在设定的时间段内（4秒）当指令实际废气再循环（EGR）阀位置高于30%时，实际EGR阀位置低于15%，电子控制单元就会认为EGR卡在了关的位置。"
    }
  ],
  "P07AC": [
    {
      "scope": "所有汽车制造商",
      "code": "P07AC",
      "zh-cn": "变速器摩擦衬片F性能/卡在关的位置",
      "en-us": "Transmission Friction Element F Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0220": [
    {
      "scope": "所有汽车制造商",
      "code": "P0220",
      "zh-cn": "节气门/加速踏板位置（APP）传感器/开关B电路故障",
      "en-us": "Throttle/Pedal Position Sensor/Switch B Circuit",
      "sys": "燃油或空气",
      "knowledge": "在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。该故障码表明节气门踏板位置传感器B电路电压超出校准的正常范围。"
    }
  ],
  "P029C": [
    {
      "scope": "所有汽车制造商",
      "code": "P029C",
      "zh-cn": "喷油器受限制 - 气缸1",
      "en-us": "Cylinder 1 - Injector Restricted",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第1缸喷油器性能出错。"
    }
  ],
  "P041D": [
    {
      "scope": "所有汽车制造商",
      "code": "P041D",
      "zh-cn": "废气再循环阀温度传感器B电路高",
      "en-us": "Exhaust Gas Recirculation Temperature Sensor B Circuit High",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环阀（EGR）温度传感器的信号电压在设定的时间段内（5秒）高于校准的最高值（4.95伏），该故障码会出现。"
    }
  ],
  "P0437": [
    {
      "scope": "所有汽车制造商",
      "code": "P0437",
      "zh-cn": "催化转换器温度传感器电路低 （第2排，传感器1）",
      "en-us": "Catalyst Temperature Sensor Circuit Low (Bank 2, Sensor 1)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器温度传感器电路电压低于校准的最低值。故障原因包括催化转换器温度传感器，电路，接头，或电子控制单元（ECU）故障。"
    }
  ],
  "P04A7": [
    {
      "scope": "所有汽车制造商",
      "code": "P04A7",
      "zh-cn": "排气压力控制阀门B位置传感器/开关电路范围/性能",
      "en-us": "Exhaust Pressure Control Valve B Position Sensor/Switch Circuit Range/Performance",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。如果电子控制单元（ECU）检测到排气压力控制阀门位置传感器信号电压出错，该故障码会出现。"
    }
  ],
  "P048E": [
    {
      "scope": "所有汽车制造商",
      "code": "P048E",
      "zh-cn": "排气压力控制阀门位置传感器/开关电路高",
      "en-us": "Exhaust Pressure Control Valve Position Sensor/Switch Circuit High",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。如果电子控制单元（ECU）检测到排气压力控制阀门位置传感器信号电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P023E": [
    {
      "scope": "所有汽车制造商",
      "code": "P023E",
      "zh-cn": "歧管绝对压力（传感器） - 涡轮/超级增压器增压压力传感器B相关性",
      "en-us": "Manifold Absolute Pressure - Turbocharger/Supercharger Boost Sensor B Correlation",
      "sys": "燃油或空气",
      "knowledge": "歧管绝对压力（MAP）传感器的作用是测量进气歧管内的压力（真空度）。动力总成控制模块（PCM）然后会将进气歧管压力与大气压力之间的差值（跟发动机负荷成线性关系）作为确定喷油器基本喷油量的一个依据，以帮助发动机在不同负荷下达到最佳空燃比。涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压传感器，也叫增压压力传感器（BPS），其作用是将增压压力以电信号的形式传输给电子控制单元（ECU）。如果电子控制单元（ECU）发现歧管绝对压力（MAP）传感器跟涡轮/超级增压器进口压力的信号差在设定时间段里（2.5秒）超出校准值（通常是10.35KPa），该故障码会出现。"
    }
  ],
  "P0234": [
    {
      "scope": "所有汽车制造商",
      "code": "P0234",
      "zh-cn": "涡轮/超级增压器A处于增压过度状态",
      "en-us": "Turbocharger/Supercharger A Overboost Condition",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。为防止涡轮/超级增压器过度增压，当压力到达设定的最高值时，气压会推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮转速，降低增压水平。如果废气门，或者废气门调节阀发生故障，可能会导致系统增压过度。故障原因包括失火状况超过校准的阈值，爆震传感器电路故障，低速燃油泵继电器故障，变速器油温度超过正常范围，增压器压力调节阀故障等。"
    }
  ],
  "P073B": [
    {
      "scope": "所有汽车制造商",
      "code": "P073B",
      "zh-cn": "卡在6档",
      "en-us": "Stuck in Gear 6",
      "sys": "变速箱",
      "knowledge": "车辆行驶中，电子控制单元（ECU）检测到换档电磁阀发生发生故障（卡住）导致变速器卡在6档。故障原因包括换档电磁阀，输入轴速度传感器，输出轴速度传感器，电路，接头，控制模块，以及变速器机械故障等。"
    }
  ],
  "P07B7": [
    {
      "scope": "所有汽车制造商",
      "code": "P07B7",
      "zh-cn": "变速器驻车档位置传感器/开关A电路间歇/不稳定",
      "en-us": "Transmission Park Position Sensor/Switch A Circuit Intermittent/Erratic",
      "sys": "变速箱",
      "knowledge": "驻车档位置传感器的作用是将变速杆是否在驻车档的位置的信号输送给电子控制单元（ECU）。如果ECU检测到驻车档位置传感器电路电压突然变化，该故障码会出现。"
    }
  ],
  "P02A9": [
    {
      "scope": "所有汽车制造商",
      "code": "P02A9",
      "zh-cn": "喷油器泄漏 - 气缸4",
      "en-us": "Cylinder 4 - Injector Leaking",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第4缸喷油器发生泄漏。"
    }
  ],
  "P0418": [
    {
      "scope": "所有汽车制造商",
      "code": "P0418",
      "zh-cn": "二次空气喷射系统控制A电路",
      "en-us": "Secondary Air Injection System Control A Circuit",
      "sys": "排放控制",
      "knowledge": "在发动机刚刚启动时，二次空气喷射系统（AIR通过往排气歧管强制输入空气来氧化产生的碳氢化合物，一氧化碳等有害气体。这个过程也同时加速了催化转换器的暖化过程。如果电子控制单元（ECU）检测到二次空气喷射系统控制电磁阀电路有开路或短路的情况，该故障码会出现。故障原因包括二次空气喷射系统执行器电路故障，AIR旁通电磁阀电路故障，AIR泵控制电路故障，阀故障，固态继电器故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0510": [
    {
      "scope": "所有汽车制造商",
      "code": "P0510",
      "zh-cn": "关闭节气门位置开关",
      "en-us": "Closed Throttle Position Switch",
      "sys": "车速及怠速控制",
      "knowledge": "关闭节气门位置开关（传感器）的作用是显示节气门是否完全关闭。P0510的故障码原因包括关闭节气门位置开关（传感器），节气门位置（TP）传感器（TPS），或节气门阀控制模块（TVCM）。"
    }
  ],
  "P072B": [
    {
      "scope": "所有汽车制造商",
      "code": "P072B",
      "zh-cn": "卡在倒档",
      "en-us": "Stuck In Reverse",
      "sys": "变速箱",
      "knowledge": "车辆行驶中，电子控制单元（ECU）检测到换档电磁阀发生发生故障（卡住）导致变速器卡在倒档。故障原因包括换档电磁阀，输入轴速度传感器，输出轴速度传感器，电路，接头，控制模块，以及变速器机械故障等。"
    }
  ],
  "P02A4": [
    {
      "scope": "所有汽车制造商",
      "code": "P02A4",
      "zh-cn": "喷油器受限制 - 气缸3",
      "en-us": "Cylinder 3 - Injector Restricted",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第3缸喷油器性能出错。"
    }
  ],
  "P07AA": [
    {
      "scope": "所有汽车制造商",
      "code": "P07AA",
      "zh-cn": "变速器摩擦衬片E性能/卡在关的位置",
      "en-us": "Transmission Friction Element E Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P02F0": [
    {
      "scope": "所有汽车制造商",
      "code": "P02F0",
      "zh-cn": "喷油器电路范围/性能 - 气缸3",
      "en-us": "Cylinder 3 Injector Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第3缸喷油器电路出错，该故障码会出现。"
    }
  ],
  "P0735": [
    {
      "scope": "所有汽车制造商",
      "code": "P0735",
      "zh-cn": "5档齿轮比不正确",
      "en-us": "Gear 5 Incorrect Ratio",
      "sys": "变速箱",
      "knowledge": "车辆在5档指令打开的情况下运行，电子控制单元（ECU）检测到5档齿轮比不正确。故障原因包括变速器液液位太低，换档电磁阀，变速器液压传感器，阀体内的电磁阀故障，输入轴速度传感器，输出轴速度传感器，电路，接头，变速器控制模块故障等。"
    }
  ],
  "P0542": [
    {
      "scope": "所有汽车制造商",
      "code": "P0542",
      "zh-cn": "进气加热器A电路高",
      "en-us": "Intake Air Heater A Circuit High",
      "sys": "车速及怠速控制",
      "knowledge": "进气加热器，也叫歧管进气加热器，其作用是给预热空气进气，以帮助柴油机在寒冷天气的情况下易于启动。如果电子控制单元（ECU）检测到歧管进气加热器电路（MIAH）电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P063D": [
    {
      "scope": "所有汽车制造商",
      "code": "P063D",
      "zh-cn": "发电机电压监控电路高",
      "en-us": "Generator Voltage Sense Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发电机电压监控电路的作用是将发电机电压信号输送给电子控制单元（ECU），作为控制充电速度和判定发电机是否正常工作的参考依据。该故障码表明电子控制单元（ECU）检测到发电机电压监控电路出错。故障原因包括发电机电压监控电路，发电机，或ECU。"
    }
  ],
  "P0550": [
    {
      "scope": "所有汽车制造商",
      "code": "P0550",
      "zh-cn": "动力转向压力传感器/开关电路",
      "en-us": "Power Steering Pressure Sensor/Switch Circuit",
      "sys": "车速及怠速控制",
      "knowledge": "动力转向压力（PSP）传感器根据电位器的原理将动力转向负载压力以电压信号的形式传输给电子控制单元（ECU）。如果负载压力过大，必要的时候ECU会提高发动机怠速，关闭空调压缩机，以防止发动机死火。该故障码表明动力转向压力传感器电路发生故障。"
    }
  ],
  "P0438": [
    {
      "scope": "所有汽车制造商",
      "code": "P0438",
      "zh-cn": "催化转换器温度传感器电路高 （第2排，传感器1）",
      "en-us": "Catalyst Temperature Sensor Circuit High (Bank 2, Sensor 1)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器温度传感器电路电压高于校准的最高值。故障原因包括催化转换器温度传感器，电路，接头，或电子控制单元（ECU）故障。"
    }
  ],
  "P0192": [
    {
      "scope": "所有汽车制造商",
      "code": "P0192",
      "zh-cn": "燃油分供管压力传感器A电路低",
      "en-us": "Fuel Rail Pressure Sensor A Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。电子控制单元（ECU）监控燃油分供管压力传感器的参考电压。如果这个电压在设定的时间段内持续低于校准的最低值（0.49伏），则该故障码会出现。故障原因包括燃油压力调节器阀故障，燃油压力传感器故障，燃油泵控制模块故障，燃油泵故障等。"
    }
  ],
  "P004E": [
    {
      "scope": "所有汽车制造商",
      "code": "P004E",
      "zh-cn": "涡轮/超级增压器增压控制A电路间歇/不稳定",
      "en-us": "Turbocharger/Supercharger Boost Control A Circuit Intermittent/Erratic",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。涡轮/超级增压器增压控制器的作用是当增压压力达到设定值后，气压推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮速度，控制增压水平。该故障码表明涡轮/超级增压器增压控制A电路电压突然变化。"
    }
  ],
  "P0357": [
    {
      "scope": "所有汽车制造商",
      "code": "P0357",
      "zh-cn": "点火线圈G主/次电路",
      "en-us": "Ignition Coil G Primary/Secondary Circuit",
      "sys": "点火系统",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。电子控制单元（ECU）持续监测每个点火主电路。如果ECU没有收到有效的来自点火模块（集成在ECU）的点火诊断监控器（IDM）脉冲信号，该故障码会出现。故障原因包括点火启动/运行电路，点火线圈电路，点火线圈本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0746": [
    {
      "scope": "所有汽车制造商",
      "code": "P0746",
      "zh-cn": "压力控制电磁阀A性能/卡在关的位置",
      "en-us": "Pressure Control Solenoid A Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。故障原因包括压力控制（PC）电磁阀电路，接头，或电磁阀本身。控制模块故障也可能导致该故障码出现。"
    }
  ],
  "P048B": [
    {
      "scope": "所有汽车制造商",
      "code": "P048B",
      "zh-cn": "排气压力控制阀门位置传感器/开关电路",
      "en-us": "Exhaust Pressure Control Valve Position Sensor/Switch Circuit",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。如果电子控制单元（ECU）检测到排气压力控制阀门位置传感器信号电压超出校准的正常值，该故障码会出现。"
    }
  ],
  "P0AE1": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AE1",
      "zh-cn": "混合动力电池预充电接触器电路",
      "en-us": "Hybrid Battery Precharge Contactor Circuit",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果混合动力汽车电子控制单元如果发现第1系统主继电器（SMR1）发生故障，该故障码会出现。"
    }
  ],
  "P0817": [
    {
      "scope": "所有汽车制造商",
      "code": "P0817",
      "zh-cn": "起动机禁用电路/开路",
      "en-us": "Starter Disable Circuit/Open",
      "sys": "变速箱",
      "knowledge": "造成该故障码的原因包括：1）起动机锁定电路故障；2）驻车档/空档信号输出电路故障；3）ECU/TCU电路故障。"
    }
  ],
  "P0464": [
    {
      "scope": "所有汽车制造商",
      "code": "P0464",
      "zh-cn": "燃油液位传感器A电路间歇",
      "en-us": "Fuel Level Sensor A Circuit Intermittent",
      "sys": "排放控制",
      "knowledge": "燃油液位传感器利用油箱内的一个浮标和可变电阻的原理将油箱内的燃油液位以电信号的形式输送给电子控制模块。电子控制单元（ECU）检测到燃油液位输入信号突然变化。"
    }
  ],
  "P0B67": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B67",
      "zh-cn": "混合动力电池电压监控I电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense I Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P00B8": [
    {
      "scope": "所有汽车制造商",
      "code": "P00B8",
      "zh-cn": "歧管绝对压力（MAP）传感器 - （MAP）空气流量（MAF）传感器相关性 （第2排）",
      "en-us": "MAP - Mass or Volume Air Flow Correlation (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "歧管绝对压力（MAP）传感器的作用是测量进气歧管内的压力（真空度）。动力总成控制模块（PCM）然后会将进气歧管压力与大气压力之间的差值（跟发动机负荷成线性关系）作为确定喷油器基本喷油量的一个依据，以帮助发动机在不同负荷下达到最佳空燃比。空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。如果ECU发现歧管绝对压力（MAP）传感器跟空气流量（MAF）传感器推算的负载相差太大，则该故障码会出现。"
    }
  ],
  "P037E": [
    {
      "scope": "所有汽车制造商",
      "code": "P037E",
      "zh-cn": "电热塞监控电路低",
      "en-us": "Glow Plug Sense Circuit Low",
      "sys": "点火系统",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到电热赛监控电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P07B4": [
    {
      "scope": "所有汽车制造商",
      "code": "P07B4",
      "zh-cn": "变速器驻车档位置传感器/开关A电路高",
      "en-us": "Transmission Park Position Sensor/Switch A Circuit High",
      "sys": "变速箱",
      "knowledge": "驻车档位置传感器的作用是将变速杆是否在驻车档的位置的信号输送给电子控制单元（ECU）。如果ECU检测到驻车档位置传感器电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0B3A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B3A",
      "zh-cn": "电机电子设备冷却泵B控制电路高",
      "en-us": "Motor Electronics Coolant Pump B Control Circuit High",
      "sys": "混合动力系统",
      "knowledge": "电机电子系统冷却系统（MECS）是一套独立的为变速箱（例如eCVT）电机，控制模块以及直流/直流转换器提供冷却的系统。它拥有自己的散热器，冷却液泵，冷却液温度传感器等。电机电子冷却系统冷却液泵是一个电子控制单元（ECU）控制的12伏电压电泵。"
    }
  ],
  "P0BD1": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BD1",
      "zh-cn": "驱动电机换流器温度传感器C电路",
      "en-us": "Drive Motor Inverter Temperature Sensor C Circuit",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P081C": [
    {
      "scope": "所有汽车制造商",
      "code": "P081C",
      "zh-cn": "驻车档输入电路",
      "en-us": "Park Input Circuit",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0055": [
    {
      "scope": "所有汽车制造商",
      "code": "P0055",
      "zh-cn": "热氧传感器加热器电阻 （第1排，传感器3）",
      "en-us": "HO2S Heater Resistance (Bank 1, Sensor 3)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。该故障码表明加热氧传感器加热器控制电路的电流过低或过高。"
    }
  ],
  "P099D": [
    {
      "scope": "所有汽车制造商",
      "code": "P099D",
      "zh-cn": "换档电磁阀H控制电路范围/性能",
      "en-us": "Shift Solenoid H Control Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0727": [
    {
      "scope": "所有汽车制造商",
      "code": "P0727",
      "zh-cn": "发动机转速输入电路没有信号",
      "en-us": "Engine Speed Input Circuit No Signal",
      "sys": "变速箱",
      "knowledge": "发动机转速（也称为输入轴转速）是变速器控制模块（TCU）测定齿轮比和换档等的一个重要依据。发动机运转过程中，电子控制单元（ECU）或变速器控制模块（TCU）未在CAN高速传输网络上检测到发动机转速输入信号。故障原因包括发动机转速传感器，电路，接头，传感器轮故障，或电子控制单元（ECU）。"
    }
  ],
  "P00A2": [
    {
      "scope": "所有汽车制造商",
      "code": "P00A2",
      "zh-cn": "增压空气冷却器温度传感器电路低 （第2排）",
      "en-us": "Charge Air Cooler Temperature Sensor Circuit Low (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。该故障码的原因包括增压空气冷却器温度传感器，其电路，或接头问题。"
    }
  ],
  "P0648": [
    {
      "scope": "所有汽车制造商",
      "code": "P0648",
      "zh-cn": "防盗灯控制电路",
      "en-us": "Immobilizer Lamp Control Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "防盗控制模块的作用是保证汽车仅在专用钥匙存在并且它跟各类部件相匹配的时候才会允许汽车启动。"
    }
  ],
  "P0277": [
    {
      "scope": "所有汽车制造商",
      "code": "P0277",
      "zh-cn": "第6缸喷油器电路高",
      "en-us": "Cylinder 6 Injector Circuit High",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第6缸喷油器控制电路电压高于校准的最高值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0836": [
    {
      "scope": "所有汽车制造商",
      "code": "P0836",
      "zh-cn": "四轮驱动（4WD）开关电路",
      "en-us": "Four Wheel Drive (4WD) Switch Circuit",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0B39": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B39",
      "zh-cn": "电机电子设备冷却泵B控制电路低",
      "en-us": "Motor Electronics Coolant Pump B Control Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "电机电子系统冷却系统（MECS）是一套独立的为变速箱（例如eCVT）电机，控制模块以及直流/直流转换器提供冷却的系统。它拥有自己的散热器，冷却液泵，冷却液温度传感器等。电机电子冷却系统冷却液泵是一个电子控制单元（ECU）控制的12伏电压电泵。"
    }
  ],
  "P0C48": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C48",
      "zh-cn": "混合动力电池组冷却液泵控制电路低",
      "en-us": "Hybrid Battery Pack Coolant Pump Control Circuit Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P074D": [
    {
      "scope": "所有汽车制造商",
      "code": "P074D",
      "zh-cn": "不能挂5档",
      "en-us": "Unable To Engage Gear 5",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0AAD": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AAD",
      "zh-cn": "混合动力电池组空气温度传感器A电路范围/性能",
      "en-us": "Hybrid Battery Pack Air Temperature Sensor A Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车的进气温度（IAT）传感器位于电池总成之内。该故障码的故障原因包括混合动力电池（进气温度（IAT）传感器），电池组控制模块等。"
    }
  ],
  "P00A9": [
    {
      "scope": "所有汽车制造商",
      "code": "P00A9",
      "zh-cn": "进气温度（IAT）传感器2电路间歇 /不稳定 （第2排）",
      "en-us": "Intake Air Temperature Sensor 2 Circuit Intermittent/Erratic (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。如果电子控制单元（ECU）检测到进气温度（IAT）传感器信号电压突然变化，该故障码会出现。"
    }
  ],
  "P0340": [
    {
      "scope": "所有汽车制造商",
      "code": "P0340",
      "zh-cn": "凸轮轴位置（CMP）传感器A电路 （第1排或单个传感器）",
      "en-us": "Camshaft Position Sensor A Circuit (Bank 1 or Single Sensor)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。当电子控制单元（ECU）在设定的时间段内发现未能检测到A（进气/左/前）凸轮轴位置（CMP）传感器信号时，该故障码会出现。故障原因包括凸轮轴位置（CMP）传感器电路，接头，其本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0311": [
    {
      "scope": "所有汽车制造商",
      "code": "P0311",
      "zh-cn": "第11缸检测到失火",
      "en-us": "Cylinder 11 Misfire Detected",
      "sys": "点火系统",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。如果电子控制单元（ECU）检测到可能会对催化转换器造成破坏的失火，故障指示灯会闪烁，此时应立即关闭发动机。该故障码表明电子控制单元（ECU）检测到该气缸11失火。故障原因包括点火系统故障，燃油输送故障，进气歧管或EGR，PCV的空气泄漏，机械性气缸故障等。"
    }
  ],
  "P0725": [
    {
      "scope": "所有汽车制造商",
      "code": "P0725",
      "zh-cn": "发动机转速输入电路",
      "en-us": "Engine Speed Input Circuit",
      "sys": "变速箱",
      "knowledge": "发动机转速（也称为输入轴转速）是变速器控制模块（TCU）测定齿轮比和换档等的一个重要依据。故障原因包括发动机转速传感器，电路，接头，变速器控制模块（TCM）故障，发动机控制模块故障等。"
    }
  ],
  "P0AC9": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AC9",
      "zh-cn": "混合动力电池温度传感器B电路间歇/不稳定",
      "en-us": "Hybrid Battery Temperature Sensor B Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压突然变化，该故障码会出现。"
    }
  ],
  "P0830": [
    {
      "scope": "所有汽车制造商",
      "code": "P0830",
      "zh-cn": "离合器踏板开关A电路",
      "en-us": "Clutch Pedal Switch A Circuit",
      "sys": "变速箱",
      "knowledge": "离合器踏板开关的作用是将离合器是否踩下的信息以电信号的形式输送给电子控制单元，作为控制发动机启动和定速巡航系统的重要参数。"
    }
  ],
  "P02C0": [
    {
      "scope": "所有汽车制造商",
      "code": "P02C0",
      "zh-cn": "喷油器受限制 - 气缸10",
      "en-us": "Cylinder 10 - Injector Restricted",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第10缸喷油器性能出错。"
    }
  ],
  "P0673": [
    {
      "scope": "所有汽车制造商",
      "code": "P0673",
      "zh-cn": "气缸3电热塞电路/开路",
      "en-us": "Cylinder 3 Glow Plug Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸3电热塞电路发生故障，该故障码会出现。"
    }
  ],
  "P02EA": [
    {
      "scope": "所有汽车制造商",
      "code": "P02EA",
      "zh-cn": "柴油机进气流量位置传感器电路间歇/不稳定",
      "en-us": "Diesel Intake Air Flow Position Sensor Circuit Intermittent/Erratic",
      "sys": "燃油或空气",
      "knowledge": "柴油机进气流量控制系统通过对节气门开启角度的自动控制并与切向气道或螺旋气道的配合使用来形成有效的进气涡流，同时对进气涡流的强度进行自动控制，有效地改善了发动机的燃烧，从而优化了发动机动力性，经济性等性能指标。P02EA的故障原因包括进气翻门控制执行器位置传感器，其电路，接头，或控制模块（ECM）。"
    }
  ],
  "P0622": [
    {
      "scope": "所有汽车制造商",
      "code": "P0622",
      "zh-cn": "发电机磁场/F-端子电路",
      "en-us": "Generator Field/F Terminal Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "故障原因包括发电机磁场控制电路或接头故障，发电机皮带松动，发电机调节器故障，发电机本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P071F": [
    {
      "scope": "所有汽车制造商",
      "code": "P071F",
      "zh-cn": "变速器模式开关B电路高",
      "en-us": "Transmission Mode Switch B Circuit High",
      "sys": "变速箱",
      "knowledge": "变速器模式开关的作用是根据用户选择的模式（运动/经济/冬季等）来指令变速器提前或延后换档，或高挡起步等。故障原因包括变速器模式开关，电路，接头，或控制模块。"
    }
  ],
  "P02BB": [
    {
      "scope": "所有汽车制造商",
      "code": "P02BB",
      "zh-cn": "燃油（空燃比）修剪在最低限 - 气缸9",
      "en-us": "Cylinder 9 - Fuel Trim at Min Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最低极限超过一定时间，该故障码会出现。"
    }
  ],
  "P018A": [
    {
      "scope": "所有汽车制造商",
      "code": "P018A",
      "zh-cn": "燃油压力传感器B电路",
      "en-us": "Fuel Pressure Sensor B Circuit",
      "sys": "燃油或空气",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。如果电子控制单元（ECU）检测到燃油压力传感器信号电压在设定时间段里超出了正常校准值，则该故障码会出现。"
    }
  ],
  "P0BCF": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BCF",
      "zh-cn": "发电机换流器温度传感器电路高",
      "en-us": "Generator Inverter Temperature Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P0B30": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B30",
      "zh-cn": "混合动力电池D电压不稳定",
      "en-us": "Hybrid Battery D Voltage Unstable",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0572": [
    {
      "scope": "所有汽车制造商",
      "code": "P0572",
      "zh-cn": "刹车开关A电路低",
      "en-us": "Brake Switch A Circuit Low",
      "sys": "车速及怠速控制",
      "knowledge": "刹车开关的作用是将刹车踏板踩下与否的信息以电信号的形式传送给电子控制单元（ECU），作为停止定速巡航和分离液力变矩器的重要依据。电子控制单元（ECU）发现刹车开关A电路电压持续很低（卡在开的位置）。故障原因包括刹车灯开关，其电路，或接头"
    }
  ],
  "P0255": [
    {
      "scope": "所有汽车制造商",
      "code": "P0255",
      "zh-cn": "喷油泵燃油计量控制A间歇（凸轮/转子/喷油器）",
      "en-us": "Injection Pump Fuel Metering Control A Intermittent (Cam/Rotor/Injector)",
      "sys": "燃油或空气",
      "knowledge": "故障原因包括燃油控制执行器（FCA），其电路，喷油泵，或电子控制模块（ECU）等。燃油控制执行器（FCA）一般位于喷油泵的后侧，它是一个电控电磁阀门。ECU通过循环打开和关闭FCA来控制进入喷油泵的燃油量。"
    }
  ],
  "P0B9B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B9B",
      "zh-cn": "混合动力电池电压监控T电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense T Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P041E": [
    {
      "scope": "所有汽车制造商",
      "code": "P041E",
      "zh-cn": "废气再循环阀温度传感器B电路间歇/不稳定",
      "en-us": "Exhaust Gas Recirculation Temperature Sensor B Circuit Intermittent/Erratic",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环阀（EGR）温度传感器的信号电压突然变化，该故障码会出现。"
    }
  ],
  "P0730": [
    {
      "scope": "所有汽车制造商",
      "code": "P0730",
      "zh-cn": "齿轮比不正确",
      "en-us": "Incorrect Gear Ratio",
      "sys": "变速箱",
      "knowledge": "电子控制单元（ECU）通过检查变速器控制模块（TCU）计算的液力变矩器打滑比率来监控实际齿轮位置。如果实际齿轮位置高于TCU想要的位置，打滑比率就会高于正常值。如果打滑比率高于一个设定值，该故障码会出现。"
    }
  ],
  "P0329": [
    {
      "scope": "所有汽车制造商",
      "code": "P0329",
      "zh-cn": "爆震传感器1电路间歇（第1排或单个传感器）",
      "en-us": "Knock Sensor 1 Circuit Intermittent (Bank 1 or Single Sensor)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压突然变化，该故障码会出现。"
    }
  ],
  "P0AAF": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AAF",
      "zh-cn": "混合动力电池组空气温度传感器A电路高",
      "en-us": "Hybrid Battery Pack Air Temperature Sensor A Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车的进气温度（IAT）传感器位于电池总成之内。该故障码的故障原因包括混合动力电池（进气温度（IAT）传感器），电池组控制模块等。"
    }
  ],
  "P0A39": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A39",
      "zh-cn": "发电机温度传感器电路高",
      "en-us": "Generator Temperature Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车的起动机/发电机为同一个电机，一般位于变速器内。故障原因包括发电机温度传感器，电路，接头，控制模块等。"
    }
  ],
  "P0BB6": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BB6",
      "zh-cn": "混合动力电池电压监控Y电路高",
      "en-us": "Hybrid Battery Voltage Sense Y Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P071A": [
    {
      "scope": "所有汽车制造商",
      "code": "P071A",
      "zh-cn": "变速器模式开关A电路故障",
      "en-us": "Transmission Mode Switch A Circuit",
      "sys": "变速箱",
      "knowledge": "变速器模式开关的作用是根据用户选择的模式（运动/经济/冬季等）来指令变速器提前或延后换档，或高挡起步等。故障原因包括变速器模式开关，电路，接头，或控制模块。"
    }
  ],
  "P040D": [
    {
      "scope": "所有汽车制造商",
      "code": "P040D",
      "zh-cn": "废气再循环阀温度传感器A电路高",
      "en-us": "Exhaust Gas Recirculation Temperature Sensor A Circuit High",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环阀（EGR）温度传感器的信号电压在设定的时间段内（5秒）高于校准的最高值（4.95伏），该故障码会出现。"
    }
  ],
  "P0294": [
    {
      "scope": "所有汽车制造商",
      "code": "P0294",
      "zh-cn": "第12缸喷油器电路低",
      "en-us": "Cylinder 12 Injector Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第12缸喷油器控制电路电压低于校准的最低值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0324": [
    {
      "scope": "所有汽车制造商",
      "code": "P0324",
      "zh-cn": "爆震控制系统错误",
      "en-us": "Knock Control System Error",
      "sys": "点火系统",
      "knowledge": "动力总成控制模块（PCM）利用爆震传感器探测发动机转速改变时的震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果爆震传感器的信号超出测量范围，该故障码会出现。故障原因包括爆震传感器电路故障，爆震传感器松动，爆震传感器本身故障，所用燃油油号不正确，发动机的模部件松动，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0950": [
    {
      "scope": "所有汽车制造商",
      "code": "P0950",
      "zh-cn": "自动换档手动（ASM）变速器控制电路",
      "en-us": "Auto Shift Manual Control Circuit",
      "sys": "变速箱",
      "knowledge": "自动换档手动变速器允许司机将变速器打入手动模式，手动控制升档或降档。"
    }
  ],
  "P001A": [
    {
      "scope": "所有汽车制造商",
      "code": "P001A",
      "zh-cn": "A凸轮轴形面控制电路/开路 （第1排）",
      "en-us": "A Camshaft Profile Control Circuit/Open (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。如果电子控制单元（ECU）检测到A（进气/左/前）凸轮轴形面控制电路电压在一段时间内超出了校准的正常范围，则该故障码会出现。"
    }
  ],
  "P0A0C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A0C",
      "zh-cn": "高压系统联锁电路低",
      "en-us": "High Voltage System Interlock Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "高压系统联锁的功能是：在当车辆静止时，如果安全装置有问题（举例说，充电接头或转化器没有盖好），就会关闭系统主继电器。如果控制模块检测到高压联锁电路故障，该故障码会出现。"
    }
  ],
  "P099E": [
    {
      "scope": "所有汽车制造商",
      "code": "P099E",
      "zh-cn": "换档电磁阀H控制电路低",
      "en-us": "Shift Solenoid H Control Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0ACE": [
    {
      "scope": "所有汽车制造商",
      "code": "P0ACE",
      "zh-cn": "混合动力电池温度传感器C电路间歇/不稳定",
      "en-us": "Hybrid Battery Temperature Sensor C Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压突然变化，该故障码会出现。"
    }
  ],
  "P0087": [
    {
      "scope": "所有汽车制造商",
      "code": "P0087",
      "zh-cn": "燃油分供管/系统压力 - 太低",
      "en-us": "Fuel Rail/System Pressure - Too Low",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油系统需要保持恒定的压力，油压过低则喷油器喷油太弱或不喷油，油压太高则使油路损毁或喷油器损坏。该故障码表明电子控制单元（ECU）检测到燃油分供管压力在设定的时间段内低于校准的最低值。压力过低可能是燃油泵，燃油泵控制模块，燃油压力调节器，燃油压力传感器，燃油泄漏等问题。"
    }
  ],
  "P044E": [
    {
      "scope": "所有汽车制造商",
      "code": "P044E",
      "zh-cn": "废气再循环传感器C电路间歇/不稳定",
      "en-us": "Exhaust Gas Recirculation Sensor C Circuit Intermittent/Erratic",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环（EGR）传感器信号电压突然变化，该故障码会出现。"
    }
  ],
  "P0A7A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A7A",
      "zh-cn": "发电机换流器性能",
      "en-us": "Generator Inverter Performance",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力车辆电子控制单元（HV ECU）负责监控发电机脉冲宽度调制（PWM）电路。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P06B8": [
    {
      "scope": "所有汽车制造商",
      "code": "P06B8",
      "zh-cn": "内部控制模块非易失性随机存取存储器（NVRAM）错误",
      "en-us": "Internal Control Module Non-Volatile Random Access Memory (NVRAM) Error",
      "sys": "计算机或辅助输出电路",
      "knowledge": "内部控制模块故障"
    }
  ],
  "P0141": [
    {
      "scope": "所有汽车制造商",
      "code": "P0141",
      "zh-cn": "氧传感器加热器电路（第1排，传感器 2）",
      "en-us": "O2 Sensor Heater Circuit (Bank 1, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）持续监测加热氧传感器加热器，以确保没有开路，短路，或电流消耗过度的情况。如果电流消耗超过校准的极限，或监测到开路或短路，该故障码就会出现。故障原因包括氧传感器加热器电压电路开路或加热器地线电路开路，由接头内油或湿气引起的信号交叉，氧传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0906": [
    {
      "scope": "所有汽车制造商",
      "code": "P0906",
      "zh-cn": "门选择位置电路低",
      "en-us": "Gate Select Position Circuit Low",
      "sys": "变速箱",
      "knowledge": "门选择位置（监控换档杆左/右位置）电路故障。"
    }
  ],
  "P0B49": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B49",
      "zh-cn": "混合动力电池电压监控C电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense C Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0275": [
    {
      "scope": "所有汽车制造商",
      "code": "P0275",
      "zh-cn": "第5缸贡献/平衡错误",
      "en-us": "Cylinder 5 Contribution/Balance",
      "sys": "燃油或空气",
      "knowledge": "电子控制单元（ECU）检测到第5缸的曲轴加速贡献低于校准值。故障原因包括第5缸喷油系统；或其它影响第5缸的发动机问题。"
    }
  ],
  "P0669": [
    {
      "scope": "所有汽车制造商",
      "code": "P0669",
      "zh-cn": "动力总成控制模块（PCM）/发动机控制模块（ECM）/变速器控制模块（TCU）内部温度传感器A电路高",
      "en-us": "PCM/ECM/TCU Internal Temperature Sensor A Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。该故障码表明控制模块内部温度传感器信号电路电压高于校准的最高值。故障原因内部温度传感器，电路，接头，或控制模块。"
    }
  ],
  "P0425": [
    {
      "scope": "所有汽车制造商",
      "code": "P0425",
      "zh-cn": "催化转换器温度传感器电路 （第1排，传感器1）",
      "en-us": "Catalyst Temperature Sensor Circuit (Bank 1, Sensor 1)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器温度传感器电路出错。故障原因包括催化转换器温度传感器，电路，接头，或电子控制单元（ECU）故障。"
    }
  ],
  "P045E": [
    {
      "scope": "所有汽车制造商",
      "code": "P045E",
      "zh-cn": "废气再循环B控制卡在开的位置",
      "en-us": "Exhaust Gas Recirculation B Control Stuck Open",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果在设定的时间段内（4秒）指令废气再循环（EGR）阀位置低于15%时，而实际EGR阀位置超过30%，电子控制单元就会认为EGR卡在了开的位置。"
    }
  ],
  "P0A5D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A5D",
      "zh-cn": "驱动电机A，U相电流",
      "en-us": "Drive Motor A Phase U Current",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0101": [
    {
      "scope": "所有汽车制造商",
      "code": "P0101",
      "zh-cn": "空气流量（MAF）传感器A电路范围/性能问题",
      "en-us": "Mass or Volume Air Flow A Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。如果ECU检测空气流量（MAF）传感器信号电压出错，该故障码会出现。故障原因包括空气流量（MAF）传感器电路，接头，或本身故障；电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0710": [
    {
      "scope": "所有汽车制造商",
      "code": "P0710",
      "zh-cn": "变速器液温传感器A电路",
      "en-us": "Transmission Fluid Temperature Sensor A Circuit",
      "sys": "变速箱",
      "knowledge": "变速器液温度（TFT）传感器依据热敏电阻的原理将变速器液温度以电信号的形式传送到电子控制单元（ECU）。其主要作用是当温度过高时，变速器控制模块（TCU）会降挡减速。对于有些新型汽车，TCU运用此温度信号判断变速器液粘度，从而调整管路压力和电磁阀压力。如果ECU检测到变速器液温度（TFT）传感器信号电压超出正常范围，该故障码会出现。故障原因包括变速器液液位太低或变质太脏，变速器液温度（TFT）传感器或其电路接头故障，变速器液温度（TFT）传感器校准错误，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0A04": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A04",
      "zh-cn": "电机电子系统冷却液温度传感器电路间歇",
      "en-us": "Motor Electronics Coolant Temperature Sensor Circuit Intermittent",
      "sys": "混合动力系统",
      "knowledge": "电机电子系统冷却系统（MECS）是一套独立的为变速箱（例如eCVT）电机，控制模块以及直流/直流转换器提供冷却的系统。它拥有自己的散热器，冷却液泵，冷却液温度传感器等。电机电子系统冷却液温度（MECT）传感器运用热敏电阻的原理将电机电子系统冷却液的温度以电子形式输送给电子控制单元（ECU）。如果控制模块检测到测得的电机电子系统冷却液温度（MECT）传感器电压在短时间内骤然变化，该故障码会出现。"
    }
  ],
  "P0B3C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B3C",
      "zh-cn": "混合动力电池电压监控A电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense A Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P024C": [
    {
      "scope": "所有汽车制造商",
      "code": "P024C",
      "zh-cn": "增压空气冷却器旁通阀位置传感器A电路",
      "en-us": "Charge Air Cooler Bypass Position Sensor A Circuit",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。增压空气冷却器旁通阀的作用是将一部分空气绕开空气冷却器。这些空气随后再跟经过空气冷却器冷却过的空气混合后进入发动机，以保证进气温度高于露水温度。如果空气冷却器旁通阀位置传感器A发生故障，该故障码会出现。"
    }
  ],
  "P0745": [
    {
      "scope": "所有汽车制造商",
      "code": "P0745",
      "zh-cn": "压力控制电磁阀A",
      "en-us": "Pressure Control Solenoid A",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。该故障码的故障原因包括压力控制（PC）电磁阀电路，接头，或电磁阀本身故障。控制模块故障也可能导致该故障码出现。"
    }
  ],
  "P0219": [
    {
      "scope": "所有汽车制造商",
      "code": "P0219",
      "zh-cn": "发动机处于过速状态",
      "en-us": "Engine Overspeed Condition",
      "sys": "燃油或空气",
      "knowledge": "电子控制单元（ECU）检测到发动机转速超出了校准的最大极限。故障愿因包括发动机在错误的档位上运行，发动机在空档高速运行，车轮在湿地或雪地上高速打滑。"
    }
  ],
  "P042E": [
    {
      "scope": "所有汽车制造商",
      "code": "P042E",
      "zh-cn": "废气再循环A控制卡在开的位置",
      "en-us": "Exhaust Gas Recirculation A Control Stuck Open",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果在设定的时间段内（4秒）指令废气再循环（EGR）阀位置低于15%时，而实际EGR阀位置超过30%，电子控制单元就会认为EGR卡在了开的位置。"
    }
  ],
  "P0BD8": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BD8",
      "zh-cn": "驱动电机换流器温度传感器D电路低",
      "en-us": "Drive Motor Inverter Temperature Sensor D Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0757": [
    {
      "scope": "所有汽车制造商",
      "code": "P0757",
      "zh-cn": "换档电磁阀B卡在开的位置",
      "en-us": "Shift Solenoid B Stuck On",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0966": [
    {
      "scope": "所有汽车制造商",
      "code": "P0966",
      "zh-cn": "压力控制电磁阀B控制电路低",
      "en-us": "Pressure Control Solenoid B Control Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。该故障码的原因包括压力控制电磁阀本身，电路，接头等。同时要注意，变速箱控制电磁阀故障有些情况下并不并不是因为电子问题，而是由于管路阻塞或者是机械方面的问题。好多时候，仅仅因为变速箱油太脏就会造成很多这方面的故障。"
    }
  ],
  "P0A88": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A88",
      "zh-cn": "14伏电源模块电流传感器电路低",
      "en-us": "14 Volt Power Module Current Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P009D": [
    {
      "scope": "所有汽车制造商",
      "code": "P009D",
      "zh-cn": "燃油压力释放控制电路高",
      "en-us": "Fuel Pressure Relief Control Circuit High",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油系统过压释放阀的作用是在燃油管路因为滤清器太脏，管路阻塞等引起管路压力过大时，释放燃油管路压力。如果燃油压力释放控制电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0996": [
    {
      "scope": "所有汽车制造商",
      "code": "P0996",
      "zh-cn": "变速器液压传感器/开关F电路间歇",
      "en-us": "Transmission Fluid Pressure Sensor/Switch F Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0429": [
    {
      "scope": "所有汽车制造商",
      "code": "P0429",
      "zh-cn": "催化转换器加热器控制电路 （第1排）",
      "en-us": "Catalyst Heater Control Circuit (Bank 1)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器加热器电路发生故障。"
    }
  ],
  "P0314": [
    {
      "scope": "所有汽车制造商",
      "code": "P0314",
      "zh-cn": "单缸失火（气缸不指定）",
      "en-us": "Single Cylinder Misfire (Cylinder not Specified)",
      "sys": "点火系统",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。如果电子控制单元（ECU）检测到可能会对催化转换器造成破坏的失火，故障指示灯会闪烁，此时应立即关闭发动机。该故障码表明不确定的某一气缸发生失火。"
    }
  ],
  "P0729": [
    {
      "scope": "所有汽车制造商",
      "code": "P0729",
      "zh-cn": "6档齿轮比不正确",
      "en-us": "Gear 6 Incorrect Ratio",
      "sys": "变速箱",
      "knowledge": "车辆在6档指令打开的情况下运行，电子控制单元（ECU）检测到6档齿轮比不正确。故障原因包括变速器液液位太低，换档电磁阀，变速器液压传感器，阀体内的电磁阀故障，输入轴速度传感器，输出轴速度传感器，电路，接头，变速器控制模块故障等。"
    }
  ],
  "P051B": [
    {
      "scope": "所有汽车制造商",
      "code": "P051B",
      "zh-cn": "曲轴箱压力传感器电路范围/性能",
      "en-us": "Crankcase Pressure Sensor Circuit Range/Performance",
      "sys": "车速及怠速控制",
      "knowledge": "曲轴箱压力传感器的作用是将曲轴箱内的压力以电信号的形式输送给电子控制单元（ECU），以检测曲轴箱强制通风系统的工作状态。该故障码表明ECU检测到曲轴箱压力传感器电路故障。"
    }
  ],
  "P0B50": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B50",
      "zh-cn": "混合动力电池电压监控E电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense E Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0432": [
    {
      "scope": "所有汽车制造商",
      "code": "P0432",
      "zh-cn": "主催化转换器效能低于阈值（第2排）",
      "en-us": "Main Catalyst Efficiency Below Threshold (Bank 2)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明主催化转换器效能低于设定的最低极限。故障原因包括催化转换器，氧传感器，以及电路，接头等。"
    }
  ],
  "P0B93": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B93",
      "zh-cn": "混合动力电池电压监控R电路高",
      "en-us": "Hybrid Battery Voltage Sense R Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0548": [
    {
      "scope": "所有汽车制造商",
      "code": "P0548",
      "zh-cn": "排气温度传感器电路低（第2排，传感器1）",
      "en-us": "Exhaust Gas Temperature Sensor Circuit Low (Bank 2, Sensor 1)",
      "sys": "车速及怠速控制",
      "knowledge": "排气温度传感器的作用是将排气温度以电信号的形式输送给电子控制单元（ECU）。正确的空燃比产生的排气温度比过浓或过稀空燃比产生的排气温度要低。过高排气温度（>160摄氏度）会对发动机造成破坏。如果电子控制单元（ECU）检测到排气温度传感器信号电压在设定的时间段（15秒）内低于0.1伏（也可能是0.2伏），该故障码会出现。"
    }
  ],
  "P02D8": [
    {
      "scope": "所有汽车制造商",
      "code": "P02D8",
      "zh-cn": "喷油器补偿学习在最低限气缸7",
      "en-us": "Cylinder 7 Fuel Injector Offset Learning At Min Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第7缸喷油器补偿学习已经达到了最低学习极限，该故障码会出现。"
    }
  ],
  "P0C57": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C57",
      "zh-cn": "驱动电机B位置传感器电路A低",
      "en-us": "Drive Motor B Position Sensor Circuit A Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P02B8": [
    {
      "scope": "所有汽车制造商",
      "code": "P02B8",
      "zh-cn": "喷油器受限制 - 气缸8",
      "en-us": "Cylinder 8 - Injector Restricted",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第8缸喷油器性能出错。"
    }
  ],
  "P06AB": [
    {
      "scope": "所有汽车制造商",
      "code": "P06AB",
      "zh-cn": "动力总成控制模块（PCM）/发动机控制模块（ECM）/变速器控制模块（TCU）内部温度传感器B电路",
      "en-us": "PCM/ECM/TCU Internal Temperature Sensor B Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。该故障码表明控制模块内部温度传感器信号电路电压超出了校准的最大范围。故障原因内部温度传感器，电路，接头，或控制模块。"
    }
  ],
  "P072E": [
    {
      "scope": "所有汽车制造商",
      "code": "P072E",
      "zh-cn": "卡在3档",
      "en-us": "Stuck in Gear 3",
      "sys": "变速箱",
      "knowledge": "车辆行驶中，电子控制单元（ECU）检测到换档电磁阀发生发生故障（卡住）导致变速器卡在3档。故障原因包括换档电磁阀，输入轴速度传感器，输出轴速度传感器，电路，接头，控制模块，以及变速器机械故障等。"
    }
  ],
  "P0B95": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B95",
      "zh-cn": "混合动力电池电压监控S电路",
      "en-us": "Hybrid Battery Voltage Sense S Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P00B9": [
    {
      "scope": "所有汽车制造商",
      "code": "P00B9",
      "zh-cn": "低压燃油系统压力 - 太低， 周围温度低",
      "en-us": "Low Pressure Fuel System Pressure - Too Low, Low Ambient Temperature",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "低压燃油泵（40-95psi）的作用是将汽油从油箱送往高压燃油泵。凸轮轴驱动的高压燃油泵可以将汽油加压到最高1900psi。燃油系统需要保持恒定的压力，油压过低则喷油器喷油太弱或不喷油，油压太高则使油路损毁或喷油器损坏。该故障码表明电子控制单元（ECU）检测到燃油压力过低。压力过低可能是燃油泵，燃油泵控制模块，燃油压力调节器，燃油压力传感器，燃油泄漏等问题。"
    }
  ],
  "P066F": [
    {
      "scope": "所有汽车制造商",
      "code": "P066F",
      "zh-cn": "气缸3电热塞控制电路高",
      "en-us": "Cylinder 3 Glow Plug Control Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸3电热塞电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0AC6": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AC6",
      "zh-cn": "混合动力电池温度传感器B电路范围/性能",
      "en-us": "Hybrid Battery Temperature Sensor B Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路出错，该故障码会出现。"
    }
  ],
  "P0958": [
    {
      "scope": "所有汽车制造商",
      "code": "P0958",
      "zh-cn": "自动换档手动（ASM）变速器模式（动力/冬季/运动/等）电路高",
      "en-us": "Auto Shift Manual Mode Circuit High",
      "sys": "变速箱",
      "knowledge": "自动换档手动变速器允许司机将变速器打入手动模式，手动控制升档或降档。"
    }
  ],
  "P0A3C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A3C",
      "zh-cn": "驱动电机A换流器温度过高",
      "en-us": "Drive Motor A Inverter Over Temperature",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。驱动电机A换流器温度传感器显示温度过高。故障原因包括电机电子冷却系统出错，变速器液液面过低，变速器或变速器控制模块出错。"
    }
  ],
  "P007D": [
    {
      "scope": "所有汽车制造商",
      "code": "P007D",
      "zh-cn": "增压空气冷却器温度传感器电路高（第1排）",
      "en-us": "Charge Air Cooler Temperature Sensor Circuit High (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。故障原因包括增压空气温度（CAT）传感器，电路，接头，控制模块等。"
    }
  ],
  "P0927": [
    {
      "scope": "所有汽车制造商",
      "code": "P0927",
      "zh-cn": "换档后拉执行器 （后拉换档杆，偶数齿轮，2,4,6）电路高",
      "en-us": "Gear Shift Reverse Actuator Circuit High",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0A46": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A46",
      "zh-cn": "驱动电机B位置传感器电路范围/性能",
      "en-us": "Drive Motor B Position Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括驱动电机B位置传感器电路，接头，或传感器本身；混合动力驱动电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P0616": [
    {
      "scope": "所有汽车制造商",
      "code": "P0616",
      "zh-cn": "起动机继电器电路低",
      "en-us": "Starter Relay Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "起动机继电器（电磁阀）的工作原理是，当点火开关打开时，小电流经过一个电磁线圈，导致一对更大的接触器结合，从而允许大电流经过动电机，而启动发动机。该故障码表明起动机继电器电路电压低于校准的最低值。故障原因包括起动机，其电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P092A": [
    {
      "scope": "所有汽车制造商",
      "code": "P092A",
      "zh-cn": "换档锁止电磁阀/执行器控制电路B/开路",
      "en-us": "Gear Shift Lock Solenoid/Actuator Control Circuit B/Open",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0AC4": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AC4",
      "zh-cn": "混合动力总成控制模块请求点亮故障指示灯（MIL）",
      "en-us": "Hybrid Powertrain Control Module Requested MIL Illumination",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0369": [
    {
      "scope": "所有汽车制造商",
      "code": "P0369",
      "zh-cn": "凸轮轴位置（CMP）传感器B电路间歇 （第1排）",
      "en-us": "Camshaft Position Sensor B Circuit Intermittent (Bank 1)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。如果电子控制单元（ECU）检测到B（排气/右/后）凸轮轴位置（CMP）传感器信号不稳定时，该故障码会出现。"
    }
  ],
  "P06C4": [
    {
      "scope": "所有汽车制造商",
      "code": "P06C4",
      "zh-cn": "气缸12电热塞电路范围/性能",
      "en-us": "Cylinder 12 Glow Plug Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸12电热塞电路发生故障，则该故障码会出现。"
    }
  ],
  "P0BFD": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BFD",
      "zh-cn": "驱动电机A，U-V-W相电流传感器相关性",
      "en-us": "Drive Motor A Phase U-V-W Current Sensor Correlation",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0960": [
    {
      "scope": "所有汽车制造商",
      "code": "P0960",
      "zh-cn": "压力控制电磁阀A控制电路/开路",
      "en-us": "Pressure Control Solenoid A Control Circuit/Open",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。该故障码的原因包括压力控制电磁阀本身，电路，接头等。同时要注意，变速箱控制电磁阀故障有些情况下并不并不是因为电子问题，而是由于管路阻塞或者是机械方面的问题。好多时候，仅仅因为变速箱油太脏就会造成很多这方面的故障。"
    }
  ],
  "P0B05": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B05",
      "zh-cn": "辅助变速器液泵电机V相电流高",
      "en-us": "Auxiliary Transmission Fluid Pump Motor Phase V Current High",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P042C": [
    {
      "scope": "所有汽车制造商",
      "code": "P042C",
      "zh-cn": "催化转换器温度传感器电路低 （第1排，传感器2）",
      "en-us": "Catalyst Temperature Sensor Circuit Low (Bank 1, Sensor 2)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器温度传感器电路电压低于校准的最低值。故障原因包括催化转换器温度传感器，电路，接头，或电子控制单元（ECU）故障。"
    }
  ],
  "P02A2": [
    {
      "scope": "所有汽车制造商",
      "code": "P02A2",
      "zh-cn": "燃油（空燃比）修剪在最高限 - 气缸3",
      "en-us": "Cylinder 3 - Fuel Trim at Max Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最大极限超过一定时间，该故障码会出现。"
    }
  ],
  "P083C": [
    {
      "scope": "所有汽车制造商",
      "code": "P083C",
      "zh-cn": "变速器液压力（TFP）传感器/开关G电路低",
      "en-us": "Transmission Fluid Pressure Sensor/Switch G Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0B37": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B37",
      "zh-cn": "高压服务断开电路/开路",
      "en-us": "High Voltage Service Disconnect Circuit Open",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0BE4": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BE4",
      "zh-cn": "驱动电机换流器温度传感器F电路间歇/不稳定",
      "en-us": "Drive Motor Inverter Temperature Sensor F Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0675": [
    {
      "scope": "所有汽车制造商",
      "code": "P0675",
      "zh-cn": "气缸5电热塞电路/开路",
      "en-us": "Cylinder 5 Glow Plug Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸5电热塞电路发生故障，该故障码会出现。"
    }
  ],
  "P0556": [
    {
      "scope": "所有汽车制造商",
      "code": "P0556",
      "zh-cn": "刹车助力器压力传感器电路范围/性能",
      "en-us": "Brake Booster Pressure Sensor Circuit Range/Performance",
      "sys": "车速及怠速控制",
      "knowledge": "刹车助力器应用发动机进气系统（或者是专门的真空泵）产生的真空来协助制动。刹车助力器压力传感器的作用是检测助力器里的真空压力。该故障码表明刹车助力器压力传感器电路故障。"
    }
  ],
  "P088B": [
    {
      "scope": "所有汽车制造商",
      "code": "P088B",
      "zh-cn": "变速器液过滤器非常恶化",
      "en-us": "Transmission Fluid Filter Very Deteriorated",
      "sys": "变速箱",
      "knowledge": "建议更换变速器液滤清器。"
    }
  ],
  "P029B": [
    {
      "scope": "所有汽车制造商",
      "code": "P029B",
      "zh-cn": "燃油（空燃比）修剪在最低限 - 气缸1",
      "en-us": "Cylinder 1 - Fuel Trim at Min Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最低极限超过一定时间，该故障码会出现。"
    }
  ],
  "P0887": [
    {
      "scope": "所有汽车制造商",
      "code": "P0887",
      "zh-cn": "变速器控制模块（TCU）电源继电器控制电路高",
      "en-us": "TCU Power Relay Control Circuit High",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。控制模块继电器的作用是在点火开关关闭以后，继续保持控制模块的供电，直到控制模块完成关闭过程。"
    }
  ],
  "P065A": [
    {
      "scope": "所有汽车制造商",
      "code": "P065A",
      "zh-cn": "发电机系统性能",
      "en-us": "Generator System Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": ""
    }
  ],
  "P0765": [
    {
      "scope": "所有汽车制造商",
      "code": "P0765",
      "zh-cn": "换档电磁阀D",
      "en-us": "Shift Solenoid D",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P070B": [
    {
      "scope": "所有汽车制造商",
      "code": "P070B",
      "zh-cn": "变速器液位传感器电路范围/性能",
      "en-us": "Transmission Fluid Level Sensor Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "变速器液位传感器的作用是将变速器液液面以电信号的形式输送给电子控制单元（ECU）。该故障码表明变速器液位传感器信号电路故障。故障原因包括变速器液位传感器，电路，接头，或ECU。"
    }
  ],
  "P042B": [
    {
      "scope": "所有汽车制造商",
      "code": "P042B",
      "zh-cn": "催化转换器温度传感器电路范围/性能 （第1排，传感器2）",
      "en-us": "Catalyst Temperature Sensor Circuit Range/Performance (Bank 1, Sensor 2)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器温度传感器电路出错。故障原因包括催化转换器温度传感器，电路，接头，或电子控制单元（ECU）故障。"
    }
  ],
  "P068D": [
    {
      "scope": "所有汽车制造商",
      "code": "P068D",
      "zh-cn": "气缸7电热塞控制电路高",
      "en-us": "Cylinder 7 Glow Plug Control Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸7电热塞控制电路电压高于校准的最高值，则该故障码会出现。"
    }
  ],
  "P0521": [
    {
      "scope": "所有汽车制造商",
      "code": "P0521",
      "zh-cn": "机油压力传感器/开关电路范围/性能",
      "en-us": "Engine Oil Pressure Sensor/Switch Range/Performance",
      "sys": "车速及怠速控制",
      "knowledge": "机油压力传感器的作用是将机油压力以电信号的形式输送给电子控制单元（ECU），在压力不够的情况下，ECU会在仪表盘发出报警信号。该故障码表明机油压力传感器/开关电路故障。"
    }
  ],
  "P0247": [
    {
      "scope": "所有汽车制造商",
      "code": "P0247",
      "zh-cn": "涡轮/超级增压器废气门电磁阀B",
      "en-us": "Turbocharger/Supercharger Wastegate Solenoid B",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。废气门电磁阀的作用是通过控制进入涡轮的尾气流量（将其余尾气绕开），来调整涡轮转速，从而调整最大增压压力。如果电子控制单元（ECU）检测到废气门电磁阀B发生故障，该故障码会出现。"
    }
  ],
  "P0599": [
    {
      "scope": "所有汽车制造商",
      "code": "P0599",
      "zh-cn": "节温器加热器控制电路高",
      "en-us": "Thermostat Heater Control Circuit High",
      "sys": "车速及怠速控制",
      "knowledge": "节温器的作用是当冷却液温度低的时候关闭，仅允许冷却液在发动机内循环，提高热车速度；当水温超过设定温度的时候，节温器打开，允许冷却液循环到水箱散热器，有效提高降温效率。该故障码表明电子控制单元（ECU）检测到节温器加热器控制电路电压高于校准的最高值。故障原因包括节温器加热器，其电路，接头，或继电器。"
    }
  ],
  "P043F": [
    {
      "scope": "所有汽车制造商",
      "code": "P043F",
      "zh-cn": "蒸发排放系统泄漏检测参考口高流速",
      "en-us": "Evaporative Emission System Leak Detection Reference Orifice High Flow",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。泄漏诊断模块的作用是利用泄漏检测泵（LDP）给蒸发排放（EVAP）系统和燃油系统施加一个很小的压力，然后检测系统是否有泄漏，以保证没有有害蒸汽逃逸到大气中去。该故障码表明EVAP泄漏检测系统发生故障。"
    }
  ],
  "P0479": [
    {
      "scope": "所有汽车制造商",
      "code": "P0479",
      "zh-cn": "排气压力控制阀A电路间歇/不稳定",
      "en-us": "Exhaust Pressure Control Valve A Circuit Intermittent/Erratic",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。如果电子控制单元（ECU）检测到排气压力控制阀A电路电压突然变化，该故障码会出现。"
    }
  ],
  "P0C16": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C16",
      "zh-cn": "驱动电机B换流器，W相温度过高",
      "en-us": "Drive Motor B Inverter Phase W Over Temperature",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P0722": [
    {
      "scope": "所有汽车制造商",
      "code": "P0722",
      "zh-cn": "输出轴速度传感器电路没有信号",
      "en-us": "Output Speed Sensor Circuit No Signal",
      "sys": "变速箱",
      "knowledge": "输出速度传感器（OSS）的任务是将变速器输出轴的速度信号传送给电子控制单元（ECU）。如果ECU检测不到OSS信号，则该故障码会出现。故障原因包括OSS传感器受到非标准配件的干扰，OSS传感器本身故障，电路，接头故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0646": [
    {
      "scope": "所有汽车制造商",
      "code": "P0646",
      "zh-cn": "空调离合器继电器控制电路低",
      "en-us": "A/C Clutch Relay Control Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "空调的皮带轮在空调关闭的时候只是空转，只有当空调离合器（在电磁阀的作用下）结合时，才会带动压缩机运转。空调离合器继电器的作用就是控制离合器的分离和结合。空调离合器被指令关的时候，电子控制单元（ECU）没有在空调继电器控制电路上检测到电压。"
    }
  ],
  "P0367": [
    {
      "scope": "所有汽车制造商",
      "code": "P0367",
      "zh-cn": "凸轮轴位置（CMP）传感器B电路低 （第1排）",
      "en-us": "Camshaft Position Sensor B Circuit Low (Bank 1)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。该故障码表明电B（排气/右/后）凸轮轴位置（CMP）传感器信号电压低于校准的最低值。故障原因包括凸轮轴位置（CMP）传感器电路，接头，其本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0477": [
    {
      "scope": "所有汽车制造商",
      "code": "P0477",
      "zh-cn": "排气压力控制阀A电路低",
      "en-us": "Exhaust Pressure Control Valve A Circuit Low",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。如果电子控制单元（ECU）检测到排气压力控制阀A电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0427": [
    {
      "scope": "所有汽车制造商",
      "code": "P0427",
      "zh-cn": "催化转换器温度传感器电路低 （第1排，传感器1）",
      "en-us": "Catalyst Temperature Sensor Circuit Low (Bank 1, Sensor 1)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器温度传感器电路电压低于校准的最低值。故障原因包括催化转换器温度传感器，电路，接头，或电子控制单元（ECU）故障。"
    }
  ],
  "P0BE3": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BE3",
      "zh-cn": "驱动电机换流器温度传感器F电路高",
      "en-us": "Drive Motor Inverter Temperature Sensor F Circuit High",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0A34": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A34",
      "zh-cn": "驱动电机B温度传感器电路间歇",
      "en-us": "Drive Motor B Temperature Sensor Circuit Intermittent",
      "sys": "混合动力系统",
      "knowledge": "驱动电机B温度传感器电路发生故障。故障原因包括电路，接头，电子控制单元，驱动电机等。有些车辆的驱动电机温度传感器跟驱动电机是一体的。所以，如果确定是该温度传感器本身的问题，有可能需要换掉整个驱动电机。"
    }
  ],
  "P06C7": [
    {
      "scope": "所有汽车制造商",
      "code": "P06C7",
      "zh-cn": "气缸3电热塞不正确",
      "en-us": "Cylinder 3 Glow Plug Incorrect",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。该故障码表明气缸3电热塞，其电路，接头，或电热赛控制模块（GPCM）出错。"
    }
  ],
  "P0776": [
    {
      "scope": "所有汽车制造商",
      "code": "P0776",
      "zh-cn": "压力控制电磁阀B性能或卡在关的位置",
      "en-us": "Pressure Control Solenoid B Performance/Stuck Off",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。故障原因包括压力控制电磁阀控制电路，接头，或电磁阀本身。控制模块故障也会导致该故障码出现。"
    }
  ],
  "P0379": [
    {
      "scope": "所有汽车制造商",
      "code": "P0379",
      "zh-cn": "点火正时参考高解析信号B没有脉冲",
      "en-us": "Timing Reference High Resolution Signal B No Pulses",
      "sys": "点火系统",
      "knowledge": "光学传感器通过数位于喷射泵内的传感器盘上的脉冲来为动力总成控制模块（PCM）提供高解析信号。这个信号是PCM控制燃油和正时的一个重要参考依据之一。该故障码的原因包括光学传感器，其电路，接头或PCM."
    }
  ],
  "P0207": [
    {
      "scope": "所有汽车制造商",
      "code": "P0207",
      "zh-cn": "喷油器电路/开路 - 第7缸",
      "en-us": "Injector Circuit/Open - Cylinder 7",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器控制电路出错，该故障码会出现。故障原因包括喷油器接口，电路故障，喷油器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0460": [
    {
      "scope": "所有汽车制造商",
      "code": "P0460",
      "zh-cn": "燃油液位传感器A电路",
      "en-us": "Fuel Level Sensor A Circuit",
      "sys": "排放控制",
      "knowledge": "燃油液位传感器利用油箱内的一个浮标和可变电阻的原理将油箱内的燃油液位以电信号的形式输送给电子控制模块。如果ECU发现虽然燃油有明显消耗，而燃油液位读数保持不变，该故障码会出现。"
    }
  ],
  "P0A25": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A25",
      "zh-cn": "发电机扭矩传感器电路高",
      "en-us": "Generator Torque Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "控制模块检测到发电机转矩传感器信号超出校准的正常范围。"
    }
  ],
  "P0307": [
    {
      "scope": "所有汽车制造商",
      "code": "P0307",
      "zh-cn": "第7缸检测到失火",
      "en-us": "Cylinder 7 Misfire Detected",
      "sys": "点火系统",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。如果电子控制单元（ECU）检测到可能会对催化转换器造成破坏的失火，故障指示灯会闪烁，此时应立即关闭发动机。该故障码表明电子控制单元（ECU）检测到气缸7失火。故障原因包括点火系统故障，燃油输送故障，进气歧管或EGR，PCV的空气泄漏，机械性气缸故障等。"
    }
  ],
  "P0B5A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B5A",
      "zh-cn": "混合动力电池电压监控G电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense G Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0618": [
    {
      "scope": "所有汽车制造商",
      "code": "P0618",
      "zh-cn": "替代燃油控制模块活性存储器（KAM）错误",
      "en-us": "Alternative Fuel Control Module KAM Error",
      "sys": "计算机或辅助输出电路",
      "knowledge": "替代燃油控制模块故障。"
    }
  ],
  "P0102": [
    {
      "scope": "所有汽车制造商",
      "code": "P0102",
      "zh-cn": "空气流量（MAF）传感器A电路低",
      "en-us": "Mass or Volume Air Flow A Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。如果ECU检测空气流量（MAF）传感器信号电压低于校准的最低值（0.23v），该故障码会出现。故障原因包括进气管路泄漏，传感器供电电路开路，传感器信号电路开路，MAF传感器本身故障等。"
    }
  ],
  "P0B78": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B78",
      "zh-cn": "混合动力电池电压监控M电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense M Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0A4A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A4A",
      "zh-cn": "驱动电机B位置传感器电路超速",
      "en-us": "Drive Motor B Position Sensor Circuit Overspeed",
      "sys": "混合动力系统",
      "knowledge": "驱动电机超过了校准的最大发动机转速极限。"
    }
  ],
  "P0C1F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C1F",
      "zh-cn": "辅助变速器液泵控制模块内部温度传感器电路高",
      "en-us": "Auxiliary Transmission Fluid Pump Control Module Internal Temperature Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "该故障码表明控制模块内部温度传感器信号电路电压超出了校准的最大范围。故障原因内部温度传感器，电路，接头，或控制模块。"
    }
  ],
  "P0A8A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A8A",
      "zh-cn": "14伏电源模块电流传感器电路间歇",
      "en-us": "14 Volt Power Module Current Sensor Circuit Intermittent",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0A0D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A0D",
      "zh-cn": "高压系统联锁电路高",
      "en-us": "High Voltage System Interlock Circuit High",
      "sys": "混合动力系统",
      "knowledge": "高压系统联锁的功能是：在当车辆静止时，如果安全装置有问题（举例说，充电接头或转化器没有盖好），就会关闭系统主继电器。如果控制模块检测到高压联锁电路故障，该故障码会出现。"
    }
  ],
  "P0259": [
    {
      "scope": "所有汽车制造商",
      "code": "P0259",
      "zh-cn": "喷油泵燃油计量控制B高（凸轮/转子/喷油器）",
      "en-us": "Injection Pump Fuel Metering Control B High (Cam/Rotor/Injector)",
      "sys": "燃油或空气",
      "knowledge": "故障原因包括燃油控制执行器（FCA），其电路，喷油泵，或电子控制模块（ECU）等。燃油控制执行器（FCA）一般位于喷油泵的后侧，它是一个电控电磁阀门。ECU通过循环打开和关闭FCA来控制进入喷油泵的燃油量。"
    }
  ],
  "P0C5A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C5A",
      "zh-cn": "驱动电机A位置传感器电路B",
      "en-us": "Drive Motor A Position Sensor Circuit B",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0843": [
    {
      "scope": "所有汽车制造商",
      "code": "P0843",
      "zh-cn": "变速器液压力（TFP）传感器/开关A电路高",
      "en-us": "Transmission Fluid Pressure Sensor/Switch A Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0B35": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B35",
      "zh-cn": "高压服务断开电路低",
      "en-us": "High Voltage Service Disconnect Circuit Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P06A2": [
    {
      "scope": "所有汽车制造商",
      "code": "P06A2",
      "zh-cn": "可变（排量）空调压缩机控制电路高",
      "en-us": "Variable A/C Compressor Control Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "可变（排量）空调压缩机通过改变冲溅板的角度来控制压缩机制冷剂被压缩的排量。该故障码表明可变（排量）空调压缩机控制电路电压高于校准的最高值。"
    }
  ],
  "P0284": [
    {
      "scope": "所有汽车制造商",
      "code": "P0284",
      "zh-cn": "第8缸贡献/平衡错误",
      "en-us": "Cylinder 8 Contribution/Balance",
      "sys": "燃油或空气",
      "knowledge": "电子控制单元（ECU）检测到第8缸的曲轴加速贡献低于校准值。故障原因包括第8缸喷油系统；或其它影响第8缸的发动机问题。"
    }
  ],
  "P0281": [
    {
      "scope": "所有汽车制造商",
      "code": "P0281",
      "zh-cn": "第7缸贡献/平衡错误",
      "en-us": "Cylinder 7 Contribution/Balance",
      "sys": "燃油或空气",
      "knowledge": "电子控制单元（ECU）检测到第7缸的曲轴加速贡献低于校准值。故障原因包括第7缸喷油系统；或其它影响第7缸的发动机问题。"
    }
  ],
  "P0AC2": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AC2",
      "zh-cn": "混合动力电池组电流传感器A电路高",
      "en-us": "Hybrid Battery Pack Current Sensor A Circuit High",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块通过来自电池电流传感器的信号来监控电池的充电放电情况。如果控制模块发现电池电流传感器信号电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0932": [
    {
      "scope": "所有汽车制造商",
      "code": "P0932",
      "zh-cn": "液压传感器电路",
      "en-us": "Hydraulic Pressure Sensor Circuit",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0544": [
    {
      "scope": "所有汽车制造商",
      "code": "P0544",
      "zh-cn": "排气温度传感器电路故第1排，传感器1）",
      "en-us": "Exhaust Gas Temperature Sensor Circuit (Bank 1, Sensor 1)",
      "sys": "车速及怠速控制",
      "knowledge": "排气温度传感器的作用是将排气温度以电信号的形式输送给电子控制单元（ECU）。正确的空燃比产生的排气温度比过浓或过稀空燃比产生的排气温度要低。过高排气温度（>160摄氏度）会对发动机造成破坏。如果发动机冷启动10分钟后，电子控制单元（ECU）发现排气温度传感器变化小于40摄氏度，该故障码会出现。"
    }
  ],
  "P06CC": [
    {
      "scope": "所有汽车制造商",
      "code": "P06CC",
      "zh-cn": "气缸8电热塞不正确",
      "en-us": "Cylinder 8 Glow Plug Incorrect",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。该故障码表明气缸8电热塞，其电路，接头，或电热赛控制模块（GPCM）出错。"
    }
  ],
  "P0BEA": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BEA",
      "zh-cn": "驱动电机A，V相电流传感器电路范围/性能",
      "en-us": "Drive Motor A Phase V Current Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0C46": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C46",
      "zh-cn": "混合动力电池组冷却液温度传感器电路间歇/不稳定",
      "en-us": "Hybrid Battery Pack Coolant Temperature Sensor Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0423": [
    {
      "scope": "所有汽车制造商",
      "code": "P0423",
      "zh-cn": "热催化转换器效能低于阈值（第1排）",
      "en-us": "Heated Catalyst Efficiency Below Threshold (Bank 1)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明预热以后催化转换器效能低于设定的最低极限。故障原因包括催化转换器，氧传感器，以及电路，接头等。故障原因包括排气管或排气歧管附近尾气泄漏，催化箱失效，发动机冷却液温度（ECT）传感器故障，发动机失火或正时滞后，机油太脏，氧传感器故障，燃油系统压力太高等。"
    }
  ],
  "P0B0B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B0B",
      "zh-cn": "辅助变速器液泵电机供电电压电路高",
      "en-us": "Auxiliary Transmission Fluid Pump Motor Supply Voltage Circuit High",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0494": [
    {
      "scope": "所有汽车制造商",
      "code": "P0494",
      "zh-cn": "风扇速度低",
      "en-us": "Fan Speed Low",
      "sys": "排放控制",
      "knowledge": ""
    }
  ],
  "P066E": [
    {
      "scope": "所有汽车制造商",
      "code": "P066E",
      "zh-cn": "气缸3电热塞控制电路低",
      "en-us": "Cylinder 3 Glow Plug Control Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸3电热塞电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0AFB": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AFB",
      "zh-cn": "混合动力电池系统电压高",
      "en-us": "Hybrid Battery System Voltage High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P022B": [
    {
      "scope": "所有汽车制造商",
      "code": "P022B",
      "zh-cn": "增压空气冷却器旁通阀控制A电路低",
      "en-us": "Charge Air Cooler Bypass Control A Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。增压空气冷却器旁通阀的作用是将一部分空气绕开空气冷却器。这些空气随后再跟经过空气冷却器冷却过的空气混合后进入发动机，以保证进气温度高于露水温度。如果空气冷却器旁通阀控制电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P024B": [
    {
      "scope": "所有汽车制造商",
      "code": "P024B",
      "zh-cn": "增压空气冷却器旁通阀控制A卡住",
      "en-us": "Charge Air Cooler Bypass Control A Stuck",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。增压空气冷却器旁通阀的作用是将一部分空气绕开空气冷却器。这些空气随后再跟经过空气冷却器冷却过的空气混合后进入发动机，以保证进气温度高于露水温度。如果空气冷却器旁通阀控制A卡住，该故障码会出现。"
    }
  ],
  "P0B69": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B69",
      "zh-cn": "混合动力电池电压监控J电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense J Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0149": [
    {
      "scope": "所有汽车制造商",
      "code": "P0149",
      "zh-cn": "燃油正时故障",
      "en-us": "Fuel Timing Error",
      "sys": "燃油或空气",
      "knowledge": "电子控制单元（ECU）检测到喷油器正时或者是实际燃油压力跟理想燃油压力的差超出校准的正常范围，该故障码会出现。故障原因包括喷油器，其电路，接头，或喷油器控制模块（FICM）。"
    }
  ],
  "P062D": [
    {
      "scope": "所有汽车制造商",
      "code": "P062D",
      "zh-cn": "喷油器驱动器电路性能（第1排）",
      "en-us": "Fuel Injector Driver Circuit Performance (Bank 1)",
      "sys": "计算机或辅助输出电路",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器驱动器电路短路到接地或短路到正极，该故障码会出现。"
    }
  ],
  "P0BB1": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BB1",
      "zh-cn": "混合动力电池电压监控X电路高",
      "en-us": "Hybrid Battery Voltage Sense X Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0A83": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A83",
      "zh-cn": "混合动力电池组冷却风扇1卡在开启位置",
      "en-us": "Hybrid Battery Pack Cooling Fan 1 Stuck On",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块根据来自电池温度传感器的信号来控制电池风扇的开启或关闭。如果实际电池组温度比基于冷却风扇性能估计的电池组温度低出一设定值，控制模块认为电池组风扇卡在开启位置。"
    }
  ],
  "P0AE3": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AE3",
      "zh-cn": "混合动力电池预充电接触器电路卡在开启位置",
      "en-us": "Hybrid Battery Precharge Contactor Circuit Stuck Open",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果混合动力汽车电子控制单元如果发现第1系统主继电器（SMR1）发生故障，该故障码会出现。"
    }
  ],
  "P0809": [
    {
      "scope": "所有汽车制造商",
      "code": "P0809",
      "zh-cn": "离合器位置传感器电路间歇",
      "en-us": "Clutch Position Sensor Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "离合器位置传感器的作用是将离合器是否踩下的信息以电信号的形式输送给电子控制单元，作为控制发动机启动和定速巡航系统的重要参数。"
    }
  ],
  "P0C50": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C50",
      "zh-cn": "驱动电机A位置传感器电路A",
      "en-us": "Drive Motor A Position Sensor Circuit A",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0ACF": [
    {
      "scope": "所有汽车制造商",
      "code": "P0ACF",
      "zh-cn": "混合动力电池组冷却风扇3控制电路/开路",
      "en-us": "Hybrid Battery Pack Cooling Fan 3 Control Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": "电池组风扇电机控制器负责调节混合动力电池组冷却风扇的电压。如果冷却风扇1控制电路电压超出了目标电压的正常范围，该故障码会出现。"
    }
  ],
  "P0122": [
    {
      "scope": "所有汽车制造商",
      "code": "P0122",
      "zh-cn": "节气门/油门踏板位置传感器/开关A电路低",
      "en-us": "Throttle/Pedal Position Sensor/Switch A Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。该故障码表明电子节气门踏板位置传感器A信号电压低于校准的最低值（0.17v）。故障原因包括传感器信号电路开路，传感器信号电路短路到接地，传感器参考电压电路开路，传感器本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0203": [
    {
      "scope": "所有汽车制造商",
      "code": "P0203",
      "zh-cn": "喷油器电路/开路 - 第3缸",
      "en-us": "Injector Circuit/Open - Cylinder 3",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器控制电路出错，该故障码会出现。故障原因包括喷油器接口，电路故障，喷油器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0819": [
    {
      "scope": "所有汽车制造商",
      "code": "P0819",
      "zh-cn": "升档/降挡开关跟变速器档位的相关性",
      "en-us": "Up and Down Shift Switch to Transmission Range Correlation",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0BCD": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BCD",
      "zh-cn": "发电机换流器温度传感器电路范围/性能",
      "en-us": "Generator Inverter Temperature Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P0A8D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A8D",
      "zh-cn": "14伏电源模块系统电压低",
      "en-us": "14 Volt Power Module System Voltage Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0229": [
    {
      "scope": "所有汽车制造商",
      "code": "P0229",
      "zh-cn": "节气门/踏板位置传感器/开关C电路间歇",
      "en-us": "Throttle/Pedal Position Sensor/Switch C Circuit Intermittent",
      "sys": "燃油或空气",
      "knowledge": "在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。该故障码表明节气门踏板位置传感器C电路电压突然变化。"
    }
  ],
  "P0152": [
    {
      "scope": "所有汽车制造商",
      "code": "P0152",
      "zh-cn": "氧传感器电路高电压（第2排，传感器 1）",
      "en-us": "O2 Sensor Circuit High Voltage (Bank 2, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。当加热氧传感器信号的电压在设定的时间段内持续高于1.5伏时，该故障码就会出现。故障原因包括氧传感器因为燃油中含硅被污染，接头内因油或潮湿气导致信号交叉，传感器信号电路短路到正极，传感器本身故障，电子控制模块等。"
    }
  ],
  "P0354": [
    {
      "scope": "所有汽车制造商",
      "code": "P0354",
      "zh-cn": "点火线圈D主/次电路",
      "en-us": "Ignition Coil D Primary/Secondary Circuit",
      "sys": "点火系统",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。电子控制单元（ECU）持续监测每个点火主电路。如果ECU没有收到有效的来自点火模块（集成在ECU）的点火诊断监控器（IDM）脉冲信号，该故障码会出现。故障原因包括点火启动/运行电路，点火线圈电路，点火线圈本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0853": [
    {
      "scope": "所有汽车制造商",
      "code": "P0853",
      "zh-cn": "行车档（D）开关输入电路",
      "en-us": "Drive Switch Input Circuit",
      "sys": "变速箱",
      "knowledge": "行车档位置开关的作用是将自动变速器是否在行车档的信息输送给电子控制单元（ECU），作为决定发动机怠速，以及增加负载的参考依据。"
    }
  ],
  "P0A96": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A96",
      "zh-cn": "混合动力电池组冷却风扇2控制电路/开路",
      "en-us": "Hybrid Battery Pack Cooling Fan 2 Control Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": "电池组风扇电机控制器负责调节混合动力电池组冷却风扇的电压。如果冷却风扇2控制电路电压超出了目标电压的正常范围，该故障码会出现。"
    }
  ],
  "P0934": [
    {
      "scope": "所有汽车制造商",
      "code": "P0934",
      "zh-cn": "液压传感器电路低",
      "en-us": "Hydraulic Pressure Sensor Circuit Low",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0517": [
    {
      "scope": "所有汽车制造商",
      "code": "P0517",
      "zh-cn": "电池温度传感器电路高",
      "en-us": "Battery Temperature Sensor Circuit High",
      "sys": "车速及怠速控制",
      "knowledge": "电池温度传感器位于汽车电池托盘的底部。它的主要作用是将电池温度以电信号的形式传输给电子控制单元（ECU），以帮助决定充电速度。如果ECU检测到电池温度传感器电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0983": [
    {
      "scope": "所有汽车制造商",
      "code": "P0983",
      "zh-cn": "换档电磁阀D控制电路高",
      "en-us": "Shift Solenoid D Control Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P064A": [
    {
      "scope": "所有汽车制造商",
      "code": "P064A",
      "zh-cn": "燃油泵控制模块",
      "en-us": "Fuel Pump Control Module",
      "sys": "计算机或辅助输出电路",
      "knowledge": "燃油泵控制模块（FPM，or FPCM）是一个通过控制通往燃油泵（一般位于油箱内）电压的方式以实现电子控制模块（ECU）所需的最佳燃油压力的电脑微处理器。P064A的故障原因包括燃油泵控制模块，电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P0408": [
    {
      "scope": "所有汽车制造商",
      "code": "P0408",
      "zh-cn": "废气再循环阀传感器B电路高",
      "en-us": "Exhaust Gas Recirculation Sensor B Circuit High",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环（EGR）传感器的信号电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0786": [
    {
      "scope": "所有汽车制造商",
      "code": "P0786",
      "zh-cn": "换档正时电磁阀A范围性能",
      "en-us": "Shift Timing Solenoid A Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P075A": [
    {
      "scope": "所有汽车制造商",
      "code": "P075A",
      "zh-cn": "换档电磁阀G",
      "en-us": "Shift Solenoid G",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0256": [
    {
      "scope": "所有汽车制造商",
      "code": "P0256",
      "zh-cn": "喷油泵燃油计量控制B（凸轮/转子/喷油器）",
      "en-us": "Injection Pump Fuel Metering Control B (Cam/Rotor/Injector)",
      "sys": "燃油或空气",
      "knowledge": "故障原因包括燃油控制执行器（FCA），其电路，喷油泵，或电子控制模块（ECU）等。燃油控制执行器（FCA）一般位于喷油泵的后侧，它是一个电控电磁阀门。ECU通过循环打开和关闭FCA来控制进入喷油泵的燃油量。"
    }
  ],
  "P0BB8": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BB8",
      "zh-cn": "混合动力电池电压监控Z电路",
      "en-us": "Hybrid Battery Voltage Sense Z Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0595": [
    {
      "scope": "所有汽车制造商",
      "code": "P0595",
      "zh-cn": "定速巡航系统伺服控制电路低",
      "en-us": "Cruise Control Servo Control Circuit Low",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航伺服器的作用是按照巡航控制模块的指令控制节气门的开度（车速低于设定值，加大节气门开度；车速高于设定值，减小节气门开度），从而实现定速巡航功能。该故障码表明定速巡航系统伺服控制电路电压低于校准的最低值。故障原因包括伺服控制电磁阀，电路，接头等。"
    }
  ],
  "P0C04": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C04",
      "zh-cn": "驱动电机B电流高",
      "en-us": "Drive Motor B Current High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0064": [
    {
      "scope": "所有汽车制造商",
      "code": "P0064",
      "zh-cn": "热氧传感器加热器控制电路高 （第2排，传感器3）",
      "en-us": "HO2S Heater Control Circuit High (Bank 2, Sensor 3)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）通过控制氧传感器加热器的开/关来保持氧传感器780oC的温度。如果加热器的控制电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0C0E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C0E",
      "zh-cn": "驱动电机B换流器电源供应 - 电路/开路",
      "en-us": "Drive Motor B Inverter Power Supply Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P0279": [
    {
      "scope": "所有汽车制造商",
      "code": "P0279",
      "zh-cn": "第7缸喷油器电路低",
      "en-us": "Cylinder 7 Injector Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第7缸喷油器控制电路电压低于校准的最低值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0700": [
    {
      "scope": "所有汽车制造商",
      "code": "P0700",
      "zh-cn": "变速器控制系统故障（故障指示灯请求）",
      "en-us": "Transmission Control System (MIL Request)",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。故障指示灯（MIL）也叫检查引擎灯，其作用是当控制模块检测到故障时，点亮仪表盘上的一个黄色或红色的发动机符号。该故障码表明动力总成系统（ECU）收到来自变速器控制系统（TCU）点亮故障指示灯的请求。"
    }
  ],
  "P0390": [
    {
      "scope": "所有汽车制造商",
      "code": "P0390",
      "zh-cn": "凸轮轴位置（CMP）传感器B电路 （第2排）",
      "en-us": "Camshaft Position Sensor B Circuit (Bank 2)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。如果电子控制单元（ECU）检测到凸轮轴传感器B电路电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P0799": [
    {
      "scope": "所有汽车制造商",
      "code": "P0799",
      "zh-cn": "压力控制电磁阀C间歇性",
      "en-us": "Pressure Control Solenoid C Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。故障原因包括变速器液液面太低，变速器液太脏，变速器液压力控制电磁阀，电路，接头，或控制模块等。"
    }
  ],
  "P0359": [
    {
      "scope": "所有汽车制造商",
      "code": "P0359",
      "zh-cn": "点火线圈 I 主/次电路",
      "en-us": "Ignition Coil I Primary/Secondary Circuit",
      "sys": "点火系统",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。电子控制单元（ECU）持续监测每个点火主电路。如果ECU没有收到有效的来自点火模块（集成在ECU）的点火诊断监控器（IDM）脉冲信号，该故障码会出现。故障原因包括点火启动/运行电路，点火线圈电路，点火线圈本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0866": [
    {
      "scope": "所有汽车制造商",
      "code": "P0866",
      "zh-cn": "变速器控制模块（TCU）通信电路高",
      "en-us": "TCU Communication Circuit High",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。"
    }
  ],
  "P0483": [
    {
      "scope": "所有汽车制造商",
      "code": "P0483",
      "zh-cn": "风扇合理性检查",
      "en-us": "Fan Rationality Check",
      "sys": "排放控制",
      "knowledge": "如果电子控制单元（ECU）发现风扇速度接近为零，或者风扇离合器卡住时，该故障码会出现。"
    }
  ],
  "P0BB2": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BB2",
      "zh-cn": "混合动力电池电压监控X电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense X Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0929": [
    {
      "scope": "所有汽车制造商",
      "code": "P0929",
      "zh-cn": "换档锁止电磁阀/执行器控制电路A/范围/性能",
      "en-us": "Gear Shift Lock Solenoid/Actuator Control Circuit A Range/Performance",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0602": [
    {
      "scope": "所有汽车制造商",
      "code": "P0602",
      "zh-cn": "控制模块电脑程序错误",
      "en-us": "Control Module Programming Error",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）出错。故障原因包括当使用扫描工具重新编程化的时候车辆身份（VID）数据块出错，电池电极锈蚀（导致电压不稳），电子控制模块电路故障，重新编程化故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P013B": [
    {
      "scope": "所有汽车制造商",
      "code": "P013B",
      "zh-cn": "氧传感器慢响应 - （空燃比）稀到浓 （第1排，传感器 2）",
      "en-us": "O2 Sensor Slow Response - Lean to Rich (Bank 1, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。如果电子控制单元（ECU）发现在空燃比由稀变浓的过程中，没有监测到可以接受的电压变化速率的话，该故障码就会出现。"
    }
  ],
  "P0321": [
    {
      "scope": "所有汽车制造商",
      "code": "P0321",
      "zh-cn": "点火/分电器发动机转速输入电路范围/性能",
      "en-us": "Ignition/Distributor Engine Speed Input Circuit Range/Performance",
      "sys": "点火系统",
      "knowledge": "故障原因包括发动机转速传感器故障，传感器轮故障或不匹配，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0928": [
    {
      "scope": "所有汽车制造商",
      "code": "P0928",
      "zh-cn": "换档锁止电磁阀/执行器控制电路A/开路",
      "en-us": "Gear Shift Lock Solenoid/Actuator Control Circuit A/Open",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0450": [
    {
      "scope": "所有汽车制造商",
      "code": "P0450",
      "zh-cn": "蒸发排放系统压力传感器/开关",
      "en-us": "Evaporative Emission System Pressure Sensor/Switch",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。该故障码的出现是因为油箱压力传感器范围（补偿）的问题。油箱压力传感器输出补偿为正负4.3厘米水柱。如果电子控制单元（ECU）检测到油箱压力在0.1秒之内变化超过36厘米水柱，该故障码会出现。"
    }
  ],
  "P0822": [
    {
      "scope": "所有汽车制造商",
      "code": "P0822",
      "zh-cn": "变速杆Y位置传感器电路",
      "en-us": "Gear Lever Y Position Circuit",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0603": [
    {
      "scope": "所有汽车制造商",
      "code": "P0603",
      "zh-cn": "内部控制模块活性存储器（KAM）错误",
      "en-us": "Internal Control Module Keep Alive Memory (KAM) Error",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）出错。外部原因，诸如电源供应等也可能导致该故障码。故障原因包括KAM到电子控制模块的电路故障，电池端子锈蚀或接触不良，重新编程化错误，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0AFF": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AFF",
      "zh-cn": "系统电压太低 - 未达到升压转换的电压",
      "en-us": "System Voltage Too Low for Voltage Step Down Conversion",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P084C": [
    {
      "scope": "所有汽车制造商",
      "code": "P084C",
      "zh-cn": "变速器液压力（TFP）传感器/开关H电路低",
      "en-us": "Transmission Fluid Pressure Sensor/Switch H Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0A1B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A1B",
      "zh-cn": "驱动电机A控制模块",
      "en-us": "Drive Motor A Control Module",
      "sys": "混合动力系统",
      "knowledge": "驱动电机控制模块（MCM）发生内部故障。可能故障原因包括MCM处理器，模拟转数字转化器，供电电压，串行通讯等。"
    }
  ],
  "P0738": [
    {
      "scope": "所有汽车制造商",
      "code": "P0738",
      "zh-cn": "变速器控制模块（TCU）发动机转速输出电路低",
      "en-us": "TCU Engine Speed Output Circuit Low",
      "sys": "变速箱",
      "knowledge": "发动机转速（也称为输入轴转速）是TCU测定齿轮比和换档等的一个重要依据。"
    }
  ],
  "P0C6D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C6D",
      "zh-cn": "发电机位置传感器电路B间歇/不稳定",
      "en-us": "Generator Position Sensor Circuit B Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括发电机位置传感器电路，接头，或传感器本身；混合动力车辆发电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P0C4E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C4E",
      "zh-cn": "驱动电机A位置超过了学习极限",
      "en-us": "Drive Motor A Position Exceeded Learning Limit",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0BD3": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BD3",
      "zh-cn": "驱动电机换流器温度传感器C电路低",
      "en-us": "Drive Motor Inverter Temperature Sensor C Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0B87": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B87",
      "zh-cn": "混合动力电池电压监控P电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense P Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0537": [
    {
      "scope": "所有汽车制造商",
      "code": "P0537",
      "zh-cn": "空调蒸发器温度传感器电路低",
      "en-us": "A/C Evaporator Temperature Sensor Circuit Low",
      "sys": "车速及怠速控制",
      "knowledge": "空调蒸发器温度传感器的作用是将空调蒸发器内的温度以电信号的形式输送给空调控制模块，以便当空调蒸发器内温度过低的时候，关闭空调压缩机，防止空调蒸发器发生冰冻现象。如果电子控制单元（ECU）检测到空调蒸发器温度传感器信号电压低于校准的最低值（0.13伏），该故障码会出现。故障原因包括空调蒸发器温度传感器故障，电路短路到接地，接头故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0C2A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C2A",
      "zh-cn": "辅助变速器液泵电机失速",
      "en-us": "Auxiliary Transmission Fluid Pump Motor Stalled",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0BF7": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BF7",
      "zh-cn": "驱动电机B，V相电流传感器电路低",
      "en-us": "Drive Motor B Phase V Current Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P00B5": [
    {
      "scope": "所有汽车制造商",
      "code": "P00B5",
      "zh-cn": "（水箱）散热器冷却液温度传感器电路间歇/不稳定",
      "en-us": "Radiator Coolant Temperature Sensor Circuit Intermittent/Erratic",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "（水箱）散热器冷却液温度传感器采用热敏电阻的原理将散热器温度信号以电压的形式传输到电子控制单元（ECU）。如果ECU检测到（水箱）散热器冷却液温度传感器信号电压突然变化，该故障码会出现。"
    }
  ],
  "P0A53": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A53",
      "zh-cn": "驱动电机A电流传感器电路低",
      "en-us": "Drive Motor A Current Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）内部故障。"
    }
  ],
  "P0439": [
    {
      "scope": "所有汽车制造商",
      "code": "P0439",
      "zh-cn": "催化转换器加热器控制电路 （第2排）",
      "en-us": "Catalyst Heater Control Circuit (Bank 2)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明电子控制单元（ECU）检测到催化转换器加热器电路发生故障。"
    }
  ],
  "P0104": [
    {
      "scope": "所有汽车制造商",
      "code": "P0104",
      "zh-cn": "空气流量（MAF）传感器A电路间歇故障",
      "en-us": "Mass or Volume Air Flow A Circuit Intermittent",
      "sys": "燃油或空气",
      "knowledge": "空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。如果ECU检测空气流量（MAF）传感器信号电压突然变化，该故障码会出现。"
    }
  ],
  "P0027": [
    {
      "scope": "所有汽车制造商",
      "code": "P0027",
      "zh-cn": "排气阀门控制电磁阀电路范围/性能 （第1排）",
      "en-us": "Exhaust Valve Control Solenoid Circuit Range/Performance (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。如果B（排气）凸轮轴的实际位置跟理想位置相差超过20度，该故障码会出现。"
    }
  ],
  "P0B2C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B2C",
      "zh-cn": "混合动力电池C电压不稳定",
      "en-us": "Hybrid Battery C Voltage Unstable",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0300": [
    {
      "scope": "所有汽车制造商",
      "code": "P0300",
      "zh-cn": "随机/多个气缸检测到失火",
      "en-us": "Random/Multiple Cylinder Misfire Detected",
      "sys": "点火系统",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。如果电子控制单元（ECU）检测到可能会对催化转换器造成破坏的失火，故障指示灯会闪烁，此时应立即关闭发动机。该故障码表明有多个气缸失火或者是电子控制单元（ECU）不能确定哪一个气缸失火。故障原因包括气缸机械故障，燃油计量错误，燃油压力太高或太低，蒸发排放系统故障，EGR阀卡在开，PCV系统真空泄漏，点火系统故障，空气流量计故障，油箱内燃油液位过低。"
    }
  ],
  "P0B7E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B7E",
      "zh-cn": "混合动力电池电压监控N电路低",
      "en-us": "Hybrid Battery Voltage Sense N Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0116": [
    {
      "scope": "所有汽车制造商",
      "code": "P0116",
      "zh-cn": "发动机冷却液温度（ECT）传感器1电路范围/性能",
      "en-us": "Engine Coolant Temperature Sensor 1 Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。如果P0116出现，则表示发动机在启动时冷却液温度传感器的读数超过校准的最高值（通常107摄氏度），或者比进气温度（IAT）传感器的读数高出一定值（通常17摄氏度）。故障原因包括冷却液液位太低，传感器校准不正确，或传感器故障等。"
    }
  ],
  "P0ADB": [
    {
      "scope": "所有汽车制造商",
      "code": "P0ADB",
      "zh-cn": "混合动力电池正极接触器控制电路低",
      "en-us": "Hybrid Battery Positive Contactor Control Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果混合动力电子控制单元发现第2系统主继电器（SMR）发生故障，该故障码会出现。"
    }
  ],
  "P006D": [
    {
      "scope": "所有汽车制造商",
      "code": "P006D",
      "zh-cn": "大气压力-涡轮/超级增压器进口压力相关性",
      "en-us": "Barometric Pressure - Turbocharger/Supercharger Inlet Pressure Correlation",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "大气压力传感器（有时候也叫高海拔补偿器，HAC）的作用是将大气压力以电信号的形式输送给电子控制模块。大气压力会随天气和海拔高度的变化而变化。压力越小，空气越稀薄。动力总成控制模块（PCM）会根据大气压力的数值来修正燃油供给，以帮助发动机达到最佳空燃比。该故障码表明气压传感器跟涡轮/超级增压器进口压力传感器（节气门阀下游）的信号差在设定时间段里（2.5秒）超出校准值（通常是10.35KPa）。"
    }
  ],
  "P0163": [
    {
      "scope": "所有汽车制造商",
      "code": "P0163",
      "zh-cn": "氧传感器电路低电压（第2排,传感器 3）",
      "en-us": "O2 Sensor Circuit Low Voltage (Bank 2, Sensor 3)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。当加热氧传感器信号的电压在设定的时间段内持续低于156毫伏时，该故障码就会出现。故障原因包括氧传感器由于燃油中含硅而被污染，氧传感器信号和地线电路交叉，氧传感器信号电路短路到接地，氧传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0976": [
    {
      "scope": "所有汽车制造商",
      "code": "P0976",
      "zh-cn": "换档电磁阀B控制电路低",
      "en-us": "Shift Solenoid B Control Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0343": [
    {
      "scope": "所有汽车制造商",
      "code": "P0343",
      "zh-cn": "凸轮轴位置（CMP）传感器A电路高 （第1排或单个传感器）",
      "en-us": "Camshaft Position Sensor A Circuit High  (Bank 1 or Single Sensor)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。该故障码表明A（进气/左/前）凸轮轴位置（CMP）传感器信号电压高于校准的最高值。故障原因包括凸轮轴位置（CMP）传感器电路，接头，其本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P063E": [
    {
      "scope": "所有汽车制造商",
      "code": "P063E",
      "zh-cn": "自动配置节气门输入不存在",
      "en-us": "Auto Configuration Throttle Input Not Present",
      "sys": "计算机或辅助输出电路",
      "knowledge": ""
    }
  ],
  "P0495": [
    {
      "scope": "所有汽车制造商",
      "code": "P0495",
      "zh-cn": "风扇速度高",
      "en-us": "Fan Speed High",
      "sys": "排放控制",
      "knowledge": ""
    }
  ],
  "P0B55": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B55",
      "zh-cn": "混合动力电池电压监控F电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense F Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P02ED": [
    {
      "scope": "所有汽车制造商",
      "code": "P02ED",
      "zh-cn": "柴油机进气流量控制系统 - 检测到低进气流量",
      "en-us": "Diesel Intake Air Flow Control System - Low Air Flow Detected",
      "sys": "燃油或空气",
      "knowledge": "柴油机进气流量控制系统通过对节气门开启角度的自动控制并与切向气道或螺旋气道的配合使用来形成有效的进气涡流，同时对进气涡流的强度进行自动控制，有效地改善了发动机的燃烧，从而优化了发动机动力性，经济性等性能指标。P02ED表明电子控制模块（ECM）检测到过低的进气流速。"
    }
  ],
  "P0330": [
    {
      "scope": "所有汽车制造商",
      "code": "P0330",
      "zh-cn": "爆震传感器2电路（第2排）",
      "en-us": "Knock Sensor 2 Circuit (Bank 2)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压超出了校准范围，该故障码会出现。故障原因包括爆震传感器电路，接头，其本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0BFB": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BFB",
      "zh-cn": "驱动电机B，W相电流传感器电路低",
      "en-us": "Drive Motor B Phase W Current Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0451": [
    {
      "scope": "所有汽车制造商",
      "code": "P0451",
      "zh-cn": "蒸发排放系统压力传感器/开关范围/性能",
      "en-us": "Evaporative Emission System Pressure Sensor/Switch Range/Performance",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。该故障码的出现是因为油箱压力传感器范围（补偿）的问题。油箱压力传感器输出补偿为正负4.3厘米水柱。如果电子控制单元（ECU）检测到油箱压力在0.1秒之内变化超过36厘米水柱，该故障码会出现。"
    }
  ],
  "P0C4F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C4F",
      "zh-cn": "驱动电机B位置超过了学习极限",
      "en-us": "Drive Motor B Position Exceeded Learning Limit",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0A87": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A87",
      "zh-cn": "14伏电源模块电流传感器电路范围/性能",
      "en-us": "14 Volt Power Module Current Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0954": [
    {
      "scope": "所有汽车制造商",
      "code": "P0954",
      "zh-cn": "自动换档手动（ASM）变速器控制电路间歇",
      "en-us": "Auto Shift Manual Control Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "自动换档手动变速器允许司机将变速器打入手动模式，手动控制升档或降档。"
    }
  ],
  "P0115": [
    {
      "scope": "所有汽车制造商",
      "code": "P0115",
      "zh-cn": "发动机冷却液温度（ECT）传感器1电路",
      "en-us": "Engine Coolant Temperature Sensor 1 Circuit",
      "sys": "燃油或空气",
      "knowledge": "发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。如果ECU检测到发动机冷却液温度（ECT）传感器信号电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P0C56": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C56",
      "zh-cn": "驱动电机B位置传感器电路A范围/性能",
      "en-us": "Drive Motor B Position Sensor Circuit A Range/Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0161": [
    {
      "scope": "所有汽车制造商",
      "code": "P0161",
      "zh-cn": "氧传感器加热器电路（第2排，传感器 2）",
      "en-us": "O2 Sensor Heater Circuit (Bank 2, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）持续监测加热氧传感器加热器，以确保没有开路，短路，或电流消耗过度的情况。如果电流消耗超过校准的极限，或监测到开路或短路，该故障码就会出现。故障原因包括氧传感器加热器电路，接头故障，氧传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0041": [
    {
      "scope": "所有汽车制造商",
      "code": "P0041",
      "zh-cn": "氧传感器信号被互换（第1排传感器2）/（第2排传感器2）",
      "en-us": "O2 Sensor Signals Swapped (Bank 1, Sensor 2)/(Bank 2, Sensor 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器监测因燃油转变引起的氧传感器信号响应是否对应到正确的氧传感器排（Bank）。该故障码的可能原因包括氧传感器插头弄混，线路弄混等。"
    }
  ],
  "P0B59": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B59",
      "zh-cn": "混合动力电池电压监控G电路",
      "en-us": "Hybrid Battery Voltage Sense G Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0126": [
    {
      "scope": "所有汽车制造商",
      "code": "P0126",
      "zh-cn": "冷却液未达到稳定运行的温度",
      "en-us": "Insufficient Coolant Temperature for Stable Operation",
      "sys": "燃油或空气",
      "knowledge": "发动机冷却液温度（ECT）或缸盖温度的传感器（CHT）的信号显示发动机在设定的时间内没有达到进入闭环燃油控制运行状态的要求温度。故障原因包括冷却液节温器卡在常开的位置等。"
    }
  ],
  "P06C2": [
    {
      "scope": "所有汽车制造商",
      "code": "P06C2",
      "zh-cn": "气缸10电热塞电路范围/性能",
      "en-us": "Cylinder 10 Glow Plug Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸10电热塞电路发生故障，则该故障码会出现。"
    }
  ],
  "P0240": [
    {
      "scope": "所有汽车制造商",
      "code": "P0240",
      "zh-cn": "涡轮/超级增压器增压传感器B电路范围/性能",
      "en-us": "Turbocharger/Supercharger Boost Sensor B Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。增压传感器，也叫增压压力传感器（BPS），其作用是将增压压力以电信号的形式传输给电子控制单元（ECU）。如果ECU检测到增压传感器（BPS）信号电路出错，该故障码会出现。"
    }
  ],
  "P0224": [
    {
      "scope": "所有汽车制造商",
      "code": "P0224",
      "zh-cn": "节气门/踏板位置传感器/开关B电路间歇",
      "en-us": "Throttle/Pedal Position Sensor/Switch B Circuit Intermittent",
      "sys": "燃油或空气",
      "knowledge": "在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。该故障码表明节气门踏板位置传感器B电路电压突然变化。"
    }
  ],
  "P0B08": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B08",
      "zh-cn": "辅助变速器液泵电机W相电流高",
      "en-us": "Auxiliary Transmission Fluid Pump Motor Phase W Current High",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0592": [
    {
      "scope": "所有汽车制造商",
      "code": "P0592",
      "zh-cn": "定速巡航系统多功能输入B电路低",
      "en-us": "Cruise Control Multi-Function Input B Circuit Low",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。故障原因包括定速巡航多功能输入开关，电路，接头等。"
    }
  ],
  "P078A": [
    {
      "scope": "所有汽车制造商",
      "code": "P078A",
      "zh-cn": "换档正时电磁阀B",
      "en-us": "Shift Timing Solenoid B",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0A69": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A69",
      "zh-cn": "驱动电机B，V相电流",
      "en-us": "Drive Motor B Phase V Current",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0093": [
    {
      "scope": "所有汽车制造商",
      "code": "P0093",
      "zh-cn": "燃油系统检测到泄漏 - 大量泄漏",
      "en-us": "Fuel System Leak Detected - Large Leak",
      "sys": "燃油, 空气或排放控制",
      "knowledge": ""
    }
  ],
  "P0C1E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C1E",
      "zh-cn": "辅助变速器液泵控制模块内部温度传感器电路低",
      "en-us": "Auxiliary Transmission Fluid Pump Control Module Internal Temperature Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "该故障码表明控制模块内部温度传感器信号电路电压超出了校准的最大范围。故障原因内部温度传感器，电路，接头，或控制模块。"
    }
  ],
  "P0688": [
    {
      "scope": "所有汽车制造商",
      "code": "P0688",
      "zh-cn": "发动机控制模块（ECM）/动力总成控制模块（PCM）电源继电器监控电路/开路",
      "en-us": "ECM/PCM Power Relay Sense Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。发动机控制模块继电器的作用是在点火开关关闭以后，继续保持发动机控制模块的供电，直到发动机控制模块完成关闭过程。如果被动防盗系统（PATS）显示钥匙处于ON（运行）或START（启动）的位置，而点火开关位置（ISP-R）电路显示OFF（关），ACC（附件），LOCK（锁），该故障码会出现。故障原因包括点火电路保险丝，点火开关，ISP-R电路，ECU继电器，被动防盗系统，ECU等。"
    }
  ],
  "P0AE2": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AE2",
      "zh-cn": "混合动力电池预充电接触器电路卡在关闭位置",
      "en-us": "Hybrid Battery Precharge Contactor Circuit Stuck Closed",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果混合动力汽车电子控制单元如果发现第1系统主继电器（SMR1）发生故障，该故障码会出现。"
    }
  ],
  "P012B": [
    {
      "scope": "所有汽车制造商",
      "code": "P012B",
      "zh-cn": "涡轮/超级增压器进口压力传感器 - 电路范围/性能",
      "en-us": "Turbocharger/Supercharger Inlet Pressure Sensor - Circuit Range/Perfo",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。该故障码表明进口压力传感器（节气门阀下游）电路电压出错。该故障码对有些车辆可能是歧管绝对压力（MAP）传感器（MAP）的问题。"
    }
  ],
  "P0143": [
    {
      "scope": "所有汽车制造商",
      "code": "P0143",
      "zh-cn": "氧传感器电路低电压（第1排,传感器 3）",
      "en-us": "O2 Sensor Circuit Low Voltage (Bank 1, Sensor 3)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。当加热氧传感器信号的电压在设定的时间段内持续低于156毫伏时，该故障码就会出现。故障原因包括氧传感器由于燃油中含硅而被污染，氧传感器信号和地线电路交叉，氧传感器信号电路短路到接地，氧传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0190": [
    {
      "scope": "所有汽车制造商",
      "code": "P0190",
      "zh-cn": "燃油分供管压力传感器A电路",
      "en-us": "Fuel Rail Pressure Sensor A Circuit",
      "sys": "燃油或空气",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。电子控制单元（ECU）监控燃油分供管压力传感器的参考电压。如果这个电压超在设定的时间段内出正常范围，则该故障码会出现。故障原因包括燃油压力调节器阀故障，燃油压力传感器故障，燃油泵控制模块故障，燃油泵故障等。"
    }
  ],
  "P0816": [
    {
      "scope": "所有汽车制造商",
      "code": "P0816",
      "zh-cn": "降挡开关电路",
      "en-us": "Downshift Switch Circuit",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0A6D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A6D",
      "zh-cn": "驱动电机B，W相电流低",
      "en-us": "Drive Motor B Phase W Current Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0031": [
    {
      "scope": "所有汽车制造商",
      "code": "P0031",
      "zh-cn": "热氧传感器加热器控制电路低 （第1排，传感器1）",
      "en-us": "HO2S Heater Control Circuit Low (Bank 1, Sensor 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）通过控制氧传感器加热器的开/关来保持氧传感器780oC的温度。如果加热器的控制电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0935": [
    {
      "scope": "所有汽车制造商",
      "code": "P0935",
      "zh-cn": "液压传感器电路高",
      "en-us": "Hydraulic Pressure Sensor Circuit High",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P02B3": [
    {
      "scope": "所有汽车制造商",
      "code": "P02B3",
      "zh-cn": "燃油（空燃比）修剪在最低限 - 气缸7",
      "en-us": "Cylinder 7 - Fuel Trim at Min Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最低极限超过一定时间，该故障码会出现。"
    }
  ],
  "P0ABD": [
    {
      "scope": "所有汽车制造商",
      "code": "P0ABD",
      "zh-cn": "混合动力电池组电压监控A电路高",
      "en-us": "Hybrid Battery Pack Voltage Sense A Circuit High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0759": [
    {
      "scope": "所有汽车制造商",
      "code": "P0759",
      "zh-cn": "换档电磁阀B间歇",
      "en-us": "Shift Solenoid B Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0A24": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A24",
      "zh-cn": "发电机扭矩传感器电路低",
      "en-us": "Generator Torque Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "控制模块检测到发电机转矩传感器信号超出校准的正常范围。"
    }
  ],
  "P0095": [
    {
      "scope": "所有汽车制造商",
      "code": "P0095",
      "zh-cn": "进气温度（IAT）传感器2电路 （第1排）",
      "en-us": "Intake Air Temperature Sensor 2 Circuit (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。该故障码表明进气温度（IAT）传感器信号电压超出校准的正常值。"
    }
  ],
  "P0732": [
    {
      "scope": "所有汽车制造商",
      "code": "P0732",
      "zh-cn": "2档齿轮比不正确",
      "en-us": "Gear 2 Incorrect Ratio",
      "sys": "变速箱",
      "knowledge": "车辆在2档指令打开的情况下运行，电子控制单元（ECU）检测到2档齿轮比不正确。故障原因包括变速器液液位太低，换档电磁阀，变速器液压传感器，阀体内的电磁阀故障，输入轴速度传感器，输出轴速度传感器，电路，接头，变速器控制模块故障等。"
    }
  ],
  "P0691": [
    {
      "scope": "所有汽车制造商",
      "code": "P0691",
      "zh-cn": "风扇1控制电路低",
      "en-us": "Fan 1 Control Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到风扇1（低速）控制变量（FCV）电路电压低于校准的最低值。故障原因包括风扇本身或其控制电路，接头等。"
    }
  ],
  "P0565": [
    {
      "scope": "所有汽车制造商",
      "code": "P0565",
      "zh-cn": "定速巡航系统 - ON（开） - 信号",
      "en-us": "Cruise Control On Signal",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。在钥匙开发动机运转（KOER）自检中，电子控制单元（ECU）发现定速巡航ON（开）键没有被按下。故障原因包括定速巡航主开关，电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P0B85": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B85",
      "zh-cn": "混合动力电池电压监控O电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense O Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P02A1": [
    {
      "scope": "所有汽车制造商",
      "code": "P02A1",
      "zh-cn": "喷油器泄漏 - 气缸2",
      "en-us": "Cylinder 2 - Injector Leaking",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第2缸喷油器发生泄漏。"
    }
  ],
  "P0810": [
    {
      "scope": "所有汽车制造商",
      "code": "P0810",
      "zh-cn": "离合器位置控制错误",
      "en-us": "Clutch Position Control Error",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0A97": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A97",
      "zh-cn": "混合动力电池组冷却风扇2性能或卡在关闭位置",
      "en-us": "Hybrid Battery Pack Cooling Fan 2 Performance/Stuck Off",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块根据来自电池温度传感器的信号来控制电池风扇的开启或关闭。如果实际电池组温度比基于冷却风扇性能估计的电池组温度高出一设定值，控制模块认为电池组风扇故障或卡在关的位置。"
    }
  ],
  "P066C": [
    {
      "scope": "所有汽车制造商",
      "code": "P066C",
      "zh-cn": "气缸2电热塞控制电路低",
      "en-us": "Cylinder 2 Glow Plug Control Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸2电热塞电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0956": [
    {
      "scope": "所有汽车制造商",
      "code": "P0956",
      "zh-cn": "自动换档手动（ASM）变速器模式（动力/冬季/运动/等）电路范围/性能",
      "en-us": "Auto Shift Manual Mode Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "自动换档手动变速器允许司机将变速器打入手动模式，手动控制升档或降档。"
    }
  ],
  "P0516": [
    {
      "scope": "所有汽车制造商",
      "code": "P0516",
      "zh-cn": "电池温度传感器电路低",
      "en-us": "Battery Temperature Sensor Circuit Low",
      "sys": "车速及怠速控制",
      "knowledge": "电池温度传感器位于汽车电池托盘的底部。它的主要作用是将电池温度以电信号的形式传输给电子控制单元（ECU），以帮助决定充电速度。如果ECU检测到电池温度传感器电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0B6C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B6C",
      "zh-cn": "混合动力电池电压监控J电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense J Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P047A": [
    {
      "scope": "所有汽车制造商",
      "code": "P047A",
      "zh-cn": "排气压力传感器B电路",
      "en-us": "Exhaust Pressure Sensor B Circuit",
      "sys": "排放控制",
      "knowledge": "排气压力传感器的作用是将排气系统压力以电信号的形式输送给电子控制单元（ECU）。如果ECU检测到排气压力传感器A电路电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P0A0B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A0B",
      "zh-cn": "高压系统联锁电路性能",
      "en-us": "High Voltage System Interlock Circuit Performance",
      "sys": "混合动力系统",
      "knowledge": "高压系统联锁的功能是：在当车辆静止时，如果安全装置有问题（举例说，充电接头或转化器没有盖好），就会关闭系统主继电器。如果控制模块检测到高压联锁电路故障，该故障码会出现。"
    }
  ],
  "P0C2C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C2C",
      "zh-cn": "辅助变速器液泵控制模块回馈信号范围/性能",
      "en-us": "Auxiliary Transmission Fluid Pump Control Module Feedback Signal Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0B0D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B0D",
      "zh-cn": "辅助变速器液泵电机控制模块",
      "en-us": "Auxiliary Transmission Fluid Pump Motor Control Module",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P064E": [
    {
      "scope": "所有汽车制造商",
      "code": "P064E",
      "zh-cn": "内部控制模块氧传感器处理器性能（第2排）",
      "en-us": "Internal Control Module O2 Sensor Processor Performance (Bank 2)",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）会监控氧传感器的集成电路。如果ECU发现内部电路或通讯问题，该故障码会出现。故障原因是电子控制单元（ECU）。"
    }
  ],
  "P068A": [
    {
      "scope": "所有汽车制造商",
      "code": "P068A",
      "zh-cn": "发动机控制模块（ECM）/动力总成控制模块（PCM）电源继电器去能性能 - 太早",
      "en-us": "ECM/PCM Power Relay De-Energized Performance - Too Early",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。发动机控制模块继电器的作用是在点火开关关闭以后，继续保持发动机控制模块的供电，直到发动机控制模块完成关闭过程。"
    }
  ],
  "P02E6": [
    {
      "scope": "所有汽车制造商",
      "code": "P02E6",
      "zh-cn": "柴油机进气流量位置传感器电路",
      "en-us": "Diesel Intake Air Flow Position Sensor Circuit",
      "sys": "燃油或空气",
      "knowledge": "柴油机进气流量控制系统通过对节气门开启角度的自动控制并与切向气道或螺旋气道的配合使用来形成有效的进气涡流，同时对进气涡流的强度进行自动控制，有效地改善了发动机的燃烧，从而优化了发动机动力性，经济性等性能指标。P02E6的故障原因包括进气翻门控制执行器位置传感器，其电路，接头，或控制模块（ECM）。"
    }
  ],
  "P040E": [
    {
      "scope": "所有汽车制造商",
      "code": "P040E",
      "zh-cn": "废气再循环阀温度传感器A电路间歇/不稳定",
      "en-us": "Exhaust Gas Recirculation Temperature Sensor A Circuit Intermittent/Erratic",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环阀（EGR）温度传感器的信号电压突然变化，该故障码会出现。"
    }
  ],
  "P021A": [
    {
      "scope": "所有汽车制造商",
      "code": "P021A",
      "zh-cn": "喷油器正时第7缸",
      "en-us": "Cylinder 7 Injection Timing",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器实际正时跟理想喷油正时偏差超过最大极限，该故障码会出现。"
    }
  ],
  "P0AF1": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AF1",
      "zh-cn": "驱动电机换流器温度传感器A电路间歇/不稳定",
      "en-us": "Drive Motor Inverter Temperature Sensor A Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0931": [
    {
      "scope": "所有汽车制造商",
      "code": "P0931",
      "zh-cn": "换档锁止电磁阀/执行器控制电路A高",
      "en-us": "Gear Shift Lock Solenoid/Actuator Control Circuit A High",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0B18": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B18",
      "zh-cn": "混合动力电池组电压监控B电路间歇/不稳定",
      "en-us": "Hybrid Battery Pack Voltage Sense B Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P003C": [
    {
      "scope": "所有汽车制造商",
      "code": "P003C",
      "zh-cn": "A凸轮轴形面控制性能或卡在关闭位置 （第1排）",
      "en-us": "A Camshaft Profile Control Performance/Stuck Off (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。该故障码表明A（进气/左/前）凸轮轴形面控制发生故障或卡在关闭位置 。"
    }
  ],
  "P021C": [
    {
      "scope": "所有汽车制造商",
      "code": "P021C",
      "zh-cn": "喷油器正时第9缸",
      "en-us": "Cylinder 9 Injection Timing",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器实际正时跟理想喷油正时偏差超过最大极限，该故障码会出现。"
    }
  ],
  "P07B8": [
    {
      "scope": "所有汽车制造商",
      "code": "P07B8",
      "zh-cn": "变速器驻车档位置传感器/开关B电路/开路",
      "en-us": "Transmission Park Position Sensor/Switch B Circuit/Open",
      "sys": "变速箱",
      "knowledge": "驻车档位置传感器的作用是将变速杆是否在驻车档的位置的信号输送给电子控制单元（ECU）。如果ECU检测到驻车档位置传感器电路电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P07B9": [
    {
      "scope": "所有汽车制造商",
      "code": "P07B9",
      "zh-cn": "变速器驻车档位置传感器/开关B电路低",
      "en-us": "Transmission Park Position Sensor/Switch B Circuit Low",
      "sys": "变速箱",
      "knowledge": "驻车档位置传感器的作用是将变速杆是否在驻车档的位置的信号输送给电子控制单元（ECU）。如果ECU检测到驻车档位置传感器电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0869": [
    {
      "scope": "所有汽车制造商",
      "code": "P0869",
      "zh-cn": "变速器液压力高",
      "en-us": "Transmission Fluid Pressure High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器将变速器液压力已电信号的形式输送给变速器控制模块（TCU），变速器液压力控制电磁阀负责控制变速器液压力。"
    }
  ],
  "P0BD0": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BD0",
      "zh-cn": "发电机换流器温度传感器电路间歇/不稳定",
      "en-us": "Generator Inverter Temperature Sensor Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P0147": [
    {
      "scope": "所有汽车制造商",
      "code": "P0147",
      "zh-cn": "氧传感器加热器电路（第1排，传感器 3）",
      "en-us": "O2 Sensor Heater Circuit (Bank 1, Sensor 3)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）持续监测加热氧传感器加热器，以确保没有开路，短路，或电流消耗过度的情况。如果电流消耗超过校准的极限，或监测到开路或短路，该故障码就会出现。故障原因包括氧传感器加热器电路，接头故障，氧传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0331": [
    {
      "scope": "所有汽车制造商",
      "code": "P0331",
      "zh-cn": "爆震传感器2电路范围/性能（第2排）",
      "en-us": "Knock Sensor 2 Circuit Range/Performance (Bank 2)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压出错，该故障码会出现。故障原因包括爆震传感器电路，接头，其本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P02DC": [
    {
      "scope": "所有汽车制造商",
      "code": "P02DC",
      "zh-cn": "喷油器补偿学习在最低限气缸9",
      "en-us": "Cylinder 9 Fuel Injector Offset Learning At Min Limit",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第9缸喷油器补偿学习已经达到了最低学习极限，该故障码会出现。"
    }
  ],
  "P0482": [
    {
      "scope": "所有汽车制造商",
      "code": "P0482",
      "zh-cn": "风扇3控制电路",
      "en-us": "Fan 3 Control Circuit",
      "sys": "排放控制",
      "knowledge": "电子控制单元（ECU）如果发现中速风扇控制电路在接地（风扇开）的情况下，仍有明显电流消耗；或中速风扇控制电路没有接地（风扇关），而探测不到电压时；该故障码会出现。"
    }
  ],
  "P0513": [
    {
      "scope": "所有汽车制造商",
      "code": "P0513",
      "zh-cn": "防盗钥匙不正确",
      "en-us": "Incorrect Immobilizer Key",
      "sys": "车速及怠速控制",
      "knowledge": "防盗控制模块的作用是保证汽车仅在专用钥匙存在并且它跟各类部件相匹配的时候才会允许汽车启动。"
    }
  ],
  "P0716": [
    {
      "scope": "所有汽车制造商",
      "code": "P0716",
      "zh-cn": "输入轴/涡轮速度传感器A电路范围/性能",
      "en-us": "Input/Turbine Speed Sensor A Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "涡轮转速传感器（TSS），也叫输入轴转速传感器（ISS），其作用是将输入轴（也就是液力变矩器）的转速以频率的形式输送给变速器控制模块（TCU）,这些信息对于调节液力变矩器锁定离合器尤为关键。该故障码表明输入轴转速传感器信号电路电压出错。故障原因包括变速器液液位太低或变质太脏，变速器液温度（TFT）传感器或其电路接头故障，变速器液温度（TFT）传感器校准错误，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P014A": [
    {
      "scope": "所有汽车制造商",
      "code": "P014A",
      "zh-cn": "氧传感器延迟响应 - （空燃比）浓到稀 （第2排，传感器 2）",
      "en-us": "O2 Sensor Delayed Response - Rich to Lean (Bank 2, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。如果电子控制单元（ECU）发现在空燃比由浓变稀的过程中，电压变化速率滞后，该故障码就会出现。"
    }
  ],
  "P005E": [
    {
      "scope": "所有汽车制造商",
      "code": "P005E",
      "zh-cn": "涡轮/超级增压器增压控制B供电电压电路低",
      "en-us": "Turbocharger/Supercharger Boost Control B Supply Voltage Circuit Low",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。涡轮/超级增压器增压控制器的作用是当增压压力达到设定值后，气压推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮速度，控制增压水平。该故障码表明涡轮/超级增压器增压控制B供电电压低于校准的最低值。"
    }
  ],
  "P0917": [
    {
      "scope": "所有汽车制造商",
      "code": "P0917",
      "zh-cn": "换档位置电路高",
      "en-us": "Gear Shift Position Circuit High",
      "sys": "变速箱",
      "knowledge": "换档位置（监控换档杆向前/向后的位置，奇/偶档位）电路故障。"
    }
  ],
  "P0C72": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C72",
      "zh-cn": "混合动力电池温度传感器E/F相关性",
      "en-us": "Hybrid Battery Temperature Sensor E/F Correlation",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器E/F的信号差超出了校准的最大极限，该故障码会出现。"
    }
  ],
  "P06BE": [
    {
      "scope": "所有汽车制造商",
      "code": "P06BE",
      "zh-cn": "气缸6电热塞电路范围/性能",
      "en-us": "Cylinder 6 Glow Plug Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸6电热塞电路发生故障，则该故障码会出现。"
    }
  ],
  "P0002": [
    {
      "scope": "所有汽车制造商",
      "code": "P0002",
      "zh-cn": "燃油量调节器控制电路范围/性能",
      "en-us": "Fuel Volume Regulator Control Circuit Range/Performance",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "（在喷油嘴被广泛使用的新型汽车中，燃油量调节器已经很少被使用）"
    }
  ],
  "P0BBA": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BBA",
      "zh-cn": "混合动力电池电压监控Z电路低",
      "en-us": "Hybrid Battery Voltage Sense Z Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0838": [
    {
      "scope": "所有汽车制造商",
      "code": "P0838",
      "zh-cn": "四轮驱动（4WD）开关电路低",
      "en-us": "Four Wheel Drive (4WD) Switch Circuit Low",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0A99": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A99",
      "zh-cn": "混合动力电池组冷却风扇2控制电路低",
      "en-us": "Hybrid Battery Pack Cooling Fan 2 Control Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "风扇电机控制器负责调节混合动力电池组冷却风扇的电压。如果冷却风扇1控制电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0551": [
    {
      "scope": "所有汽车制造商",
      "code": "P0551",
      "zh-cn": "动力转向压力传感器/开关电路范围/性能",
      "en-us": "Power Steering Pressure Sensor/Switch Circuit Range/Performance",
      "sys": "车速及怠速控制",
      "knowledge": "动力转向压力（PSP）传感器根据电位器的原理将动力转向负载压力以电压信号的形式传输给电子控制单元（ECU）。如果负载压力过大，必要的时候ECU会提高发动机怠速，关闭空调压缩机，以防止发动机死火。该故障码表明动力转向压力传感器电路发生故障。"
    }
  ],
  "P022E": [
    {
      "scope": "所有汽车制造商",
      "code": "P022E",
      "zh-cn": "增压空气冷却器旁通阀控制B电路低",
      "en-us": "Charge Air Cooler Bypass Control B Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。增压空气冷却器旁通阀的作用是将一部分空气绕开空气冷却器。这些空气随后再跟经过空气冷却器冷却过的空气混合后进入发动机，以保证进气温度高于露水温度。如果空气冷却器旁通阀控制电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P009F": [
    {
      "scope": "所有汽车制造商",
      "code": "P009F",
      "zh-cn": "燃油压力释放控制卡在开的位置",
      "en-us": "Fuel Pressure Relief Control Stuck On",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油系统过压释放阀的作用是在燃油管路因为滤清器太脏，管路阻塞等引起管路压力过大时，释放燃油管路压力。如果燃油压力释放控制卡在开的位置，该故障码会出现。"
    }
  ],
  "P0011": [
    {
      "scope": "所有汽车制造商",
      "code": "P0011",
      "zh-cn": "A凸轮轴位置执行器 - 正时过前或系统性能 （第1排）",
      "en-us": "A Camshaft Position - Timing Over-Advanced or System Performance (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。P0011的故障原因包括A进气/左/前凸轮轴正时没有设定好，凸轮轴过前原理机械性卡住，或者是执行器阀门卡在开的位置。"
    }
  ],
  "P06BD": [
    {
      "scope": "所有汽车制造商",
      "code": "P06BD",
      "zh-cn": "气缸5电热塞电路范围/性能",
      "en-us": "Cylinder 5 Glow Plug Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸5电热塞电路发生故障，则该故障码会出现。"
    }
  ],
  "P0151": [
    {
      "scope": "所有汽车制造商",
      "code": "P0151",
      "zh-cn": "氧传感器电路低电压（第2排,传感器 1）",
      "en-us": "O2 Sensor Circuit Low Voltage (Bank 2, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。当加热氧传感器信号的电压在设定的时间段内持续低于156毫伏时，该故障码就会出现。故障原因包括氧传感器电路，接头，氧传感器本身，电子控制模块等。"
    }
  ],
  "P0A36": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A36",
      "zh-cn": "发电机温度传感器电路",
      "en-us": "Generator Temperature Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车的起动机/发电机为同一个电机，一般位于变速器内。故障原因包括发电机温度传感器，电路，接头，控制模块等。"
    }
  ],
  "P012E": [
    {
      "scope": "所有汽车制造商",
      "code": "P012E",
      "zh-cn": "涡轮/超级增压器进口压力传感器 - 电路间歇/不稳定",
      "en-us": "Turbocharger/Supercharger Inlet Pressure Sensor - Circuit Intermitten",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。该故障码表明进口压力传感器（节气门阀下游）电路电压突然变化。该故障码对有些车辆可能是歧管绝对压力（MAP）传感器的问题。"
    }
  ],
  "P0C08": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C08",
      "zh-cn": "驱动电机B，U-V-W相电路/开路",
      "en-us": "Drive Motor B Phase U-V-W Circuit/Open",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0124": [
    {
      "scope": "所有汽车制造商",
      "code": "P0124",
      "zh-cn": "节气门/油门踏板位置传感器/开关A电路间歇",
      "en-us": "Throttle/Pedal Position Sensor/Switch A Circuit Intermittent",
      "sys": "燃油或空气",
      "knowledge": "在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。如果电子控制单元（ECU）检测到电子节气门踏板位置传感器1信号电压突然变化，该故障码会出现。"
    }
  ],
  "P0478": [
    {
      "scope": "所有汽车制造商",
      "code": "P0478",
      "zh-cn": "排气压力控制阀A电路高",
      "en-us": "Exhaust Pressure Control Valve A Circuit High",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。如果电子控制单元（ECU）检测到排气压力控制阀A电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0B6E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B6E",
      "zh-cn": "混合动力电池电压监控K电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense K Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0313": [
    {
      "scope": "所有汽车制造商",
      "code": "P0313",
      "zh-cn": "检测到低燃油失火",
      "en-us": "Misfire Detected With Low Fuel",
      "sys": "点火系统",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。如果电子控制单元（ECU）检测到可能会对催化转换器造成破坏的失火，故障指示灯会闪烁，此时应立即关闭发动机。该故障码表明电子控制单元（ECU）检测到1）气缸失火，2）燃油液位很低。"
    }
  ],
  "P0919": [
    {
      "scope": "所有汽车制造商",
      "code": "P0919",
      "zh-cn": "换档位置控制错误",
      "en-us": "Gear Shift Position Control Error",
      "sys": "变速箱",
      "knowledge": "换档位置（监控换档杆向前/向后的位置，奇/偶档位）控制错误。"
    }
  ],
  "P082E": [
    {
      "scope": "所有汽车制造商",
      "code": "P082E",
      "zh-cn": "换档杆Y位置电路低",
      "en-us": "Gear Lever Y Position Circuit Low",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0844": [
    {
      "scope": "所有汽车制造商",
      "code": "P0844",
      "zh-cn": "变速器液压力（TFP）传感器/开关A电路间歇",
      "en-us": "Transmission Fluid Pressure Sensor/Switch A Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P02B7": [
    {
      "scope": "所有汽车制造商",
      "code": "P02B7",
      "zh-cn": "燃油（空燃比）修剪在最低限 - 气缸8",
      "en-us": "Cylinder 8 - Fuel Trim at Min Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最低极限超过一定时间，该故障码会出现。"
    }
  ],
  "P0069": [
    {
      "scope": "所有汽车制造商",
      "code": "P0069",
      "zh-cn": "歧管绝对压力（MAP）/大气压力（BARO）相关性",
      "en-us": "Manifold Absolute Pressure - Barometric Pressure Correlation",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "歧管绝对压力（MAP）传感器的作用是测量进气歧管内的压力（真空度）。动力总成控制模块（PCM）然后会将进气歧管压力与大气压力之间的差值（跟发动机负荷成线性关系）作为确定喷油器基本喷油量的一个依据，以帮助发动机在不同负荷下达到最佳空燃比。大气压力传感器（有时候也叫高海拔补偿器，HAC）的作用是将大气压力以电信号的形式输送给电子控制模块。大气压力会随天气和海拔高度的变化而变化。压力越小，空气越稀薄。动力总成控制模块（PCM）会根据大气压力的数值来修正燃油供给，以帮助发动机达到最佳空燃比。如果电子控制单元（ECU）发现歧管绝对压力（MAP）传感器跟气压传感器的信号差在设定时间段里（2.5秒）超出校准值（通常是10.35KPa），该故障码会出现。"
    }
  ],
  "P0363": [
    {
      "scope": "所有汽车制造商",
      "code": "P0363",
      "zh-cn": "检测到失火 - 燃油输送被终止",
      "en-us": "Misfire Detected - Fueling Disabled",
      "sys": "点火系统",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。如果电子控制单元（ECU）检测到可能会对催化转换器造成破坏的失火，故障指示灯会闪烁，此时应立即关闭发动机。该故障码表明电子控制单元（ECU）检测到失火。为防止对催化转换器造成破坏，燃油输送已被终止。"
    }
  ],
  "P0159": [
    {
      "scope": "所有汽车制造商",
      "code": "P0159",
      "zh-cn": "氧传感器电路反应太慢（第2排，传感器 2）",
      "en-us": "O2 Sensor Circuit Slow Response (Bank 2, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。当电压变化速率低于校准值时，电子控制单元（ECU）就会开始修改空燃比试图提高氧传感器的电压变化速率。如果ECU已经达到了可以接受的燃油修剪限制或者已超过了可接受的燃油修剪的时间长度，而仍然没有监测到可以接受的电压变化速率的话，该故障码就会出现。故障原因包括氧传感器由于燃油中含硅而被污染，氧传感器信号电路开路，氧传感器本身故障，排气管或排气歧管泄漏，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0939": [
    {
      "scope": "所有汽车制造商",
      "code": "P0939",
      "zh-cn": "液压油温度传感器电路低",
      "en-us": "Hydraulic Oil Temperature Sensor Circuit Low",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0889": [
    {
      "scope": "所有汽车制造商",
      "code": "P0889",
      "zh-cn": "变速器控制模块（TCU）电源继电器监控电路范围/性能",
      "en-us": "TCU Power Relay Sense Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。控制模块继电器的作用是在点火开关关闭以后，继续保持控制模块的供电，直到控制模块完成关闭过程。"
    }
  ],
  "P053A": [
    {
      "scope": "所有汽车制造商",
      "code": "P053A",
      "zh-cn": "曲轴箱强制通风系统加热器控制电路/开路",
      "en-us": "Positive Crankcase Ventilation Heater Control Circuit /Open",
      "sys": "车速及怠速控制",
      "knowledge": "曲轴箱强制通风（PCV）系统的作用是将曲轴箱内的窜气（发动机作功燃烧过程的末端，一些未燃混合气在高压力下从活塞环漏入曲轴箱内，业内将这种泄漏称为窜气）通过发动机工作产生的真空导入进气歧管，然后窜气会随着新鲜的空气一起进入汽缸烧掉，从而降低污染提高发动机效率。该故障码表明电子控制单元（PCV）检测到曲轴箱强制通风加热器电路电压超出正常范围。"
    }
  ],
  "P0157": [
    {
      "scope": "所有汽车制造商",
      "code": "P0157",
      "zh-cn": "氧传感器电路低电压（第2排,传感器 2）",
      "en-us": "O2 Sensor Circuit Low Voltage (Bank 2, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。当加热氧传感器信号的电压在设定的时间段内持续低于156毫伏时，该故障码就会出现。故障原因包括氧传感器由于燃油中含硅而被污染，氧传感器信号和地线电路交叉，氧传感器信号电路短路到接地，氧传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0233": [
    {
      "scope": "所有汽车制造商",
      "code": "P0233",
      "zh-cn": "燃油泵二级电路间歇故障",
      "en-us": "Fuel Pump Secondary Circuit Intermittent",
      "sys": "燃油或空气",
      "knowledge": "燃油泵电路分为主电路和二级电路。主电路负责控制燃油泵，燃油泵继电器利用来自电子控制单元（ECU）的低电流控制电磁线圈，从而接通燃油泵高电流。二级电路指的是燃油泵监控器（FPM）电路，负责监控燃油泵的电路反馈。P0233的故障原因包括包括燃油泵监控器（FPM）到燃油泵继电器的电路，燃油泵继电器电路，燃油泵继电器，电子控制单元（ECU）等。"
    }
  ],
  "P0178": [
    {
      "scope": "所有汽车制造商",
      "code": "P0178",
      "zh-cn": "燃油成分传感器电路低",
      "en-us": "Fuel Composition Sensor Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "燃油组分传感器的作用是将汽油中的乙醇含量以电信号的形式传输给电子控制单元（ECU），作为修改喷油器脉冲宽度和点火正时的依据。如果ECU检测到燃油成分传感器信号电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P025A": [
    {
      "scope": "所有汽车制造商",
      "code": "P025A",
      "zh-cn": "燃油泵模块控制电路/开路",
      "en-us": "Fuel Pump Module Control Circuit/Open",
      "sys": "燃油或空气",
      "knowledge": "燃油泵控制模块（FPM，or FPCM）是一个通过控制通往燃油泵（一般位于油箱内）电压的方式以实现电子控制模块（ECU）所需的最佳燃油压力的电脑微处理器。"
    }
  ],
  "P0445": [
    {
      "scope": "所有汽车制造商",
      "code": "P0445",
      "zh-cn": "蒸发排放系统吹扫控制阀电路短路",
      "en-us": "Evaporative Emission System Purge Control Valve Circuit Shorted",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。如果电子控制单元（ECU）检测到蒸发排放系统吹扫电磁阀控制电路有短路的情况，则该故障码会出现。故障原因包括EVAP供电电路故障，EVAP电磁阀控制电路故障，EVAP电磁阀故障，EVAP炭罐泄漏，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0A2E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A2E",
      "zh-cn": "驱动电机A温度传感器电路间歇",
      "en-us": "Drive Motor A Temperature Sensor Circuit Intermittent",
      "sys": "混合动力系统",
      "knowledge": "驱动电机A温度传感器电路发生故障。故障原因包括电路，接头，电子控制单元，驱动电机等。有些车辆的驱动电机温度传感器跟驱动电机是一体的。所以，如果确定是该温度传感器本身的问题，有可能需要换掉整个驱动电机。"
    }
  ],
  "P0406": [
    {
      "scope": "所有汽车制造商",
      "code": "P0406",
      "zh-cn": "废气再循环阀传感器A电路高",
      "en-us": "Exhaust Gas Recirculation Sensor A Circuit High",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环（EGR）传感器的信号电压高于校准的最高值，该故障码会出现。故障原因包括DPFE传感器接头故障，电路短路到正极，传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0878": [
    {
      "scope": "所有汽车制造商",
      "code": "P0878",
      "zh-cn": "变速器液压力（TFP）传感器/开关D电路高",
      "en-us": "Transmission Fluid Pressure Sensor/Switch D Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0085": [
    {
      "scope": "所有汽车制造商",
      "code": "P0085",
      "zh-cn": "排气阀门控制电磁阀电路低 （第2排）",
      "en-us": "Exhaust Valve Control Solenoid Circuit Low (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。如果排气凸轮轴调节阀电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P084E": [
    {
      "scope": "所有汽车制造商",
      "code": "P084E",
      "zh-cn": "变速器液压力（TFP）传感器/开关H电路间歇",
      "en-us": "Transmission Fluid Pressure Sensor/Switch H Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0A6A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A6A",
      "zh-cn": "驱动电机B，V相电流低",
      "en-us": "Drive Motor B Phase V Current Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0320": [
    {
      "scope": "所有汽车制造商",
      "code": "P0320",
      "zh-cn": "点火/分电器发动机转速输入电路",
      "en-us": "Ignition/Distributor Engine Speed Input Circuit",
      "sys": "点火系统",
      "knowledge": "如果电子控制单元（ECU）探测到在发动机速度传感器到ECU的输入信号上有2个连续不稳定霍尔拾波器（PIP）脉冲，则该故障码会出现。故障原因包括点火线圈，分电器，点火控制模块，发动机转速传感器，曲轴位置（CKP）传感器，及电路，接头等。"
    }
  ],
  "P0721": [
    {
      "scope": "所有汽车制造商",
      "code": "P0721",
      "zh-cn": "输出轴速度传感器电路范围/性能",
      "en-us": "Output Speed Sensor Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "输出速度传感器（OSS）的任务是将变速器输出轴的速度信号传送给电子控制单元（ECU）。在汽车正常行驶的时候，如果ECU检测到OSS信号干扰，则该故障码会出现。故障原因包括OSS传感器受到非标准配件的干扰，OSS传感器本身故障，电路，接头故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0ACB": [
    {
      "scope": "所有汽车制造商",
      "code": "P0ACB",
      "zh-cn": "混合动力电池温度传感器C电路范围/性能",
      "en-us": "Hybrid Battery Temperature Sensor C Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路出错，该故障码会出现。"
    }
  ],
  "P051C": [
    {
      "scope": "所有汽车制造商",
      "code": "P051C",
      "zh-cn": "曲轴箱压力传感器电路低",
      "en-us": "Crankcase Pressure Sensor Circuit Low",
      "sys": "车速及怠速控制",
      "knowledge": "曲轴箱压力传感器的作用是将曲轴箱内的压力以电信号的形式输送给电子控制单元（ECU），以检测曲轴箱强制通风系统的工作状态。如果ECU检测到曲轴箱压力传感器信号电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P073F": [
    {
      "scope": "所有汽车制造商",
      "code": "P073F",
      "zh-cn": "不能挂1档",
      "en-us": "Unable to Engage Gear 1",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0973": [
    {
      "scope": "所有汽车制造商",
      "code": "P0973",
      "zh-cn": "换档电磁阀A控制电路低",
      "en-us": "Shift Solenoid A Control Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0202": [
    {
      "scope": "所有汽车制造商",
      "code": "P0202",
      "zh-cn": "喷油器电路/开路 - 第2缸",
      "en-us": "Injector Circuit/Open - Cylinder 2",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器控制电路出错，该故障码会出现。故障原因包括喷油器接口，电路故障，喷油器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0775": [
    {
      "scope": "所有汽车制造商",
      "code": "P0775",
      "zh-cn": "压力控制电磁阀B",
      "en-us": "Pressure Control Solenoid B",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。故障原因包括压力控制电磁阀控制电路，接头，或电磁阀本身。控制模块故障也会导致该故障码出现。"
    }
  ],
  "P0B29": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B29",
      "zh-cn": "混合动力电池B电压低",
      "en-us": "Hybrid Battery B Voltage Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P07B3": [
    {
      "scope": "所有汽车制造商",
      "code": "P07B3",
      "zh-cn": "变速器驻车档位置传感器/开关A电路低",
      "en-us": "Transmission Park Position Sensor/Switch A Circuit Low",
      "sys": "变速箱",
      "knowledge": "驻车档位置传感器的作用是将变速杆是否在驻车档的位置的信号输送给电子控制单元（ECU）。如果ECU检测到驻车档位置传感器电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P02EC": [
    {
      "scope": "所有汽车制造商",
      "code": "P02EC",
      "zh-cn": "柴油机进气流量控制系统 - 检测到高进气流量",
      "en-us": "Diesel Intake Air Flow Control System - High Air Flow Detected",
      "sys": "燃油或空气",
      "knowledge": "柴油机进气流量控制系统通过对节气门开启角度的自动控制并与切向气道或螺旋气道的配合使用来形成有效的进气涡流，同时对进气涡流的强度进行自动控制，有效地改善了发动机的燃烧，从而优化了发动机动力性，经济性等性能指标。P02EC表明电子控制模块（ECM）检测到过高的进气流速。"
    }
  ],
  "P049C": [
    {
      "scope": "所有汽车制造商",
      "code": "P049C",
      "zh-cn": "废气再循环B流量太高",
      "en-us": "Exhaust Gas Recirculation B Flow Excessive Detected",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。该故障码表明废气再循环B的流量高于正常范围。"
    }
  ],
  "P06BF": [
    {
      "scope": "所有汽车制造商",
      "code": "P06BF",
      "zh-cn": "气缸7电热塞电路范围/性能",
      "en-us": "Cylinder 7 Glow Plug Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸7电热塞电路发生故障，则该故障码会出现。"
    }
  ],
  "P0753": [
    {
      "scope": "所有汽车制造商",
      "code": "P0753",
      "zh-cn": "换档电磁阀A电子问题",
      "en-us": "Shift Solenoid A Electrical",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0ACA": [
    {
      "scope": "所有汽车制造商",
      "code": "P0ACA",
      "zh-cn": "混合动力电池温度传感器C电路",
      "en-us": "Hybrid Battery Temperature Sensor C Circuit",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压超出正常范围，该故障码会出现。"
    }
  ],
  "P0A5A": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A5A",
      "zh-cn": "发电机电流传感器电路范围/性能",
      "en-us": "Generator Current Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P002D": [
    {
      "scope": "所有汽车制造商",
      "code": "P002D",
      "zh-cn": "B 凸轮轴形面控制电路开路 （第2排）",
      "en-us": "B Camshaft Profile Control Circuit/Open (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。该故障码表明B（排气/右/后）凸轮轴形面控制电路故障。"
    }
  ],
  "P004D": [
    {
      "scope": "所有汽车制造商",
      "code": "P004D",
      "zh-cn": "涡轮/超级增压器增压控制B电路高",
      "en-us": "Turbocharger/Supercharger Boost Control B Circuit High",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。涡轮/超级增压器增压控制器的作用是当增压压力达到设定值后，气压推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮速度，控制增压水平。该故障码表明涡轮/超级增压器增压控制电路电压高于校准的最高值。"
    }
  ],
  "P0176": [
    {
      "scope": "所有汽车制造商",
      "code": "P0176",
      "zh-cn": "燃油组分传感器电路",
      "en-us": "Fuel Composition Sensor Circuit",
      "sys": "燃油或空气",
      "knowledge": "燃油组分传感器的作用是将汽油中的乙醇含量以电信号的形式传输给电子控制单元（ECU），作为修改喷油器脉冲宽度和点火正时的依据。如果ECU检测到燃油组分传感器电路电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P00B4": [
    {
      "scope": "所有汽车制造商",
      "code": "P00B4",
      "zh-cn": "（水箱）散热器冷却液温度传感器电路高",
      "en-us": "Radiator Coolant Temperature Sensor Circuit High",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "（水箱）散热器冷却液温度传感器采用热敏电阻的原理将散热器温度信号以电压的形式传输到电子控制单元（ECU）。如果ECU检测到（水箱）散热器冷却液温度传感器信号电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P061E": [
    {
      "scope": "所有汽车制造商",
      "code": "P061E",
      "zh-cn": "内部控制模块-刹车信号性能",
      "en-us": "Internal Control Module Brake Signal Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P032C": [
    {
      "scope": "所有汽车制造商",
      "code": "P032C",
      "zh-cn": "爆震传感器3电路低 （第1排）",
      "en-us": "Knock Sensor 3 Circuit Low (Bank 1)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0569": [
    {
      "scope": "所有汽车制造商",
      "code": "P0569",
      "zh-cn": "定速巡航系统 - COAST（滑行） - 信号",
      "en-us": "Cruise Control Coast Signal",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。在钥匙开发动机运转（KOER）自检中，电子控制单元（ECU）发现定速巡航COAST（滑行）键没有被按下。故障原因包括定速巡航选择器开关，电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P0747": [
    {
      "scope": "所有汽车制造商",
      "code": "P0747",
      "zh-cn": "压力控制电磁阀A卡在开的位置",
      "en-us": "Pressure Control Solenoid A Stuck On",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。故障原因包括压力控制（PC）电磁阀电路，接头，或电磁阀本身。控制模块故障也可能导致该故障码出现。"
    }
  ],
  "P02FA": [
    {
      "scope": "所有汽车制造商",
      "code": "P02FA",
      "zh-cn": "柴油机进气流量位置传感器 最小/最大停止性能",
      "en-us": "Diesel Intake Air Flow Position Sensor Minimum/Maximum Stop Performance",
      "sys": "燃油或空气",
      "knowledge": "柴油机进气流量控制系统通过对节气门开启角度的自动控制并与切向气道或螺旋气道的配合使用来形成有效的进气涡流，同时对进气涡流的强度进行自动控制，有效地改善了发动机的燃烧，从而优化了发动机动力性，经济性等性能指标。P02FA表明电子控制模块（ECM）在自检时检测到进气翻门控制执行器位置传感器的最大或最小停止位置出错。"
    }
  ],
  "P022A": [
    {
      "scope": "所有汽车制造商",
      "code": "P022A",
      "zh-cn": "增压空气冷却器旁通阀控制A电路/开路",
      "en-us": "Charge Air Cooler Bypass Control A Circuit /Open",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。增压空气冷却器旁通阀的作用是将一部分空气绕开空气冷却器。这些空气随后再跟经过空气冷却器冷却过的空气混合后进入发动机，以保证进气温度高于露水温度。如果空气冷却器旁通阀控制电路故障，该故障码会出现。"
    }
  ],
  "P0058": [
    {
      "scope": "所有汽车制造商",
      "code": "P0058",
      "zh-cn": "热氧传感器加热器控制电路高 （第2排，传感器2）",
      "en-us": "HO2S Heater Control Circuit High (Bank 2, Sensor 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）通过控制氧传感器加热器的开/关来保持氧传感器780oC的温度。如果加热器的控制电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0720": [
    {
      "scope": "所有汽车制造商",
      "code": "P0720",
      "zh-cn": "输出速度传感器电路",
      "en-us": "Output Speed Sensor Circuit",
      "sys": "变速箱",
      "knowledge": "输出速度传感器（OSS）的任务是将变速器输出轴的速度信号传送给电子控制单元（ECU）。在汽车正常行驶的时候，如果ECU检测到OSS的信号为零，则该故障码会出现。"
    }
  ],
  "P0AEB": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AEB",
      "zh-cn": "混合动力电池温度传感器D电路高",
      "en-us": "Hybrid Battery Temperature Sensor D Circuit High",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P084B": [
    {
      "scope": "所有汽车制造商",
      "code": "P084B",
      "zh-cn": "变速器液压力（TFP）传感器/开关H电路范围/性能",
      "en-us": "Transmission Fluid Pressure Sensor/Switch H Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P007C": [
    {
      "scope": "所有汽车制造商",
      "code": "P007C",
      "zh-cn": "增压空气冷却器温度传感器电路低（第1排）",
      "en-us": "Charge Air Cooler Temperature Sensor Circuit Low (Bank 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。增压空气冷却器（也叫中冷器）是用来冷却经增压器出来的增压空气的。空气在经过增压器后，压力增加，温度升高。通过增压空气冷却器可降低增压空气温度，从而提高空气密度，提高充气效率，以达到提发动机功率和降低排放的目的。故障原因包括增压空气温度（CAT）传感器，电路，接头，控制模块等。"
    }
  ],
  "P060B": [
    {
      "scope": "所有汽车制造商",
      "code": "P060B",
      "zh-cn": "内部控制模块模拟/数字处理性能",
      "en-us": "Internal Control Module A/D Processing Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P0879": [
    {
      "scope": "所有汽车制造商",
      "code": "P0879",
      "zh-cn": "变速器液压力（TFP）传感器/开关D电路间歇",
      "en-us": "Transmission Fluid Pressure Sensor/Switch D Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P02CA": [
    {
      "scope": "所有汽车制造商",
      "code": "P02CA",
      "zh-cn": "涡轮/超级增压器B处于增压过度状态",
      "en-us": "Turbocharger/Supercharger B Overboost Condition",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。为防止涡轮/超级增压器过度增压，当压力到达设定的最高值时，气压会推动废气门执行器（气动机械式）将部分尾气绕开涡轮，从而降低涡轮转速，降低增压水平。如果废气门，或者废气门调节阀发生故障，可能会导致系统增压过度。"
    }
  ],
  "P0050": [
    {
      "scope": "所有汽车制造商",
      "code": "P0050",
      "zh-cn": "热氧传感器加热器控制电路 （第2排，传感器1）",
      "en-us": "HO2S Heater Control Circuit (Bank 2, Sensor 1)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）通过控制氧传感器加热器的开/关来保持氧传感器780oC的温度。如果氧传感器在设定的时间内没有达到要求的温度，或ECU无法维持设定的温度，该故障码会出现。"
    }
  ],
  "P0436": [
    {
      "scope": "所有汽车制造商",
      "code": "P0436",
      "zh-cn": "催化转换器温度传感器电路范围/性能 （第2排，传感器1）",
      "en-us": "Catalyst Temperature Sensor Circuit Range/Performance (Bank 2, Sensor 1)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器温度传感器电路出错。故障原因包括催化转换器温度传感器，电路，接头，或电子控制单元（ECU）故障。"
    }
  ],
  "P0AA4": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AA4",
      "zh-cn": "混合动力电池负极接触器电路卡住在关的位置",
      "en-us": "Hybrid Battery Negative Contactor Circuit Stuck Closed",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果第3系统主继电器（SMR）卡住，有可能会导致高压系统不能关闭。所以，混合动力汽车电子控制单元如果一旦发现其中的任何一个继电器发生故障，便会终止整个系统。"
    }
  ],
  "P068F": [
    {
      "scope": "所有汽车制造商",
      "code": "P068F",
      "zh-cn": "气缸8电热塞控制电路高",
      "en-us": "Cylinder 8 Glow Plug Control Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸8电热塞控制电路电压高于校准的最高值，则该故障码会出现。"
    }
  ],
  "P0C78": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C78",
      "zh-cn": "混合动力电池系统预充电时间太长",
      "en-us": "Hybrid Battery System Precharge Time Too Long",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0A6C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A6C",
      "zh-cn": "驱动电机B，W相电流",
      "en-us": "Drive Motor B Phase W Current",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P066B": [
    {
      "scope": "所有汽车制造商",
      "code": "P066B",
      "zh-cn": "气缸1电热塞控制电路高",
      "en-us": "Cylinder 1 Glow Plug Control Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸1电热塞电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P02F7": [
    {
      "scope": "所有汽车制造商",
      "code": "P02F7",
      "zh-cn": "喷油器电路范围/性能 - 气缸10",
      "en-us": "Cylinder 10 Injector Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到第10缸喷油器电路出错，该故障码会出现。"
    }
  ],
  "P06A8": [
    {
      "scope": "所有汽车制造商",
      "code": "P06A8",
      "zh-cn": "传感器参考电压C电路范围/性能",
      "en-us": "Sensor Reference Voltage C Circuit Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到5伏参考电压电路C出错。故障原因包括5伏参考电压电路到某个传感器的电路发生短路或短路，一个或多个传感器发生短路或开路，ECU等。"
    }
  ],
  "P02EB": [
    {
      "scope": "所有汽车制造商",
      "code": "P02EB",
      "zh-cn": "柴油机进气流量控制电机电流范围/性能",
      "en-us": "Diesel Intake Air Flow Control Motor Current Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "柴油机进气流量控制系统通过对节气门开启角度的自动控制并与切向气道或螺旋气道的配合使用来形成有效的进气涡流，同时对进气涡流的强度进行自动控制，有效地改善了发动机的燃烧，从而优化了发动机动力性，经济性等性能指标。P02EB的故障原因包括进气翻门控制电机，其电路，接头，或控制模块（ECM）。"
    }
  ],
  "P0A06": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A06",
      "zh-cn": "电机电子系统冷却液泵A控制电路低",
      "en-us": "Motor Electronics Coolant Pump A Control Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "电机电子系统冷却系统（MECS）是一套独立的为变速箱（例如eCVT）电机，控制模块以及直流/直流转换器提供冷却的系统。它拥有自己的散热器，冷却液泵，冷却液温度传感器等。电机电子冷却系统冷却液泵是一个电子控制单元（ECU）控制的12伏电压电泵。如果控制模块检测到电机电子冷却系统冷却液泵控制电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P06CF": [
    {
      "scope": "所有汽车制造商",
      "code": "P06CF",
      "zh-cn": "气缸11电热塞不正确",
      "en-us": "Cylinder 11 Glow Plug Incorrect",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。该故障码表明气缸11电热塞，其电路，接头，或电热赛控制模块（GPCM）出错。"
    }
  ],
  "P0B77": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B77",
      "zh-cn": "混合动力电池电压监控M电路",
      "en-us": "Hybrid Battery Voltage Sense M Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0391": [
    {
      "scope": "所有汽车制造商",
      "code": "P0391",
      "zh-cn": "凸轮轴轴位置传感器B电路范围/性能 （第2排）",
      "en-us": "Camshaft Position Sensor B Circuit Range/Performance (Bank 2)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。如果电子控制单元（ECU）检测到凸轮轴传感器B电路电压出错，该故障码会出现。故障原因包括凸轮轴位置（CMP）传感器电路，接头，其本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P009C": [
    {
      "scope": "所有汽车制造商",
      "code": "P009C",
      "zh-cn": "燃油压力释放控制电路低",
      "en-us": "Fuel Pressure Relief Control Circuit Low",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油系统过压释放阀的作用是在燃油管路因为滤清器太脏，管路阻塞等引起管路压力过大时，释放燃油管路压力。如果燃油压力释放控制电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0348": [
    {
      "scope": "所有汽车制造商",
      "code": "P0348",
      "zh-cn": "凸轮轴位置（CMP）传感器A电路高 （第2排）",
      "en-us": "Camshaft Position Sensor A Circuit High (Bank 2)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。该故障码表明A（进气/左/前）凸轮轴位置（CMP）传感器信号电压高于校准的最高值。故障原因包括凸轮轴位置（CMP）传感器电路，接头，其本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0642": [
    {
      "scope": "所有汽车制造商",
      "code": "P0642",
      "zh-cn": "传感器参考电压A电路低",
      "en-us": "Sensor Reference Voltage A Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到5伏参考电压电路A出错。故障原因包括5伏参考电压电路到某个传感器的电路发生短路或短路，一个或多个传感器发生短路或开路，自动变速器液压传感器故障，电磁阀故障，变速器控制模块故障，变速器输入速度（RPM）传感器故障，变速器输出速度（RPM）传感器故障等。"
    }
  ],
  "P0315": [
    {
      "scope": "所有汽车制造商",
      "code": "P0315",
      "zh-cn": "曲轴位置系统变化未学习",
      "en-us": "Crankshaft Position System Variation Not Learned",
      "sys": "点火系统",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。该故障码表明电子控制单元（ECU）不能够纠正曲轴脉冲轮轮齿间隙的机械性故障。该故障码出现的同时，失火监控器会被禁用。故障原因包括曲轴位置（CKP）传感器，曲轴脉冲轮掉牙，曲轴脉冲轮松动等。"
    }
  ],
  "P047F": [
    {
      "scope": "所有汽车制造商",
      "code": "P047F",
      "zh-cn": "排气压力控制阀门A卡在开的位置",
      "en-us": "Exhaust Pressure Control Valve A Stuck Open",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。该故障码表明排气压力控制阀门A卡在开的位置。"
    }
  ],
  "P014F": [
    {
      "scope": "所有汽车制造商",
      "code": "P014F",
      "zh-cn": "氧传感器反应太慢 - （空燃比）稀到浓（第2排，传感器 1）",
      "en-us": "O2 Sensor Slow Response - Lean to Rich (Bank 2, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。如果电子控制单元（ECU）发现在空燃比由稀变浓的过程中，没有监测到可以接受的电压变化速率的话，该故障码就会出现。"
    }
  ],
  "P02E8": [
    {
      "scope": "所有汽车制造商",
      "code": "P02E8",
      "zh-cn": "柴油机进气流量位置传感器电路低",
      "en-us": "Diesel Intake Air Flow Position Sensor Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "柴油机进气流量控制系统通过对节气门开启角度的自动控制并与切向气道或螺旋气道的配合使用来形成有效的进气涡流，同时对进气涡流的强度进行自动控制，有效地改善了发动机的燃烧，从而优化了发动机动力性，经济性等性能指标。P02E8的故障原因包括进气翻门控制执行器位置传感器，其电路，接头，或控制模块（ECM）。"
    }
  ],
  "P0649": [
    {
      "scope": "所有汽车制造商",
      "code": "P0649",
      "zh-cn": "速度控制灯控制电路",
      "en-us": "Speed Control Lamp Control Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": ""
    }
  ],
  "P0820": [
    {
      "scope": "所有汽车制造商",
      "code": "P0820",
      "zh-cn": "换档杆X-Y位置传感器电路",
      "en-us": "Gear Lever X-Y Position Sensor Circuit",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0137": [
    {
      "scope": "所有汽车制造商",
      "code": "P0137",
      "zh-cn": "氧传感器电路低电压（第1排,传感器 2）",
      "en-us": "O2 Sensor Circuit Low Voltage (Bank 1, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。当加热氧传感器信号的电压在设定的时间段内持续低于156毫伏时，该故障码就会出现。故障原因包括氧传感器由于燃油中含硅而被污染，氧传感器信号和地线电路交叉，氧传感器信号电路短路到接地，氧传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0AE5": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AE5",
      "zh-cn": "混合动力电池预充电接触器控制电路范围/性能",
      "en-us": "Hybrid Battery Precharge Contactor Control Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果混合动力汽车电子控制单元如果发现第1系统主继电器（SMR1）发生故障，该故障码会出现。"
    }
  ],
  "P0711": [
    {
      "scope": "所有汽车制造商",
      "code": "P0711",
      "zh-cn": "变速器液温传感器A电路范围/性能",
      "en-us": "Transmission Fluid Temperature Sensor A Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "变速器液温度（TFT）传感器依据热敏电阻的原理将变速器液温度以电信号的形式传送到电子控制单元（ECU）。其主要作用是当温度过高时，变速器控制模块（TCU）会降挡减速。对于有些新型汽车，TCU运用此温度信号判断变速器液粘度，从而调整管路压力和电磁阀压力。如果发动机运转10分钟以上，电子控制单元（ECU）未检测到变速器液温度（TFT）传感器信号的任何变化，该故障码会出现。故障原因包括变速器液液位太低或变质太脏，变速器液温度（TFT）传感器或其电路接头故障，变速器液温度（TFT）传感器校准错误，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P003F": [
    {
      "scope": "所有汽车制造商",
      "code": "P003F",
      "zh-cn": "A凸轮轴形面控制卡在开启位置 （第2排）",
      "en-us": "A Camshaft Profile Control Stuck On (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。该故障码表明A（进气/左/前）凸轮轴形面控制发生故障或卡在打开位置 。"
    }
  ],
  "P0A19": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A19",
      "zh-cn": "电动机转矩传感器电路低",
      "en-us": "Motor Torque Sensor Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "控制模块检测到电机转矩传感器信号超出校准的正常范围。"
    }
  ],
  "P084A": [
    {
      "scope": "所有汽车制造商",
      "code": "P084A",
      "zh-cn": "变速器液压力（TFP）传感器/开关H电路",
      "en-us": "Transmission Fluid Pressure Sensor/Switch H Circuit",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P067E": [
    {
      "scope": "所有汽车制造商",
      "code": "P067E",
      "zh-cn": "气缸6电热塞控制电路低",
      "en-us": "Cylinder 6 Glow Plug Control Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸6电热塞电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P037F": [
    {
      "scope": "所有汽车制造商",
      "code": "P037F",
      "zh-cn": "电热塞监控电路高",
      "en-us": "Glow Plug Sense Circuit High",
      "sys": "点火系统",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到电热赛监控电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0A17": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A17",
      "zh-cn": "电动机转矩传感器电路",
      "en-us": "Motor Torque Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "控制模块检测到电机转矩传感器信号超出校准的正常范围。"
    }
  ],
  "P00B7": [
    {
      "scope": "所有汽车制造商",
      "code": "P00B7",
      "zh-cn": "发动机冷却液流动慢/性能问题",
      "en-us": "Engine Coolant Flow Low/Performance",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "故障原因包括冷却液泵，水箱散热器，节温器，冷却液太脏等。"
    }
  ],
  "P06AC": [
    {
      "scope": "所有汽车制造商",
      "code": "P06AC",
      "zh-cn": "动力总成控制模块（PCM）/发动机控制模块（ECM）/变速器控制模块（TCU）内部温度传感器B范围/性能",
      "en-us": "PCM/ECM/TCU Internal Temperature Sensor B Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。该故障码表明控制模块内部温度传感器信号电路电压超出了校准的最大范围。故障原因内部温度传感器，电路，接头，或控制模块。"
    }
  ],
  "P02E7": [
    {
      "scope": "所有汽车制造商",
      "code": "P02E7",
      "zh-cn": "柴油机进气流量位置传感器电路范围/性能",
      "en-us": "Diesel Intake Air Flow Position Sensor Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "柴油机进气流量控制系统通过对节气门开启角度的自动控制并与切向气道或螺旋气道的配合使用来形成有效的进气涡流，同时对进气涡流的强度进行自动控制，有效地改善了发动机的燃烧，从而优化了发动机动力性，经济性等性能指标。P02E7的故障原因包括进气翻门控制执行器位置传感器，其电路，接头，或控制模块（ECM）。"
    }
  ],
  "P0304": [
    {
      "scope": "所有汽车制造商",
      "code": "P0304",
      "zh-cn": "第4缸检测到失火",
      "en-us": "Cylinder 4 Misfire Detected",
      "sys": "点火系统",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。如果电子控制单元（ECU）检测到可能会对催化转换器造成破坏的失火，故障指示灯会闪烁，此时应立即关闭发动机。该故障码表明电子控制单元（ECU）检测到气缸4失火。故障原因包括点火系统故障，燃油输送故障，进气歧管或EGR，PCV的空气泄漏，机械性气缸故障等。"
    }
  ],
  "P0131": [
    {
      "scope": "所有汽车制造商",
      "code": "P0131",
      "zh-cn": "氧传感器电路低电压（第1排,传感器 1）",
      "en-us": "O2 Sensor Circuit Low Voltage (Bank 1, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。当加热氧传感器信号的电压在设定的时间段内持续低于156毫伏时，该故障码就会出现。故障原因包括氧传感器由于燃油中含硅而被污染，氧传感器信号和地线电路交叉，氧传感器信号电路短路到接地，氧传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0140": [
    {
      "scope": "所有汽车制造商",
      "code": "P0140",
      "zh-cn": "氧传感器电路无作用（第1排，传感器 2）",
      "en-us": "O2 Sensor Circuit No Activity Detected (Bank 1, Sensor 2)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）持续监控加热氧传感器已确定氧传感器在工作。如果加热氧传感器信号值持续停留在默认值，ECU就会命令振荡的空气/燃油比以试图监测到信号值的一些变化。如果这时候ECU依然无法检测传感器的信号的变化，该故障码就会出现。故障原因包括排气歧管或排气管漏气，氧传感器本身或其电路或接头故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P07A9": [
    {
      "scope": "所有汽车制造商",
      "code": "P07A9",
      "zh-cn": "变速器摩擦衬片D卡在开的位置",
      "en-us": "Transmission Friction Element D Stuck On",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0B10": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B10",
      "zh-cn": "混合动力电池组电流传感器B电路低",
      "en-us": "Hybrid Battery Pack Current Sensor B Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块通过来自电池电流传感器的信号来监控电池的充电放电情况。如果控制模块发现电池电流传感器发生故障，该故障码会出现。"
    }
  ],
  "P04A4": [
    {
      "scope": "所有汽车制造商",
      "code": "P04A4",
      "zh-cn": "排气压力控制阀门B卡在开的位置",
      "en-us": "Exhaust Pressure Control Valve B Stuck Open",
      "sys": "排放控制",
      "knowledge": "排气压力控制阀是一个可变位置阀门，它主要作用是当外界温度极低（<5摄氏度）的时候，通过改变排气压力（增压发动机负荷）以帮助发动机迅速升温。该故障码表明排气压力控制阀门B卡在开的位置。"
    }
  ],
  "P075F": [
    {
      "scope": "所有汽车制造商",
      "code": "P075F",
      "zh-cn": "变速器液液面太高",
      "en-us": "Transmission Fluid Level Too High",
      "sys": "变速箱",
      "knowledge": "故障原因包括变速器液液位太高，变速器液液位传感器或其电路故障等。"
    }
  ],
  "P041C": [
    {
      "scope": "所有汽车制造商",
      "code": "P041C",
      "zh-cn": "废气再循环阀温度传感器B电路低",
      "en-us": "Exhaust Gas Recirculation Temperature Sensor B Circuit Low",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环阀（EGR）温度传感器的信号电压在指设定时间段内（5秒）低于校准的最低值（0.15伏），该故障码会出现。"
    }
  ],
  "P0ADE": [
    {
      "scope": "所有汽车制造商",
      "code": "P0ADE",
      "zh-cn": "混合动力电池负极接触器控制电路范围/性能",
      "en-us": "Hybrid Battery Negative Contactor Control Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果混合动力电子控制单元发现第3系统主继电器（SMR）发生故障，该故障码会出现。"
    }
  ],
  "P0A89": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A89",
      "zh-cn": "14伏电源模块电流传感器电路高",
      "en-us": "14 Volt Power Module Current Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0B47": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B47",
      "zh-cn": "混合动力电池电压监控C电路低",
      "en-us": "Hybrid Battery Voltage Sense C Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0768": [
    {
      "scope": "所有汽车制造商",
      "code": "P0768",
      "zh-cn": "换档电磁阀D电子问题",
      "en-us": "Shift Solenoid D Electrical",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P044F": [
    {
      "scope": "所有汽车制造商",
      "code": "P044F",
      "zh-cn": "二次空气喷射系统切换阀门A电路高",
      "en-us": "Secondary Air Injection System Switching Valve A Circuit High",
      "sys": "排放控制",
      "knowledge": "在发动机刚刚启动时，二次空气喷射系统通过往排气歧管强制输入空气来氧化产生的碳氢化合物，一氧化碳等有害气体。这个过程也同时加速了催化转换器的暖化过程。如果电子控制单元（ECU）检测到二次空气喷射系统切换阀门A控制电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0A6B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A6B",
      "zh-cn": "驱动电机B，V相电流高",
      "en-us": "Drive Motor B Phase V Current High",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0806": [
    {
      "scope": "所有汽车制造商",
      "code": "P0806",
      "zh-cn": "离合器位置传感器电路范围/性能",
      "en-us": "Clutch Position Sensor Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "离合器位置传感器的作用是将离合器是否踩下的信息以电信号的形式输送给电子控制单元，作为控制发动机启动和定速巡航系统的重要参数。"
    }
  ],
  "P0B2E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B2E",
      "zh-cn": "混合动力电池C电压高",
      "en-us": "Hybrid Battery C Voltage High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0072": [
    {
      "scope": "所有汽车制造商",
      "code": "P0072",
      "zh-cn": "周围空气温度传感器电路低",
      "en-us": "Ambient Air Temperature Sensor Circuit Low",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "周围空气温度传感器的作用是将外部空气温度以电信号的形式传输给电子控制单元（ECU），以帮助发动机实现最佳空燃比。该故障码表明周围空气温度传感器信号电压低于校准的最低值。"
    }
  ],
  "P000E": [
    {
      "scope": "所有汽车制造商",
      "code": "P000E",
      "zh-cn": "燃油量调节器控制超过学习限制",
      "en-us": "Fuel Volume Regulator Control Exceeded Learning Limit",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "电子控制单元（ECU）检测到燃油量调节阀的适应性学习已经达到了最高或最低极限。"
    }
  ],
  "P0A82": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A82",
      "zh-cn": "混合动力电池组冷却风扇1性能或卡在关闭位置",
      "en-us": "Hybrid Battery Pack Cooling Fan 1 Performance/Stuck Off",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块根据来自电池温度传感器的信号来控制电池风扇的开启或关闭。如果实际电池组温度比基于冷却风扇性能估计的电池组温度高出一设定值，控制模块认为电池组风扇故障或卡在关的位置。"
    }
  ],
  "P0AE8": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AE8",
      "zh-cn": "混合动力电池温度传感器D电路",
      "en-us": "Hybrid Battery Temperature Sensor D Circuit",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压超出正常范围，该故障码会出现。"
    }
  ],
  "P065C": [
    {
      "scope": "所有汽车制造商",
      "code": "P065C",
      "zh-cn": "发电机机械性故障/性能问题",
      "en-us": "Generator Mechanical Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": ""
    }
  ],
  "P0271": [
    {
      "scope": "所有汽车制造商",
      "code": "P0271",
      "zh-cn": "第4缸喷油器电路高",
      "en-us": "Cylinder 4 Injector Circuit High",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第4缸喷油器控制电路电压高于校准的最高值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0405": [
    {
      "scope": "所有汽车制造商",
      "code": "P0405",
      "zh-cn": "废气再循环阀传感器A电路低",
      "en-us": "Exhaust Gas Recirculation Sensor A Circuit Low",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环（EGR）传感器的信号电压低于校准的最低值（0.2v），该故障码会出现。故障原因包括DPFE传感器接头故障，电路短路到接地，传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0949": [
    {
      "scope": "所有汽车制造商",
      "code": "P0949",
      "zh-cn": "自动换档手动（ASM）变速器自适应学习没有完成",
      "en-us": "Auto Shift Manual Adaptive Learning Not Complete",
      "sys": "变速箱",
      "knowledge": "自动换档手动变速器允许司机将变速器打入手动模式，手动控制升档或降档。"
    }
  ],
  "P0424": [
    {
      "scope": "所有汽车制造商",
      "code": "P0424",
      "zh-cn": "热催化转换器温度低于阈值（第1排）",
      "en-us": "Heated Catalyst Temperature Below Threshold (Bank 1)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明预热以后催化转换器温度低于设定的最低极限。故障原因包括催化转换器，氧传感器，以及电路，接头等。"
    }
  ],
  "P0AB8": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AB8",
      "zh-cn": "发动机悬架B控制电路高",
      "en-us": "Engine Mount B Control Circuit High",
      "sys": "混合动力系统",
      "knowledge": "汽车电控悬架可以根据行驶的需要对悬架硬度、阻尼、和车身高度进行调节，提高车辆的形式平稳性和操控性。"
    }
  ],
  "P078D": [
    {
      "scope": "所有汽车制造商",
      "code": "P078D",
      "zh-cn": "换档正时电磁阀B高",
      "en-us": "Shift Timing Solenoid B High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P07A5": [
    {
      "scope": "所有汽车制造商",
      "code": "P07A5",
      "zh-cn": "变速器摩擦衬片B卡在开的位置",
      "en-us": "Transmission Friction Element B Stuck On",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0A40": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A40",
      "zh-cn": "驱动电机A位置传感器电路范围/性能",
      "en-us": "Drive Motor A Position Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括驱动电机A位置传感器电路，接头，或传感器本身；混合动力驱动电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P0982": [
    {
      "scope": "所有汽车制造商",
      "code": "P0982",
      "zh-cn": "换档电磁阀D控制电路低",
      "en-us": "Shift Solenoid D Control Circuit Low",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0694": [
    {
      "scope": "所有汽车制造商",
      "code": "P0694",
      "zh-cn": "风扇2控制电路高",
      "en-us": "Fan 2 Control Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到风扇2（高速）控制变量（FCV）电路电压高于校准的最高值。故障原因包括风扇本身或其控制电路，接头等。"
    }
  ],
  "P0449": [
    {
      "scope": "所有汽车制造商",
      "code": "P0449",
      "zh-cn": "蒸发排放系统通风阀/电磁阀电路",
      "en-us": "Evaporative Emission System Vent Valve/Solenoid Circuit",
      "sys": "排放控制",
      "knowledge": "蒸发排放（EVAP）系统将油箱中的汽油蒸气导入装有可以吸收汽油蒸气的活性炭的储罐里。发动机然后会利用新鲜空气将这些汽油蒸气吹扫到发动机燃烧室里。该故障码表明蒸发排放系统的通风电磁阀发生故障"
    }
  ],
  "P0270": [
    {
      "scope": "所有汽车制造商",
      "code": "P0270",
      "zh-cn": "第4缸喷油器电路低",
      "en-us": "Cylinder 4 Injector Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第4缸喷油器控制电路电压低于校准的最低值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P021D": [
    {
      "scope": "所有汽车制造商",
      "code": "P021D",
      "zh-cn": "喷油器正时第10缸",
      "en-us": "Cylinder 10 Injection Timing",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果电子控制单元（ECU）检测到喷油器实际正时跟理想喷油正时偏差超过最大极限，该故障码会出现。"
    }
  ],
  "P0557": [
    {
      "scope": "所有汽车制造商",
      "code": "P0557",
      "zh-cn": "刹车助力器压力传感器电路低",
      "en-us": "Brake Booster Pressure Sensor Circuit Low",
      "sys": "车速及怠速控制",
      "knowledge": "刹车助力器应用发动机进气系统（或者是专门的真空泵）产生的真空来协助制动。刹车助力器压力传感器的作用是检测助力器里的真空压力。如果电子控制单元（ECU）检测到刹车助力器压力传感器电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P06C6": [
    {
      "scope": "所有汽车制造商",
      "code": "P06C6",
      "zh-cn": "气缸2电热塞不正确",
      "en-us": "Cylinder 2 Glow Plug Incorrect",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。该故障码表明气缸2电热塞，其电路，接头，或电热赛控制模块（GPCM）出错。"
    }
  ],
  "P0386": [
    {
      "scope": "所有汽车制造商",
      "code": "P0386",
      "zh-cn": "曲轴位置（CKP）传感器B电路范围/性能 （第1排）",
      "en-us": "Crankshaft Position Sensor B Circuit Range/Performance",
      "sys": "点火系统",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。曲轴位置（CKP）传感器(也叫上止点传感器），其作用是检测上止点（TDC）信号、曲轴转角信号和发动机转速信号，并将其输入计算机，从而使计算机能按气缸的点火顺序发出最佳点火时刻指令。如果电子控制单元（ECU）检测到曲轴传感器B电路电压出错，该故障码会出现。"
    }
  ],
  "P0AA0": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AA0",
      "zh-cn": "混合动力电池正极接触器电路",
      "en-us": "Hybrid Battery Positive Contactor Circuit",
      "sys": "混合动力系统",
      "knowledge": "系统主继电器（SMR）负责打开和关闭高压电源供应。如果第1和第2系统主继电器（SMR）中的一个卡住，有可能会导致高压系统不能关闭。所以，混合动力汽车电子控制单元如果一旦发现其中的任何一个继电器发生故障，便会终止整个系统。"
    }
  ],
  "P0B58": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B58",
      "zh-cn": "混合动力电池电压监控F电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense F Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P02C8": [
    {
      "scope": "所有汽车制造商",
      "code": "P02C8",
      "zh-cn": "喷油器受限制 - 气缸12",
      "en-us": "Cylinder 12 - Injector Restricted",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第12缸喷油器性能出错。"
    }
  ],
  "P0B7F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B7F",
      "zh-cn": "混合动力电池电压监控N电路高",
      "en-us": "Hybrid Battery Voltage Sense N Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0154": [
    {
      "scope": "所有汽车制造商",
      "code": "P0154",
      "zh-cn": "氧传感器电路无作用（第2排，传感器 1）",
      "en-us": "O2 Sensor Circuit No Activity Detected (Bank 2, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）持续监控加热氧传感器已确定氧传感器在工作。如果加热氧传感器信号值持续停留在默认值，电子控制单元（ECU）就会命令振荡的空气/燃油比以试图监测到信号值的一些变化。如果这时候ECU依然无法检测传感器的信号的变化，该故障码就会出现。故障原因包括排气歧管或排气管泄漏，氧传感器本身或其电路或接头故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0644": [
    {
      "scope": "所有汽车制造商",
      "code": "P0644",
      "zh-cn": "仪表盘显示串行通讯链接电路",
      "en-us": "Driver Display Serial Communication Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "故障原因包括控制器局域网（CAN）数据连线，电路，接头，或电子控制单元（ECU）。"
    }
  ],
  "P0ABB": [
    {
      "scope": "所有汽车制造商",
      "code": "P0ABB",
      "zh-cn": "混合动力电池组电压监控A电路范围/性能",
      "en-us": "Hybrid Battery Pack Voltage Sense A Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0A7D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A7D",
      "zh-cn": "混合动力电池组充电状态低",
      "en-us": "Hybrid Battery Pack State of Charge Low",
      "sys": "混合动力系统",
      "knowledge": "控制模块检测到混合动力电池组处于低充电状态。"
    }
  ],
  "P015B": [
    {
      "scope": "所有汽车制造商",
      "code": "P015B",
      "zh-cn": "氧传感器延迟响应 - （空燃比）稀到浓 （第1排，传感器 1）",
      "en-us": "O2 Sensor Delayed Response - Lean to Rich (Bank 1, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。加热氧传感器监控器会跟踪氧传感器信号上升和下降过程中的电压变化速率。如果电子控制单元（ECU）发现在空燃比由稀变浓的过程中，电压变化速率滞后，该故障码就会出现。"
    }
  ],
  "P0A59": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A59",
      "zh-cn": "发电机电流传感器电路",
      "en-us": "Generator Current Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0546": [
    {
      "scope": "所有汽车制造商",
      "code": "P0546",
      "zh-cn": "排气温度传感器电路高（第1排，传感器1）",
      "en-us": "Exhaust Gas Temperature Sensor Circuit High (Bank 1, Sensor 1)",
      "sys": "车速及怠速控制",
      "knowledge": "排气温度传感器的作用是将排气温度以电信号的形式输送给电子控制单元（ECU）。正确的空燃比产生的排气温度比过浓或过稀空燃比产生的排气温度要低。过高排气温度（>160摄氏度）会对发动机造成破坏。如果电子控制单元（ECU）检测到排气温度传感器信号电压在设定的时间段（15秒）内高于4.75伏（也可能是2.5伏），该故障码会出现。"
    }
  ],
  "P0B41": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B41",
      "zh-cn": "混合动力电池电压监控B电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense B Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0C03": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C03",
      "zh-cn": "驱动电机B电流低",
      "en-us": "Drive Motor B Current Low",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0873": [
    {
      "scope": "所有汽车制造商",
      "code": "P0873",
      "zh-cn": "变速器液压力（TFP）传感器/开关C电路高",
      "en-us": "Transmission Fluid Pressure Sensor/Switch C Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0B89": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B89",
      "zh-cn": "混合动力电池电压监控P电路高",
      "en-us": "Hybrid Battery Voltage Sense P Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0323": [
    {
      "scope": "所有汽车制造商",
      "code": "P0323",
      "zh-cn": "点火/分电器发动机转速输入电路间歇",
      "en-us": "Ignition/Distributor Engine Speed Input Circuit Intermittent",
      "sys": "点火系统",
      "knowledge": "故障原因包括点火线圈，分电器，点火控制模块，发动机转速传感器，曲轴位置（CKP）传感器，及电路，接头等。"
    }
  ],
  "P0680": [
    {
      "scope": "所有汽车制造商",
      "code": "P0680",
      "zh-cn": "电热塞电路/开路 - 气缸10",
      "en-us": "Cylinder 10 Glow Plug Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸10电热塞电路发生故障，该故障码会出现。"
    }
  ],
  "P0A94": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A94",
      "zh-cn": "直流/直流转换器性能",
      "en-us": "DC/DC Converter Performance",
      "sys": "混合动力系统",
      "knowledge": "直流/直流转换器将HV电池的直流高压（200-400伏特）转化成12伏特电压，从而可以给辅助电池充电并给车内附件供电。"
    }
  ],
  "P0BC6": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BC6",
      "zh-cn": "混合动力电池温度传感器E电路间歇/不稳定",
      "en-us": "Hybrid Battery Temperature Sensor E Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压突然变化，该故障码会出现。"
    }
  ],
  "P0555": [
    {
      "scope": "所有汽车制造商",
      "code": "P0555",
      "zh-cn": "刹车助力器压力传感器电路",
      "en-us": "Brake Booster Pressure Sensor Circuit",
      "sys": "车速及怠速控制",
      "knowledge": "刹车助力器应用发动机进气系统（或者是专门的真空泵）产生的真空来协助制动。刹车助力器压力传感器的作用是检测助力器里的真空压力。该故障码表明刹车助力器压力传感器电路故障。"
    }
  ],
  "P0946": [
    {
      "scope": "所有汽车制造商",
      "code": "P0946",
      "zh-cn": "液压泵继电器电路范围/性能",
      "en-us": "Hydraulic Pump Relay Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0922": [
    {
      "scope": "所有汽车制造商",
      "code": "P0922",
      "zh-cn": "换档前推执行器 （前推换档杆，奇数齿轮，1,3,5）电路低",
      "en-us": "Gear Shift Forward Actuator Circuit Low",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P052B": [
    {
      "scope": "所有汽车制造商",
      "code": "P052B",
      "zh-cn": "冷车启动A凸轮轴位置正时过于滞后 （第1排）",
      "en-us": "Cold Start A Camshaft Position Timing Over-Retarded (Bank 1)",
      "sys": "车速及怠速控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。冷车启动时，如果电子控制单元（ECU）检测到A（进气/左/前）凸轮轴正时超过最大设定值，或者一直处于滞后状态，则该故障码会出现。"
    }
  ],
  "P0C80": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C80",
      "zh-cn": "混合动力电池温度传感器G电路间歇/不稳定",
      "en-us": "Hybrid Battery Temperature Sensor G Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压突然变化，该故障码会出现。"
    }
  ],
  "P0317": [
    {
      "scope": "所有汽车制造商",
      "code": "P0317",
      "zh-cn": "恶劣路况硬件不存在",
      "en-us": "Rough Road Hardware Not Present",
      "sys": "点火系统",
      "knowledge": "电子控制模块通过监控曲轴旋转速度的变化来检测气缸失火。但恶劣路况导致的轮速变化也可能导致曲轴转速的变化，从而影响气缸失火的探测。防抱死刹车（ABS）和牵引力控制（TCS）系统可以通过轮速传感器的信号判断车辆是否在恶劣路况行驶。如果系统检测到严重的影响到失火探测的恶劣路况，便会通知电子控制模块关闭失火检测,以防止记录错误的故障信息。"
    }
  ],
  "P0C27": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C27",
      "zh-cn": "辅助变速器液泵电机电流低",
      "en-us": "Auxiliary Transmission Fluid Pump Motor Current Low",
      "sys": "混合动力系统",
      "knowledge": "变速器液泵的作用是当发动机工作时给变速器液提供工作压力。换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。而辅助变速器液泵的作用是当发动机不工作时（比如拖车时）为变速器液提供压力，以防止变速器过热。"
    }
  ],
  "P0630": [
    {
      "scope": "所有汽车制造商",
      "code": "P0630",
      "zh-cn": "车辆识别码（VIN）未编程或不匹配 - 发动机控制模块（ECM）/动力总成控制模块（PCM）",
      "en-us": "VIN Not Programmed or Incompatible - ECM/PCM",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P0A35": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A35",
      "zh-cn": "驱动电机B温度过高",
      "en-us": "Drive Motor B Over Temperature",
      "sys": "混合动力系统",
      "knowledge": "驱动电机B处于温度过高状态。电子控制单元有可能会限制电机负载以避免对驱动电机造成损害。"
    }
  ],
  "P0628": [
    {
      "scope": "所有汽车制造商",
      "code": "P0628",
      "zh-cn": "燃油泵A控制电路低",
      "en-us": "Fuel Pump A Control Circuit Low",
      "sys": "计算机或辅助输出电路",
      "knowledge": "燃油泵的作用是把燃油从燃油箱中吸出、加压后输送到供油管中，和燃油压力调节器配合建立一定的燃油压力。如果电子控制单元（ECU）检测到燃油泵控制电路电压低于校准的最低值，该故障码会出现。故障原因包括燃油压力调节器阀故障，燃油压力传感器故障，燃油泵控制模块故障，燃油泵故障等。"
    }
  ],
  "P0583": [
    {
      "scope": "所有汽车制造商",
      "code": "P0583",
      "zh-cn": "定速巡航系统真空控制电路低",
      "en-us": "Cruise Control Vacuum Control Circuit Low",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统通过控制伺服器内的真空来控制节气门角度，从而控制车速。当需要加速时，真空电磁阀开启，与进气歧管（或专门的真空泵）相通，密封套内真空度增大，吸动膜片，克服弹簧力，通过拉线使节气门开度增大，车辆加速行驶。当达到设定车速时，真空电磁阀与通风电磁阀同时关闭，此时密封套内的真空度不变，汽车保持恒速行驶。当需要减速时，通风电磁阀打开，让空气进入密封套，膜片弹簧把膜片压回原位，节气门开度减小，于是汽车减速。P0583表明真空控制电路电压低于校准的最低值。故障原因包括定速巡航真空控制电磁阀，电路，接头等。"
    }
  ],
  "P0BEC": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BEC",
      "zh-cn": "驱动电机A，V相电流传感器电路高",
      "en-us": "Drive Motor A Phase V Current Sensor Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0643": [
    {
      "scope": "所有汽车制造商",
      "code": "P0643",
      "zh-cn": "传感器参考电压A电路高",
      "en-us": "Sensor Reference Voltage A Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到5伏参考电压电路A出错。故障原因包括5伏参考电压电路到某个传感器的电路发生短路或短路，一个或多个传感器发生短路或开路，自动变速器液压传感器故障，电磁阀故障，变速器控制模块故障，变速器输入速度（RPM）传感器故障，变速器输出速度（RPM）传感器故障等。"
    }
  ],
  "P00B1": [
    {
      "scope": "所有汽车制造商",
      "code": "P00B1",
      "zh-cn": "（水箱）散热器冷却液温度传感器电路故障",
      "en-us": "Radiator Coolant Temperature Sensor Circuit",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "（水箱）散热器冷却液温度传感器采用热敏电阻的原理将散热器温度信号以电压的形式传输到电子控制单元（ECU）。如果ECU检测到（水箱）散热器冷却液温度传感器信号电压超出校准的正常范围，该故障码会出现。"
    }
  ],
  "P056B": [
    {
      "scope": "所有汽车制造商",
      "code": "P056B",
      "zh-cn": "（智能）定速巡航系统 - 减小车距 - 信号",
      "en-us": "Cruise Control Decrease Distance Signal",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。新型汽车装备的智能定速系统可以设定与前方汽车的距离。故障原因包括定速巡航车距范围控制模块，电路，接头，以及电子控制单元（ECU）。"
    }
  ],
  "P0A5E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A5E",
      "zh-cn": "驱动电机A，U相电流低",
      "en-us": "Drive Motor A Phase U Current Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0C75": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C75",
      "zh-cn": "混合动力电池系统放电时间太短",
      "en-us": "Hybrid Battery System Discharge Time Too Short",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0A16": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A16",
      "zh-cn": "发动机悬架（支架胶垫）控制电路高",
      "en-us": "Engine Mount A Control Circuit High",
      "sys": "混合动力系统",
      "knowledge": "汽车电控悬架可以根据行驶的需要对悬架硬度、阻尼、和车身高度进行调节，提高车辆的形式平稳性和操控性。如果控制模块检测到悬架系统的控制电路的电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0238": [
    {
      "scope": "所有汽车制造商",
      "code": "P0238",
      "zh-cn": "涡轮/超级增压器增压传感器A电路高",
      "en-us": "Turbocharger/Supercharger Boost Sensor A Circuit High",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。增压传感器，也叫增压压力传感器（BPS），其作用是将增压压力以电信号的形式传输给电子控制单元（ECU）。如果增压传感器信号电压高于5.0伏，该故障码会出现。"
    }
  ],
  "P0C6F": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C6F",
      "zh-cn": "混合动力电池温度传感器B/C相关性",
      "en-us": "Hybrid Battery Temperature Sensor B/C Correlation",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器B/C的信号差超出了校准的最大极限，该故障码会出现。"
    }
  ],
  "P0B5B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B5B",
      "zh-cn": "混合动力电池电压监控G电路低",
      "en-us": "Hybrid Battery Voltage Sense G Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0975": [
    {
      "scope": "所有汽车制造商",
      "code": "P0975",
      "zh-cn": "换档电磁阀B控制电路范围/性能",
      "en-us": "Shift Solenoid B Control Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0621": [
    {
      "scope": "所有汽车制造商",
      "code": "P0621",
      "zh-cn": "发电机指示灯/L-端子电路",
      "en-us": "Generator Lamp/L Terminal Circuit",
      "sys": "计算机或辅助输出电路",
      "knowledge": "故障原因包括发电机指示灯，电路，接头，或电子控制单元（ECU）"
    }
  ],
  "P02B4": [
    {
      "scope": "所有汽车制造商",
      "code": "P02B4",
      "zh-cn": "喷油器受限制 - 气缸7",
      "en-us": "Cylinder 7 - Injector Restricted",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第7缸喷油器性能出错。"
    }
  ],
  "P0C12": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C12",
      "zh-cn": "驱动电机A换流器，V相温度过高",
      "en-us": "Drive Motor A Inverter Phase V Over Temperature",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。"
    }
  ],
  "P0B51": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B51",
      "zh-cn": "混合动力电池电压监控E电路低",
      "en-us": "Hybrid Battery Voltage Sense E Circuit Low",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P069B": [
    {
      "scope": "所有汽车制造商",
      "code": "P069B",
      "zh-cn": "气缸9电热塞控制电路高",
      "en-us": "Cylinder 9 Glow Plug Control Circuit High",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。如果电子控制单元（ECU）检测到气缸9电热塞控制电路电压高于校准的最高值，则该故障码会出现。"
    }
  ],
  "P0840": [
    {
      "scope": "所有汽车制造商",
      "code": "P0840",
      "zh-cn": "变速器液压力（TFP）传感器/开关A电路",
      "en-us": "Transmission Fluid Pressure Sensor/Switch A Circuit",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P00B3": [
    {
      "scope": "所有汽车制造商",
      "code": "P00B3",
      "zh-cn": "（水箱）散热器冷却液温度传感器电路低",
      "en-us": "Radiator Coolant Temperature Sensor Circuit Low",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "（水箱）散热器冷却液温度传感器采用热敏电阻的原理将散热器温度信号以电压的形式传输到电子控制单元（ECU）。如果ECU检测到（水箱）散热器冷却液温度传感器信号电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0C60": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C60",
      "zh-cn": "驱动电机B位置传感器电路B范围/性能",
      "en-us": "Drive Motor B Position Sensor Circuit B Range/Performance",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P054D": [
    {
      "scope": "所有汽车制造商",
      "code": "P054D",
      "zh-cn": "冷车启动B凸轮轴位置正时过度滞后 （第2排）",
      "en-us": "Cold Start B Camshaft Position Timing Over-Retarded (Bank 2)",
      "sys": "车速及怠速控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。冷车启动时，如果电子控制单元（ECU）检测到B（排气/右/后）凸轮轴正时超过最大设定值，或者一直处于滞后状态，则该故障码会出现。"
    }
  ],
  "P0016": [
    {
      "scope": "所有汽车制造商",
      "code": "P0016",
      "zh-cn": "曲轴位置/凸轮轴位置相关性 （第1排,传感器A）",
      "en-us": "Crankshaft Position - Camshaft Position Correlation (Bank 1, Sensor A)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。凸轮轴的作用是控制气门的开启和闭合。电子控制单元（ECU）会持续监控可变凸轮轴的正时位置，检查凸轮轴和曲轴之间的相对位置。如果相对位置错位超出了1个轮齿，则该故障码会出现。故障原因包括凸轮轴位置传感器本身或其电路故障，曲轴位置传感器本身或其电路故障，发动机速度传感器故障，机油被污染，可变凸轮轴电磁阀卡住等。"
    }
  ],
  "P0ABA": [
    {
      "scope": "所有汽车制造商",
      "code": "P0ABA",
      "zh-cn": "混合动力电池组电压监控A电路",
      "en-us": "Hybrid Battery Pack Voltage Sense A Circuit",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0C62": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C62",
      "zh-cn": "驱动电机B位置传感器电路B高",
      "en-us": "Drive Motor B Position Sensor Circuit B High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0777": [
    {
      "scope": "所有汽车制造商",
      "code": "P0777",
      "zh-cn": "压力控制电磁阀B卡在开启位置",
      "en-us": "Pressure Control Solenoid B Stuck On",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。压力控制电磁阀的作用就是控制变速器液的压力。故障原因包括压力控制电磁阀控制电路，接头，或电磁阀本身。控制模块故障也会导致该故障码出现。"
    }
  ],
  "P0180": [
    {
      "scope": "所有汽车制造商",
      "code": "P0180",
      "zh-cn": "燃油温度传感器A电路",
      "en-us": "Fuel Temperature Sensor A Circuit",
      "sys": "燃油或空气",
      "knowledge": "燃油温度传感器负责监控通往燃油泵的燃油温度，以避免因温度过高（120摄氏度）造成蒸气锁现象，而造成对燃油泵或喷油器的破坏。如果电子控制单元（ECU）持续检测燃油温度传感器信号电压在设定时间段里超出了正常值（0.21-4.54v），则该故障码会出现。故障原因包括发动机在外部温度过低的情况下运转，燃油温度传感器电路，接头，或传感器本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0254": [
    {
      "scope": "所有汽车制造商",
      "code": "P0254",
      "zh-cn": "喷油泵燃油计量控制A高（凸轮/转子/喷油器）",
      "en-us": "Injection Pump Fuel Metering Control A High (Cam/Rotor/Injector)",
      "sys": "燃油或空气",
      "knowledge": "故障原因包括燃油控制执行器（FCA），其电路，喷油泵，或电子控制模块（ECU）等。燃油控制执行器（FCA）一般位于喷油泵的后侧，它是一个电控电磁阀门。ECU通过循环打开和关闭FCA来控制进入喷油泵的燃油量。"
    }
  ],
  "P0531": [
    {
      "scope": "所有汽车制造商",
      "code": "P0531",
      "zh-cn": "空调制冷剂压力传感器A电路范围/性能",
      "en-us": "A/C Refrigerant Pressure Sensor A Circuit Range/Performance",
      "sys": "车速及怠速控制",
      "knowledge": "空调制冷剂压力传感器的作用是将空调制冷剂压力以电信号的形式传送给电子控制单元（ECU），作为控制冷却风扇开关和压缩机继电器的依据。该故障码表明空调制冷剂压力传感器本身或其电路故障，动力总成控制模块（PCM）故障等。"
    }
  ],
  "P053C": [
    {
      "scope": "所有汽车制造商",
      "code": "P053C",
      "zh-cn": "曲轴箱强制通风系统加热器控制电路高",
      "en-us": "Positive Crankcase Ventilation Heater Control Circuit High",
      "sys": "车速及怠速控制",
      "knowledge": "曲轴箱强制通风（PCV）系统的作用是将曲轴箱内的窜气（发动机作功燃烧过程的末端，一些未燃混合气在高压力下从活塞环漏入曲轴箱内，业内将这种泄漏称为窜气）通过发动机工作产生的真空导入进气歧管，然后窜气会随着新鲜的空气一起进入汽缸烧掉，从而降低污染提高发动机效率。如果电子控制单元（PCV）检测到曲轴箱强制通风加热器电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P043D": [
    {
      "scope": "所有汽车制造商",
      "code": "P043D",
      "zh-cn": "催化转换器温度传感器电路高 （第2排，传感器2）",
      "en-us": "Catalyst Temperature Sensor Circuit High (Bank 2, Sensor 2)",
      "sys": "排放控制",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。该故障码表明催化转换器温度传感器电路电压高于校准的最高值。故障原因包括催化转换器温度传感器，电路，接头，或电子控制单元（ECU）故障。"
    }
  ],
  "P0117": [
    {
      "scope": "所有汽车制造商",
      "code": "P0117",
      "zh-cn": "发动机冷却液温度（ECT）传感器1电路低",
      "en-us": "Engine Coolant Temperature Sensor 1 Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。如果ECU检测到发动机冷却液温度（ECT）传感器信号低于自检的最小值（0.2伏或121摄氏度），该故障码会出现。故障原因包括传感器信号电路短路到接地，传感器故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0BD7": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BD7",
      "zh-cn": "驱动电机换流器温度传感器D电路范围/性能",
      "en-us": "Drive Motor Inverter Temperature Sensor D Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0C53": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C53",
      "zh-cn": "驱动电机A位置传感器电路A高",
      "en-us": "Drive Motor A Position Sensor Circuit A High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P060A": [
    {
      "scope": "所有汽车制造商",
      "code": "P060A",
      "zh-cn": "内部控制模块监控处理器性能",
      "en-us": "Internal Control Module Monitoring Processor Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P0301": [
    {
      "scope": "所有汽车制造商",
      "code": "P0301",
      "zh-cn": "第1缸检测到失火",
      "en-us": "Cylinder 1 Misfire Detected",
      "sys": "点火系统",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。如果电子控制单元（ECU）检测到可能会对催化转换器造成破坏的失火，故障指示灯会闪烁，此时应立即关闭发动机。该故障码表明电子控制单元（ECU）检测到气缸1失火。故障原因包括点火系统故障，燃油输送故障，进气歧管或EGR，PCV的空气泄漏，机械性气缸故障等。"
    }
  ],
  "P0A4B": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A4B",
      "zh-cn": "发电机位置传感器电路",
      "en-us": "Generator Position Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "故障原因包括发电机位置传感器电路，接头，或传感器本身；混合动力车辆发电机；混合动力车辆电子控制单元（HV ECU）。"
    }
  ],
  "P0BA5": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BA5",
      "zh-cn": "混合动力电池电压监控V电路范围/性能",
      "en-us": "Hybrid Battery Voltage Sense V Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0091": [
    {
      "scope": "所有汽车制造商",
      "code": "P0091",
      "zh-cn": "燃油压力调节器1控制电路低",
      "en-us": "Fuel Pressure Regulator 1 Control Circuit Low",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。如果电子控制单元（ECU）检测到燃油压力调节器1控制电路电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P079C": [
    {
      "scope": "所有汽车制造商",
      "code": "P079C",
      "zh-cn": "变速器摩擦衬片C检测到打滑",
      "en-us": "Transmission Friction Element C Slip Detected",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P0B5E": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B5E",
      "zh-cn": "混合动力电池电压监控H电路",
      "en-us": "Hybrid Battery Voltage Sense H Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0236": [
    {
      "scope": "所有汽车制造商",
      "code": "P0236",
      "zh-cn": "涡轮/超级增压器增压传感器A电路范围/性能",
      "en-us": "Turbocharger/Supercharger Boost Sensor A Circuit Range/Performance",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。增压传感器，也叫增压压力传感器（BPS），其作用是将增压压力以电信号的形式传输给电子控制单元（ECU）。如果ECU检测到增压传感器（BPS）信号电路出错，该故障码会出现。"
    }
  ],
  "P0C4D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C4D",
      "zh-cn": "混合动力电池组冷却液供电电压电路高",
      "en-us": "Hybrid Battery Pack Coolant Pump Supply Voltage Circuit High",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0BE1": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BE1",
      "zh-cn": "驱动电机换流器温度传感器F电路范围/性能",
      "en-us": "Drive Motor Inverter Temperature Sensor F Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0AF5": [
    {
      "scope": "所有汽车制造商",
      "code": "P0AF5",
      "zh-cn": "驱动电机换流器温度传感器B电路高",
      "en-us": "Drive Motor Inverter Temperature Sensor B Circuit High",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0667": [
    {
      "scope": "所有汽车制造商",
      "code": "P0667",
      "zh-cn": "动力总成控制模块（PCM）/发动机控制模块（ECM）/变速器控制模块（TCU）内部温度传感器A范围/性能",
      "en-us": "PCM/ECM/TCU Internal Temperature Sensor A Range/Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。该故障码表明控制模块内部温度传感器信号电路电压出错。故障原因内部温度传感器，电路，接头，或控制模块。"
    }
  ],
  "P010F": [
    {
      "scope": "所有汽车制造商",
      "code": "P010F",
      "zh-cn": "空气流量（MAF）传感器A/B的相关性",
      "en-us": "Mass or Volume Air Flow Sensor A/B Correlation",
      "sys": "燃油或空气",
      "knowledge": "空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。如果ECU检测空气流量（MAF）传感器A跟B的信号差超过了设定的最高值，该故障码会出现。"
    }
  ],
  "P0980": [
    {
      "scope": "所有汽车制造商",
      "code": "P0980",
      "zh-cn": "换档电磁阀C控制电路高",
      "en-us": "Shift Solenoid C Control Circuit High",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P0345": [
    {
      "scope": "所有汽车制造商",
      "code": "P0345",
      "zh-cn": "凸轮轴位置（CMP）传感器A电路故障 （第2排）",
      "en-us": "Camshaft Position Sensor A Circuit (Bank 2)",
      "sys": "点火系统",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。如果电子控制单元（ECU）在设定的时间段内发现未能检测到A（进气/左/前）凸轮轴位置（CMP）传感器信号时，该故障码会出现。故障原因包括凸轮轴位置（CMP）传感器电路，接头，其本身故障，或电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0BE0": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BE0",
      "zh-cn": "驱动电机换流器温度传感器F电路",
      "en-us": "Drive Motor Inverter Temperature Sensor F Circuit",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0C85": [
    {
      "scope": "所有汽车制造商",
      "code": "P0C85",
      "zh-cn": "混合动力电池温度传感器H电路间歇/不稳定",
      "en-us": "Hybrid Battery Temperature Sensor H Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块依据来自电池温度传感器的信号来控制打开/关闭电池风扇。如果电池控制模块检测到电池温度传感器信号电路电压突然变化，该故障码会出现。"
    }
  ],
  "P0A86": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A86",
      "zh-cn": "14伏电源模块电流传感器电路",
      "en-us": "14 Volt Power Module Current Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P071D": [
    {
      "scope": "所有汽车制造商",
      "code": "P071D",
      "zh-cn": "变速器模式开关B电路故障",
      "en-us": "Transmission Mode Switch B Circuit",
      "sys": "变速箱",
      "knowledge": "变速器模式开关的作用是根据用户选择的模式（运动/经济/冬季等）来指令变速器提前或延后换档，或高挡起步等。故障原因包括变速器模式开关，电路，接头，或控制模块。"
    }
  ],
  "P049E": [
    {
      "scope": "所有汽车制造商",
      "code": "P049E",
      "zh-cn": "废气再循环B控制位置超过学习极限",
      "en-us": "Exhaust Gas Recirculation B Control Position Exceeded Learning Limit",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。"
    }
  ],
  "P0288": [
    {
      "scope": "所有汽车制造商",
      "code": "P0288",
      "zh-cn": "第10缸喷油器电路低",
      "en-us": "Cylinder 10 Injector Circuit Low",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。如果第10缸喷油器控制电路电压低于校准的最低值，该故障码会出现。故障原因包括喷油器控制电路，接头，或喷油器本身；喷油器控制模块（FICM）。"
    }
  ],
  "P0909": [
    {
      "scope": "所有汽车制造商",
      "code": "P0909",
      "zh-cn": "门选择控制错误",
      "en-us": "Gate Select Control Error",
      "sys": "变速箱",
      "knowledge": "门选择（监控换档杆左/右位置）控制故障。"
    }
  ],
  "P0A52": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A52",
      "zh-cn": "驱动电机A电流传感器电路范围/性能",
      "en-us": "Drive Motor A Current Sensor Circuit Range/Performance",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）内部故障。"
    }
  ],
  "P049B": [
    {
      "scope": "所有汽车制造商",
      "code": "P049B",
      "zh-cn": "废气再循环B流量太低",
      "en-us": "Exhaust Gas Recirculation B Flow Insufficient Detected",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。该故障码表明废气再循环B的流量低于正常范围。"
    }
  ],
  "P0119": [
    {
      "scope": "所有汽车制造商",
      "code": "P0119",
      "zh-cn": "发动机冷却液温度（ECT）传感器1电路间歇",
      "en-us": "Engine Coolant Temperature Sensor 1 Circuit Intermittent",
      "sys": "燃油或空气",
      "knowledge": "发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。如果ECU检测到发动机在运行时，冷却液温度传感器（对于没有装备冷却液温度传感器的汽车，这里指缸盖温度传感器）电路间歇性开路或短路，该故障码会出现。"
    }
  ],
  "P0A8C": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A8C",
      "zh-cn": "14伏电源模块系统电压不稳定",
      "en-us": "14 Volt Power Module System Voltage Unstable",
      "sys": "混合动力系统",
      "knowledge": ""
    }
  ],
  "P0936": [
    {
      "scope": "所有汽车制造商",
      "code": "P0936",
      "zh-cn": "液压传感器电路间歇",
      "en-us": "Hydraulic Pressure Sensor Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": ""
    }
  ],
  "P001E": [
    {
      "scope": "所有汽车制造商",
      "code": "P001E",
      "zh-cn": "A 凸轮轴形面控制电路低 （第2排）",
      "en-us": "A Camshaft Profile Control Circuit Low (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。从而优化发动机在所有转速范围内的效率和功率。如果电子控制单元（ECU）检测到A（进气/左/前）凸轮轴形面控制电路电压在一段时间内低于了校准的最低值，则该故障码会出现。"
    }
  ],
  "P0362": [
    {
      "scope": "所有汽车制造商",
      "code": "P0362",
      "zh-cn": "点火线圈L主/次电路",
      "en-us": "Ignition Coil L Primary/Secondary Circuit",
      "sys": "点火系统",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。电子控制单元（ECU）持续监测每个点火主电路。如果ECU没有收到有效的来自点火模块（集成在ECU）的点火诊断监控器（IDM）脉冲信号，该故障码会出现。故障原因包括点火启动/运行电路，点火线圈电路，点火线圈本身故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P076A": [
    {
      "scope": "所有汽车制造商",
      "code": "P076A",
      "zh-cn": "换档电磁阀H",
      "en-us": "Shift Solenoid H",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。该故障码的故障原因包括变速器液液面太低，变速器液太脏，换档电磁阀机械故障，电路，接头，或变速器控制模块（TCM）故障等。"
    }
  ],
  "P02B1": [
    {
      "scope": "所有汽车制造商",
      "code": "P02B1",
      "zh-cn": "喷油器泄漏 - 气缸6",
      "en-us": "Cylinder 6 - Injector Leaking",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第6缸喷油器发生泄漏。"
    }
  ],
  "P040A": [
    {
      "scope": "所有汽车制造商",
      "code": "P040A",
      "zh-cn": "废气再循环阀温度传感器A电路",
      "en-us": "Exhaust Gas Recirculation Temperature Sensor A Circuit",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环阀（EGR）温度传感器的信号电压超出了校准的正常范围，该故障码会出现。"
    }
  ],
  "P07BC": [
    {
      "scope": "所有汽车制造商",
      "code": "P07BC",
      "zh-cn": "变速器驻车档位置传感器/开关B电路性能/高",
      "en-us": "Transmission Park Position Sensor/Switch B Circuit Performance High",
      "sys": "变速箱",
      "knowledge": "驻车档位置传感器的作用是将变速杆是否在驻车档的位置的信号输送给电子控制单元（ECU）。如果ECU检测到驻车档位置传感器电路出错，该故障码会出现。"
    }
  ],
  "P0BED": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BED",
      "zh-cn": "驱动电机A，W相电流传感器电路",
      "en-us": "Drive Motor A Phase W Current Sensor Circuit",
      "sys": "混合动力系统",
      "knowledge": "混合动力车辆电子控制单元（HV ECU）负责监控驱动电机换流器电流传感器。如果HV ECU检测到错误，该故障码会出现。"
    }
  ],
  "P0BA7": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BA7",
      "zh-cn": "混合动力电池电压监控V电路高",
      "en-us": "Hybrid Battery Voltage Sense V Circuit High",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0489": [
    {
      "scope": "所有汽车制造商",
      "code": "P0489",
      "zh-cn": "废气再循环A控制电路低",
      "en-us": "Exhaust Gas Recirculation A Control Circuit Low",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环传感器A信号电压低于校准的最低值，该故障码会出现。"
    }
  ],
  "P0B44": [
    {
      "scope": "所有汽车制造商",
      "code": "P0B44",
      "zh-cn": "混合动力电池电压监控B电路间歇/不稳定",
      "en-us": "Hybrid Battery Voltage Sense B Circuit Intermittent/Erratic",
      "sys": "混合动力系统",
      "knowledge": "混合动力电池电压监控电路的作用是将电池块电压输送给控制模块，以监控电池块的充放电，以及可能的短路，断路情况。"
    }
  ],
  "P0308": [
    {
      "scope": "所有汽车制造商",
      "code": "P0308",
      "zh-cn": "第8缸检测到失火",
      "en-us": "Cylinder 8 Misfire Detected",
      "sys": "点火系统",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。如果电子控制单元（ECU）检测到可能会对催化转换器造成破坏的失火，故障指示灯会闪烁，此时应立即关闭发动机。该故障码表明电子控制单元（ECU）检测到该气缸8失火。故障原因包括点火系统故障，燃油输送故障，进气歧管或EGR，PCV的空气泄漏，机械性气缸故障等。"
    }
  ],
  "P0A98": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A98",
      "zh-cn": "混合动力电池组冷却风扇2卡在开启位置",
      "en-us": "Hybrid Battery Pack Cooling Fan 2 Stuck On",
      "sys": "混合动力系统",
      "knowledge": "电池控制模块根据来自电池温度传感器的信号来控制电池风扇的开启或关闭。如果实际电池组温度比基于冷却风扇性能估计的电池组温度低出一设定值，控制模块认为电池组风扇卡在开启位置。"
    }
  ],
  "P0697": [
    {
      "scope": "所有汽车制造商",
      "code": "P0697",
      "zh-cn": "传感器参考电压C电路/开路",
      "en-us": "Sensor Reference Voltage C Circuit/Open",
      "sys": "计算机或辅助输出电路",
      "knowledge": "电子控制单元（ECU）检测到5伏参考电压电路C出错。故障原因包括5伏参考电压电路到某个传感器的电路发生短路或短路，一个或多个传感器发生短路或开路，ECU等。"
    }
  ],
  "P0490": [
    {
      "scope": "所有汽车制造商",
      "code": "P0490",
      "zh-cn": "废气再循环A控制电路高",
      "en-us": "Exhaust Gas Recirculation A Control Circuit High",
      "sys": "排放控制",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。如果电子控制单元（ECU）检测到废气再循环传感器A信号电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0574": [
    {
      "scope": "所有汽车制造商",
      "code": "P0574",
      "zh-cn": "定速巡航系统 - 车速过快",
      "en-us": "Cruise Control System - Vehicle Speed Too High",
      "sys": "车速及怠速控制",
      "knowledge": "定速巡航系统（CRUISE CONTROL SYSTEM）可以使司机不用踩油门踏板而自动地保持车速。"
    }
  ],
  "P0375": [
    {
      "scope": "所有汽车制造商",
      "code": "P0375",
      "zh-cn": "点火正时参考高解析信号B",
      "en-us": "Timing Reference High Resolution Signal B",
      "sys": "点火系统",
      "knowledge": "光学传感器通过数位于喷射泵内的传感器盘上的脉冲来为动力总成控制模块（PCM）提供高解析信号。这个信号是PCM控制燃油和正时的一个重要参考依据之一。该故障码的原因包括光学传感器，其电路，接头或PCM."
    }
  ],
  "P07BD": [
    {
      "scope": "所有汽车制造商",
      "code": "P07BD",
      "zh-cn": "变速器驻车档位置传感器/开关B电路间歇/不稳定",
      "en-us": "Transmission Park Position Sensor/Switch B Circuit Intermittent/Erratic",
      "sys": "变速箱",
      "knowledge": "驻车档位置传感器的作用是将变速杆是否在驻车档的位置的信号输送给电子控制单元（ECU）。如果ECU检测到驻车档位置传感器电路电压突然变化，该故障码会出现。"
    }
  ],
  "P0BD4": [
    {
      "scope": "所有汽车制造商",
      "code": "P0BD4",
      "zh-cn": "驱动电机换流器温度传感器C电路高",
      "en-us": "Drive Motor Inverter Temperature Sensor C Circuit High",
      "sys": "混合动力系统",
      "knowledge": "换流器的作用是将直流电转换成交流电。混合动力电子控制单元（HV ECU）运用一个集成在换流器里的温度传感器来监测驱动电机换流器的温度。如果这个温度传感器输出异常，该故障码会出现。"
    }
  ],
  "P0871": [
    {
      "scope": "所有汽车制造商",
      "code": "P0871",
      "zh-cn": "变速器液压力（TFP）传感器/开关C电路范围/性能",
      "en-us": "Transmission Fluid Pressure Sensor/Switch C Circuit Range/Performance",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P0150": [
    {
      "scope": "所有汽车制造商",
      "code": "P0150",
      "zh-cn": "氧传感器电路（第2排，传感器 1）",
      "en-us": "O2 Sensor Circuit (Bank 2, Sensor 1)",
      "sys": "燃油或空气",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。电子控制单元（ECU）监控加热氧传感器的电路。当ECU检测到用于测定废气中氧含量的电路有问题时，则该故障码会出现。故障原因包括排气歧管或排气管泄漏，氧传感器本身或其电路或接头故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0250": [
    {
      "scope": "所有汽车制造商",
      "code": "P0250",
      "zh-cn": "涡轮/超级增压器排气阀门控制电磁阀B高",
      "en-us": "Turbocharger/Supercharger Wastegate Solenoid B High",
      "sys": "燃油或空气",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。超级增压器是一个用来给内燃机增加进气的空气压缩机。更多的进气为发动机提供了更多的氧气，从而允许控制模块提供更多的燃油，从而提高输出功率。废气门电磁阀的作用是通过控制进入涡轮的尾气流量（将其余尾气绕开），来调整涡轮转速，从而调整最大增压压力。如果电子控制单元（ECU）检测到废气门电磁阀B电路电压高于校准的最高值，该故障码会出现。"
    }
  ],
  "P0859": [
    {
      "scope": "所有汽车制造商",
      "code": "P0859",
      "zh-cn": "驱动防滑/牵引力控制（TCS）输入信号高",
      "en-us": "Traction Control Input Signal High",
      "sys": "变速箱",
      "knowledge": "驱动防滑牵引力控制（TCS）系统的作用是是当感应到驱动轮打滑现象时，通过滞后点火时间等来控制扭力输出，提前升档，二档起步，防止液力变矩器锁定，和刹车等来防止打滑。"
    }
  ],
  "P0850": [
    {
      "scope": "所有汽车制造商",
      "code": "P0850",
      "zh-cn": "停车档（P）/空档（N）位置开关 输入电路",
      "en-us": "Park/Neutral Switch Input Circuit",
      "sys": "变速箱",
      "knowledge": "驻车档/空档位置开关的作用是将自动变速器在驻车档/空档，还是其他挡位的信息输送给电子控制单元（ECU），作为决定发动机怠速，还是增加负荷的参考依据。该开关也被用在起动机继电器电路中，以防止汽车在驻车档/空档之外的其他挡位启动。"
    }
  ],
  "P037D": [
    {
      "scope": "所有汽车制造商",
      "code": "P037D",
      "zh-cn": "电热塞监控电路",
      "en-us": "Glow Plug Sense Circuit",
      "sys": "点火系统",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。该故障码表明电热赛监控电路发生故障。"
    }
  ],
  "P02BD": [
    {
      "scope": "所有汽车制造商",
      "code": "P02BD",
      "zh-cn": "喷油器泄漏 - 气缸9",
      "en-us": "Cylinder 9 - Injector Leaking",
      "sys": "燃油或空气",
      "knowledge": "喷油器的作用是将燃油雾化，使其适应燃烧的要求。工作原理是当电磁线圈通电时，产生吸力，针阀被吸起，打开喷孔，燃油经针阀头部的轴针与喷孔之间的环形间隙高速喷出，形成雾状。电子控制单元通过控制喷油器打开时间间隔（也叫脉冲宽度）来控制喷油量。该故障码表明第9缸喷油器发生泄漏。"
    }
  ],
  "P0022": [
    {
      "scope": "所有汽车制造商",
      "code": "P0022",
      "zh-cn": "A 凸轮轴位置执行器 - 正时滞后 （第2排）",
      "en-us": "A Camshaft Position - Timing Over-Retarded (Bank 2)",
      "sys": "燃油, 空气或排放控制",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。P0022的故障原因包括A进气/左/前凸轮轴正时没有设定好，凸轮轴过前原理机械性卡住，或者是执行器阀门卡在开的位置。"
    }
  ],
  "P0127": [
    {
      "scope": "所有汽车制造商",
      "code": "P0127",
      "zh-cn": "进气温度太高",
      "en-us": "Intake Air Temperature Too High",
      "sys": "燃油或空气",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。如果ECU检测到进气温度（IAT）传感器信号太高，该故障码会出现。故障原因包括（涡轮增压）中冷器泵故障，中冷器冷却液太低等。"
    }
  ],
  "P061D": [
    {
      "scope": "所有汽车制造商",
      "code": "P061D",
      "zh-cn": "内部控制模块-发动机空气量性能",
      "en-us": "Internal Control Module Engine Air Mass Performance",
      "sys": "计算机或辅助输出电路",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P032B": [
    {
      "scope": "所有汽车制造商",
      "code": "P032B",
      "zh-cn": "爆震传感器3电路范围/性能 （第1排）",
      "en-us": "Knock Sensor 3 Circuit Range/Performance (Bank 1)",
      "sys": "点火系统",
      "knowledge": "爆震传感器负责在发动机转速改变时探测震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。如果这个电压出错，该故障码会出现。"
    }
  ],
  "P0491": [
    {
      "scope": "所有汽车制造商",
      "code": "P0491",
      "zh-cn": "二次空气喷射系统流量不足（第1排）",
      "en-us": "Secondary Air Injection System Insufficient Flow (Bank 1)",
      "sys": "排放控制",
      "knowledge": "在发动机刚刚启动时，二次空气喷射系统（AIR）通过往排气歧管强制输入空气来氧化产生的碳氢化合物，一氧化碳等有害气体。这个过程也同时加速了催化转换器的暖化过程。电子控制单元（ECU）如果发现当二次空气喷射系统泵交替打开关闭时没有足够的空气流量变化，该故障码会出现。故障原因包括空气泵输出阻塞，AIR旁通电磁阀泄漏或阻塞，AIR旁通电磁阀卡住，阀故障，电子空气喷射泵管路泄漏，电子空气喷射泵故障，电子控制模块（PCM或ECM）故障等。"
    }
  ],
  "P0794": [
    {
      "scope": "所有汽车制造商",
      "code": "P0794",
      "zh-cn": "中间轴转速传感器A电路间歇",
      "en-us": "Intermediate Shaft Speed Sensor A Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "变速器的主要部件包括位于中间轴上的行星齿轮系统。它的一端连接输入轴，另外一端连接输出轴。故障原因包括中间轴转速（ISS）传感器，电路，接头，控制模块等。"
    }
  ],
  "P0515": [
    {
      "scope": "所有汽车制造商",
      "code": "P0515",
      "zh-cn": "电池温度传感器电路",
      "en-us": "Battery Temperature Sensor Circuit",
      "sys": "车速及怠速控制",
      "knowledge": "电池温度传感器位于汽车电池托盘的底部。它的主要作用是将电池温度以电信号的形式传输给电子控制单元（ECU），以帮助决定充电速度。该故障码表明，电池温度传感器电路故障。"
    }
  ],
  "P0266": [
    {
      "scope": "所有汽车制造商",
      "code": "P0266",
      "zh-cn": "第2缸贡献/平衡错误",
      "en-us": "Cylinder 2 Contribution/Balance",
      "sys": "燃油或空气",
      "knowledge": "电子控制单元（ECU）检测到第2缸的曲轴加速贡献低于校准值。故障原因包括第2缸喷油系统；或其它影响第2缸的发动机问题。"
    }
  ],
  "P0A1D": [
    {
      "scope": "所有汽车制造商",
      "code": "P0A1D",
      "zh-cn": "混合动力总成控制模块",
      "en-us": "Hybrid Powertrain Control Module",
      "sys": "混合动力系统",
      "knowledge": "混合动力汽车电子控制单元（HV ECU）发生内部故障。"
    }
  ],
  "P0874": [
    {
      "scope": "所有汽车制造商",
      "code": "P0874",
      "zh-cn": "变速器液压力（TFP）传感器/开关C电路间歇",
      "en-us": "Transmission Fluid Pressure Sensor/Switch C Circuit Intermittent",
      "sys": "变速箱",
      "knowledge": "换档电磁阀通过打开或关闭变速器液控制阀来控制通往变速器离合器的液压，以控制其分离和结合，从而实现换档。准确控制变速器液压力对于平稳换档非常重要。变速器液压力（TFP）传感器的作用是将变速器液压力已电信号的形式输送给变速器控制模块（TCU），作为变速器液压力控制电磁阀工作的参考依据。"
    }
  ],
  "P02AA": [
    {
      "scope": "所有汽车制造商",
      "code": "P02AA",
      "zh-cn": "燃油（空燃比）修剪在最高限 - 气缸5",
      "en-us": "Cylinder 5 - Fuel Trim at Max Limit",
      "sys": "燃油或空气",
      "knowledge": "燃油修剪是指电子控制单元（ECU）通过增加或减少喷油器打开时间的方式来控制燃油输送，从而使发动机获得最佳空燃比（空气对汽油质量比为14.7:1）。空然比太浓是指燃油输送量过大，空然比太稀是指燃油输送量过小。如果燃油修剪达到并停留在最大极限超过一定时间，该故障码会出现。"
    }
  ]
}