let P3 = {
  "P3021": [
    {
      "scope": "宝马",
      "code": "P3021",
      "zh-cn": "加热氧传感器 - 信号电压故障（第2排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 2 - Signal Voltage Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3453": [
    {
      "scope": "所有汽车制造商",
      "code": "P3453",
      "zh-cn": "气缸7排气门控制 - 电路开路",
      "en-us": "Cylinder 7 Exhaust Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3047": [
    {
      "scope": "奥迪，大众",
      "code": "P3047",
      "zh-cn": "启动电机继电器2 - 短路到正极",
      "en-us": "Starter Motor Relay 2 - Short to Positive",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "起动机继电器（电磁阀）的工作原理是，当点火开关打开时，小电流经过一个电磁线圈，导致一对更大的接触器结合，从而允许大电流经过动电机，而启动发动机。"
    }
  ],
  "P3417": [
    {
      "scope": "所有汽车制造商",
      "code": "P3417",
      "zh-cn": "气缸3停缸系统/进气门控制 - 电路开路",
      "en-us": "Cylinder 3 Deactivation/Intake Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3063": [
    {
      "scope": "奥迪，大众",
      "code": "P3063",
      "zh-cn": "涡轮增压器（TC） - 没有达到超过增压极限",
      "en-us": "Turbocharger (TC) - Boost Limit Not Reached.",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。废气门执行器的作用是通过控制进入涡轮的尾气流量（将其余尾气绕开），来调整涡轮转速，从而调整最大增压压力。"
    }
  ],
  "P3105": [
    {
      "scope": "奥迪，大众",
      "code": "P3105",
      "zh-cn": "进气歧管空气控制电磁阀 - 开路/短路到接地",
      "en-us": "Intake Manifold Air Control Solenoid - Open Circuit/Short to Ground",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "进气歧管空气控制（IMAC）总成位于进气歧管和气缸盖之间。为提高发动机性能，每个气缸对应两个进气通路，其中之一一直开通，另一个仅当转速高于一定值（比如说3000RPM）的时候才打开。IMAC执行电机的作用是根据电子控制单元（ECU）的指令开/关进气通路的阀门翻板。"
    }
  ],
  "P3491": [
    {
      "scope": "所有汽车制造商",
      "code": "P3491",
      "zh-cn": "气缸12停缸系统/进气门控制 - 电路低",
      "en-us": "Cylinder 12 Deactivation/Intake Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3433": [
    {
      "scope": "所有汽车制造商",
      "code": "P3433",
      "zh-cn": "气缸5停缸系统/进气门控制 - 电路开路",
      "en-us": "Cylinder 5 Deactivation/Intake Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3467": [
    {
      "scope": "所有汽车制造商",
      "code": "P3467",
      "zh-cn": "气缸9停缸系统/进气门控制 - 电路低",
      "en-us": "Cylinder 9 Deactivation/Intake Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3464": [
    {
      "scope": "所有汽车制造商",
      "code": "P3464",
      "zh-cn": "气缸8排气门控制 - 电路高",
      "en-us": "Cylinder 8 Exhaust Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3435": [
    {
      "scope": "所有汽车制造商",
      "code": "P3435",
      "zh-cn": "气缸5停缸系统/进气门控制 - 电路低",
      "en-us": "Cylinder 5 Deactivation/Intake Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3213": [
    {
      "scope": "宝马",
      "code": "P3213",
      "zh-cn": "控制器局域网（CAN）数据连线监控 - ETC检查故障",
      "en-us": "CAN Data Bus Monitoring - ETC Check Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    },
    {
      "scope": "宝马",
      "code": "P3213",
      "zh-cn": "控制器局域网（CAN）数据连线监控 - ETC检查故障",
      "en-us": "CAN Data Bus Monitoring - ETC Check Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    },
    {
      "scope": "迷你",
      "code": "P3213",
      "zh-cn": "控制器局域网数据连线监控 - ETC自检故障",
      "en-us": "CAN Data Bus Monitoring - ETC Self-test Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    }
  ],
  "P3201": [
    {
      "scope": "宝马",
      "code": "P3201",
      "zh-cn": "变速器控制模块 - 控制器局域网（CAN）芯片出错",
      "en-us": "Transmission Control Module - CAN Chip Defective",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。"
    }
  ],
  "P3038": [
    {
      "scope": "奥迪，大众",
      "code": "P3038",
      "zh-cn": "节气门阀控制模块2 - 没有达到最低极限",
      "en-us": "Throttle Valve Control Module 2 - Lower Limit Not Reached",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    },
    {
      "scope": "迷你",
      "code": "P3038",
      "zh-cn": "加热氧传感器1 - 空燃比偏稀监控/偏浓监控",
      "en-us": "Heated Oxygen Sensor 1 - Lean Shift Monitoring/Rich Shift Monitoring",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3121": [
    {
      "scope": "克莱斯勒，道奇，吉普",
      "code": "P3121",
      "zh-cn": "催化转换器温度传感器 - 电路故障",
      "en-us": "Catalyst Temperature Sensor - Circuit Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "催化转换器（也称作催化净化转换器），是一个利用催化剂的作用将排气中的CO、HC和NOx转换为对人体无害的气体的排气净化装置。它一般位于排气管的消声器之前。"
    }
  ],
  "P3231": [
    {
      "scope": "迷你",
      "code": "P3231",
      "zh-cn": "控制模块监控 - 错误响应正常性",
      "en-us": "Control Module Monitoring - Error Response Plausibility",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    }
  ],
  "P3431": [
    {
      "scope": "所有汽车制造商",
      "code": "P3431",
      "zh-cn": "气缸4排气门控制 - 电路低",
      "en-us": "Cylinder 4 Exhaust Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3050": [
    {
      "scope": "克莱斯勒，道奇，吉普",
      "code": "P3050",
      "zh-cn": "氧传感器 - 电路故障",
      "en-us": "Oxygen Sensor - Circuit Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    },
    {
      "scope": "沃尔沃",
      "code": "P3050",
      "zh-cn": "爆震传感器模块 - 内部错误",
      "en-us": "Knock Sensor Module - Internal Fault",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "动力总成控制模块（PCM）利用爆震传感器探测发动机转速改变时的震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。"
    }
  ],
  "P323F": [
    {
      "scope": "迷你",
      "code": "P323F",
      "zh-cn": "控制模块监控 - 进气流量/拉姆达控制阀，信号相关性",
      "en-us": "Control Module Monitoring - Air Volume/Lambda Control Valve, Signal Correlation",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "拉姆达是空燃比的另外一种表达方法（拉姆达等于1相当于空燃比14.7：1，拉姆达越大，空燃比越稀）。"
    }
  ],
  "P3205": [
    {
      "scope": "宝马",
      "code": "P3205",
      "zh-cn": "局部控制器局域网（CAN）数据连线 - 故障",
      "en-us": "Local CAN Data Bus - Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。"
    },
    {
      "scope": "迷你",
      "code": "P3205",
      "zh-cn": "控制器局域网数据连线 - 故障",
      "en-us": "CAN Data Bus - Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。"
    }
  ],
  "P3209": [
    {
      "scope": "奥迪，大众",
      "code": "P3209",
      "zh-cn": "加热氧传感器 - 信号太低（第1/2排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 1/2 - Signal Too Low",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3036": [
    {
      "scope": "迷你",
      "code": "P3036",
      "zh-cn": "加热氧传感器1 - 空燃比偏稀监控/偏浓监控",
      "en-us": "Heated Oxygen Sensor 1 - Lean Shift Monitoring/Rich Shift Monitoring",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P322A": [
    {
      "scope": "宝马",
      "code": "P322A",
      "zh-cn": "外围压力传感器 - 电路开路",
      "en-us": "Ambient Pressure Sensor - Open Circuit",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "外围压力传感器的作用是将大气压力以电信号的形式输送给电子控制模块。动力总成控制模块（PCM）根据进气歧管压力与大气压力之间的差值（跟发动机负荷成线性关系）修正燃油供给，以帮助发动机在不同负荷下达到最佳空燃比。"
    },
    {
      "scope": "迷你",
      "code": "P322A",
      "zh-cn": "大气压力（BARO）传感器 - 电路开路",
      "en-us": "Barometric Pressure Sensor - Open Circuit",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "大气压力传感器（有时候也叫高海拔补偿器，HAC）的作用是将大气压力以电信号的形式输送给电子控制模块。大气压力会随天气和海拔高度的变化而变化。压力越小，空气越稀薄。动力总成控制模块（PCM）会根据大气压力的数值来修正燃油供给，以帮助发动机达到最佳空燃比。"
    }
  ],
  "P3092": [
    {
      "scope": "奥迪，大众",
      "code": "P3092",
      "zh-cn": "发动机控制模块（ECM）- 内部错误",
      "en-us": "Engine Control Module (ECM) - Internal Fault",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P3490": [
    {
      "scope": "所有汽车制造商",
      "code": "P3490",
      "zh-cn": "气缸12停缸系统/进气门控制 - 性能问题",
      "en-us": "Cylinder 12 Deactivation/Intake Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3456": [
    {
      "scope": "所有汽车制造商",
      "code": "P3456",
      "zh-cn": "气缸7排气门控制 - 电路高",
      "en-us": "Cylinder 7 Exhaust Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P312C": [
    {
      "scope": "沃尔沃",
      "code": "P312C",
      "zh-cn": "检测到失火，气缸2 - 催化箱破坏",
      "en-us": "Misfire Detected, Cylinder 2 - catalyst Damage",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。"
    }
  ],
  "P3023": [
    {
      "scope": "宝马",
      "code": "P3023",
      "zh-cn": "加热氧传感器 - 通讯故障（第2排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 2 - Communication Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3204": [
    {
      "scope": "宝马",
      "code": "P3204",
      "zh-cn": "局部控制器局域网（CAN）数据连线 - 故障",
      "en-us": "Local CAN Data Bus - Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。"
    },
    {
      "scope": "迷你",
      "code": "P3204",
      "zh-cn": "控制器局域网数据连线 - 故障",
      "en-us": "CAN Data Bus - Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。"
    }
  ],
  "P3487": [
    {
      "scope": "所有汽车制造商",
      "code": "P3487",
      "zh-cn": "气缸11排气门控制 - 电路低",
      "en-us": "Cylinder 11 Exhaust Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P300A": [
    {
      "scope": "沃尔沃",
      "code": "P300A",
      "zh-cn": "凸轮轴位置（CMP）传感器（CMP），进气端 - 信号错误",
      "en-us": "Camshaft Position (CMP) Sensor, Intake - Signal Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。"
    }
  ],
  "P321F": [
    {
      "scope": "宝马",
      "code": "P321F",
      "zh-cn": "外围压力传感器 - 最低压力不正确",
      "en-us": "Ambient Pressure Sensor - Minimum Pressure Incorrect",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "外围压力传感器的作用是将大气压力以电信号的形式输送给电子控制模块。动力总成控制模块（PCM）根据进气歧管压力与大气压力之间的差值（跟发动机负荷成线性关系）修正燃油供给，以帮助发动机在不同负荷下达到最佳空燃比。"
    },
    {
      "scope": "迷你",
      "code": "P321F",
      "zh-cn": "大气压力（BARO）传感器 - 最小压力不正确",
      "en-us": "Barometric Pressure Sensor - Minimum Pressure Incorrect",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "大气压力传感器（有时候也叫高海拔补偿器，HAC）的作用是将大气压力以电信号的形式输送给电子控制模块。大气压力会随天气和海拔高度的变化而变化。压力越小，空气越稀薄。动力总成控制模块（PCM）会根据大气压力的数值来修正燃油供给，以帮助发动机达到最佳空燃比。"
    }
  ],
  "P3091": [
    {
      "scope": "迷你",
      "code": "P3091",
      "zh-cn": "燃油管路压力，压力控制 - 最低压力不正确",
      "en-us": "Fuel Rail Pressure, Pressure Contol - Minimum Pressure Incorrect",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。"
    }
  ],
  "P320D": [
    {
      "scope": "宝马",
      "code": "P320D",
      "zh-cn": "控制器局域网（CAN）数据连线监控 - ETC超时",
      "en-us": "CAN Data Bus Monitoring - ETC Timeout",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    },
    {
      "scope": "宝马",
      "code": "P320D",
      "zh-cn": "控制器局域网（CAN）数据连线监控 - ETC超时",
      "en-us": "CAN Data Bus Monitoring - ETC Timeout",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    },
    {
      "scope": "迷你",
      "code": "P320D",
      "zh-cn": "控制器局域网数据连线监控 - ETC超时",
      "en-us": "CAN Data Bus Monitoring - ETC Timeout",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    }
  ],
  "P3199": [
    {
      "scope": "宝马",
      "code": "P3199",
      "zh-cn": "发动机冷却液温度 - 信号卡住",
      "en-us": "Engine Coolant Temperature - Signal Stuck",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。"
    },
    {
      "scope": "迷你",
      "code": "P3199",
      "zh-cn": "发动机冷却液温度（ECT）传感器 -信号卡住",
      "en-us": "Engine Coolant Temperature Sensor - Signal Stuck",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。"
    }
  ],
  "P3488": [
    {
      "scope": "所有汽车制造商",
      "code": "P3488",
      "zh-cn": "气缸11排气门控制 - 电路高",
      "en-us": "Cylinder 11 Exhaust Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3048": [
    {
      "scope": "奥迪，大众",
      "code": "P3048",
      "zh-cn": "启动电机继电器2 - 短路到接地",
      "en-us": "Starter Motor Relay 2 - Short to Ground",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "起动机继电器（电磁阀）的工作原理是，当点火开关打开时，小电流经过一个电磁线圈，导致一对更大的接触器结合，从而允许大电流经过动电机，而启动发动机。"
    }
  ],
  "P3420": [
    {
      "scope": "所有汽车制造商",
      "code": "P3420",
      "zh-cn": "气缸3停缸系统/进气门控制 - 电路高",
      "en-us": "Cylinder 3 Deactivation/Intake Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3440": [
    {
      "scope": "所有汽车制造商",
      "code": "P3440",
      "zh-cn": "气缸5排气门控制 - 电路高",
      "en-us": "Cylinder 5 Exhaust Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3100": [
    {
      "scope": "沃尔沃",
      "code": "P3100",
      "zh-cn": "凸轮轴位置（CMP）传感器（CMP）-信号错误",
      "en-us": "Camshaft Position (CMP) Sensor - Signal Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。"
    },
    {
      "scope": "沃尔沃",
      "code": "P3100",
      "zh-cn": "启动过程中检测到失火",
      "en-us": "Misfire Detected During Start-up",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。"
    }
  ],
  "P3411": [
    {
      "scope": "所有汽车制造商",
      "code": "P3411",
      "zh-cn": "气缸2停缸系统/进气门控制 - 电路低",
      "en-us": "Cylinder 2 Deactivation/Intake Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3468": [
    {
      "scope": "所有汽车制造商",
      "code": "P3468",
      "zh-cn": "气缸9停缸系统/进气门控制 - 电路高",
      "en-us": "Cylinder 9 Deactivation/Intake Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3480": [
    {
      "scope": "所有汽车制造商",
      "code": "P3480",
      "zh-cn": "气缸10排气门控制 - 电路高",
      "en-us": "Cylinder 10 Exhaust Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3031": [
    {
      "scope": "奥迪，大众",
      "code": "P3031",
      "zh-cn": "节气门阀控制电路2 - 电路故障",
      "en-us": "Throttle Valve Control Circuit 2 -Circuit Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    }
  ],
  "P3246": [
    {
      "scope": "奔驰",
      "code": "P3246",
      "zh-cn": "加热氧传感器3 - 短路到正极",
      "en-us": "Heated Oxygen Sensor 3 - Short to Positive",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3484": [
    {
      "scope": "所有汽车制造商",
      "code": "P3484",
      "zh-cn": "气缸11停缸系统/进气门控制 - 电路高",
      "en-us": "Cylinder 11 Deactivation/Intake Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3040": [
    {
      "scope": "奥迪，大众",
      "code": "P3040",
      "zh-cn": "齿轮比 - 难以相信",
      "en-us": "Gear Ratio - Implausible",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    },
    {
      "scope": "宝马",
      "code": "P3040",
      "zh-cn": "加热氧传感器 - 混合比稀/浓电压故障（第1排第2个）",
      "en-us": "Heated Oxygen Sensor 2, Bank 1 - Lean/Rich Voltage Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    },
    {
      "scope": "迷你",
      "code": "P3040",
      "zh-cn": "加热氧传感器2 - 空燃比偏稀监控/偏浓监控",
      "en-us": "Heated Oxygen Sensor 2 - Lean Shift Monitoring/Rich Shift Monitoring",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3234": [
    {
      "scope": "迷你",
      "code": "P3234",
      "zh-cn": "控制模块监控 - 节气门阀停止位置测试正常性",
      "en-us": "Control Module Monitoring - Throttle Valve Stop Test Plausibility",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    }
  ],
  "P3197": [
    {
      "scope": "迷你",
      "code": "P3197",
      "zh-cn": "发动机冷却液温度（ECT）传感器，冷却水箱出口 - 故障",
      "en-us": "Engine Coolant Temperature Sensor, Radiator Outlet - Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。"
    }
  ],
  "P3460": [
    {
      "scope": "所有汽车制造商",
      "code": "P3460",
      "zh-cn": "气缸8停缸系统/进气门控制 - 电路高",
      "en-us": "Cylinder 8 Deactivation/Intake Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3446": [
    {
      "scope": "所有汽车制造商",
      "code": "P3446",
      "zh-cn": "气缸6排气门控制 - 性能问题",
      "en-us": "Cylinder 6 Exhaust Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3009": [
    {
      "scope": "奥迪，大众",
      "code": "P3009",
      "zh-cn": "燃油冷却泵继电器 - 短路到正极",
      "en-us": "Fuel Cooling Pump Relay - Short to Positive",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    }
  ],
  "P3212": [
    {
      "scope": "奥迪，大众",
      "code": "P3212",
      "zh-cn": "加热氧传感器 - 加热器电路故障（第2排第1个传感器）",
      "en-us": "Heated Oxygen Sensor 1, Bank 2 - Heater Circuit Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    },
    {
      "scope": "奥迪，大众",
      "code": "P3212",
      "zh-cn": "加热氧传感器 - 加热器电路故障（第2排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 2 - Heater Circuit Malfunction.",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P303D": [
    {
      "scope": "沃尔沃",
      "code": "P303D",
      "zh-cn": "爆震传感器，前面 - 信号偏低",
      "en-us": "Knock Sensor, Front - Signal Low",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "动力总成控制模块（PCM）利用爆震传感器探测发动机转速改变时的震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。"
    }
  ],
  "P341B": [
    {
      "scope": "沃尔沃",
      "code": "P341B",
      "zh-cn": "凸轮轴位置（CMP）传感器，排气端 - 信号错误",
      "en-us": "Camshaft Position (CMP) Sensor, Exhaust - Signal Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。"
    }
  ],
  "P3211": [
    {
      "scope": "奥迪，大众",
      "code": "P3211",
      "zh-cn": "加热氧传感器 - 加热器电路故障（第1排第1个传感器）",
      "en-us": "Heated Oxygen Sensor 1, Bank 1 - Heater Circuit Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    },
    {
      "scope": "奥迪，大众",
      "code": "P3211",
      "zh-cn": "加热氧传感器 - 加热器电路故障（第1排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 1 - Heater Circuit Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3217": [
    {
      "scope": "迷你",
      "code": "P3217",
      "zh-cn": "控制器局域网数据连线监控 - 难以相信信号",
      "en-us": "CAN Data Bus Monitoring - Implausible Signal",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。"
    }
  ],
  "P3403": [
    {
      "scope": "所有汽车制造商",
      "code": "P3403",
      "zh-cn": "气缸1停缸系统/进气门控制 - 电路低",
      "en-us": "Cylinder 1 Deactivation/Intake Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3475": [
    {
      "scope": "所有汽车制造商",
      "code": "P3475",
      "zh-cn": "气缸10停缸系统/进气门控制 - 电路低",
      "en-us": "Cylinder 10 Deactivation/Intake Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3472": [
    {
      "scope": "所有汽车制造商",
      "code": "P3472",
      "zh-cn": "气缸9排气门控制 - 电路高",
      "en-us": "Cylinder 9 Exhaust Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3270": [
    {
      "scope": "迷你",
      "code": "P3270",
      "zh-cn": "空气流量（MAF）传感器 - 低输入",
      "en-us": "Mass Air Flow Sensor - Low Input",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。"
    }
  ],
  "P3002": [
    {
      "scope": "奥迪，大众",
      "code": "P3002",
      "zh-cn": "加速踏板位置（APP）传感器（APP）- 变速器降挡开关",
      "en-us": "Accelerator Pedal Position (APP) Sensor - Transmission Kick-down Switch",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "在电子节气门控制（ETC）系统中，加速踏板位置（APP）传感器的作用是将油门踏板的位置以电信号的形式传递给节气门控制模块，作为节气门执行器控制节气门阀开度的参考依据。（变速器在油门踩到底时的）降挡开关，也叫低速挡开关，其主要功能是探测油门是否被踩到底。当变速器控制模块（TCU）收到到油门被踩到底的信号后，变速器会降挡到基于当前速度最低允许的挡位，以让发动机发挥最大扭矩。"
    },
    {
      "scope": "迷你",
      "code": "P3002",
      "zh-cn": "燃油管路压力，流速控制 - 压力太低",
      "en-us": "Fuel Rail Pressure, Flow Rate Control - Pressure Too Low",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。"
    }
  ],
  "P3033": [
    {
      "scope": "奥迪，大众",
      "code": "P3033",
      "zh-cn": "进气温度（IAT）传感器2 - 低输入",
      "en-us": "Intake Air Temperature (IAT) Sensor 2 - Low Input",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。"
    }
  ],
  "P3024": [
    {
      "scope": "宝马",
      "code": "P3024",
      "zh-cn": "加热氧传感器 - 起始化故障（第1排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 1 - Initialization Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    },
    {
      "scope": "迷你",
      "code": "P3024",
      "zh-cn": "加热氧传感器1 - 起始化失败",
      "en-us": "Heated Oxygen Sensor 1 - Initialization Failure",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3471": [
    {
      "scope": "所有汽车制造商",
      "code": "P3471",
      "zh-cn": "气缸9排气门控制 - 电路低",
      "en-us": "Cylinder 9 Exhaust Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3230": [
    {
      "scope": "迷你",
      "code": "P3230",
      "zh-cn": "负荷传感器监控 - 压力传感器正常性",
      "en-us": "Load Sensor Monitoring - Pressure Sensor Plausibility",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    }
  ],
  "P3026": [
    {
      "scope": "奥迪，大众",
      "code": "P3026",
      "zh-cn": "节气门阀控制电路，传感器1 - 信号太低",
      "en-us": "Throttle Valve Control Circuit, Sensor 1 - Signal Low",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    },
    {
      "scope": "宝马",
      "code": "P3026",
      "zh-cn": "加热氧传感器 - 操作温度故障（第1排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 1 - Operating Temperature Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    },
    {
      "scope": "迷你",
      "code": "P3026",
      "zh-cn": "加热氧传感器1 - 操作温度故障",
      "en-us": "Heated Oxygen Sensor 1 - Operating Temperature Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3470": [
    {
      "scope": "所有汽车制造商",
      "code": "P3470",
      "zh-cn": "气缸9排气门控制 - 性能问题",
      "en-us": "Cylinder 9 Exhaust Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3300": [
    {
      "scope": "沃尔沃",
      "code": "P3300",
      "zh-cn": "曲轴位置（CKP）传感器 - 信号丢失",
      "en-us": "Crankshaft Position (CKP) Sensor - Signal Missing",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。曲轴位置（CKP）传感器(也叫上止点传感器），其作用是检测上止点（TDC）信号、曲轴转角信号和发动机转速信号，并将其输入计算机，从而使计算机能按气缸的点火顺序发出最佳点火时刻指令。"
    }
  ],
  "P3099": [
    {
      "scope": "克莱斯勒，道奇，吉普",
      "code": "P3099",
      "zh-cn": "进气温度（IAT）传感器 - 值太低",
      "en-us": "Intake Air Temperature (IAT) Sensor - Value Too Low",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。"
    }
  ],
  "P3406": [
    {
      "scope": "所有汽车制造商",
      "code": "P3406",
      "zh-cn": "气缸1排气门控制 - 性能问题",
      "en-us": "Cylinder 1 Exhaust Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3448": [
    {
      "scope": "所有汽车制造商",
      "code": "P3448",
      "zh-cn": "气缸6排气门控制 - 电路高",
      "en-us": "Cylinder 6 Exhaust Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3445": [
    {
      "scope": "所有汽车制造商",
      "code": "P3445",
      "zh-cn": "气缸6排气门控制 - 电路开路",
      "en-us": "Cylinder 6 Exhaust Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3198": [
    {
      "scope": "宝马",
      "code": "P3198",
      "zh-cn": "发动机冷却液温度 - 故障",
      "en-us": "Engine Coolant Temperature - malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。"
    },
    {
      "scope": "迷你",
      "code": "P3198",
      "zh-cn": "发动机冷却液温度（ECT）传感器 -故障",
      "en-us": "Engine Coolant Temperature Sensor - Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。"
    }
  ],
  "P3489": [
    {
      "scope": "所有汽车制造商",
      "code": "P3489",
      "zh-cn": "气缸12停缸系统/进气门控制 - 电路开路",
      "en-us": "Cylinder 12 Deactivation/Intake Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P304D": [
    {
      "scope": "沃尔沃",
      "code": "P304D",
      "zh-cn": "爆震传感器，后面 - 信号偏低",
      "en-us": "Knock Sensor, Rear - Signal Low",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "动力总成控制模块（PCM）利用爆震传感器探测发动机转速改变时的震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。"
    }
  ],
  "P3476": [
    {
      "scope": "所有汽车制造商",
      "code": "P3476",
      "zh-cn": "气缸10停缸系统/进气门控制 - 电路高",
      "en-us": "Cylinder 10 Deactivation/Intake Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3216": [
    {
      "scope": "迷你",
      "code": "P3216",
      "zh-cn": "控制器局域网数据连线故障 - 信号没有及时收到",
      "en-us": "CAN Data Bus Malfunction - Signal Not Received in Time",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。"
    }
  ],
  "P3426": [
    {
      "scope": "所有汽车制造商",
      "code": "P3426",
      "zh-cn": "气缸4停缸系统/进气门控制 - 性能问题",
      "en-us": "Cylinder 4 Deactivation/Intake Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3438": [
    {
      "scope": "所有汽车制造商",
      "code": "P3438",
      "zh-cn": "气缸5排气门控制 - 性能问题",
      "en-us": "Cylinder 5 Exhaust Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3248": [
    {
      "scope": "迷你",
      "code": "P3248",
      "zh-cn": "扭矩管理请求 - 信号太高",
      "en-us": "Torque management Request - Signal Too High",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "扭力管理系统的作用是在变速器换挡或车轮打滑的过程中，通过暂时关闭喷油器，或滞后点火等的方式来降低发动机扭力，从而使换档更加平稳，并减少对传动系统的磨损。"
    }
  ],
  "P3493": [
    {
      "scope": "所有汽车制造商",
      "code": "P3493",
      "zh-cn": "气缸12排气门控制 - 电路开路",
      "en-us": "Cylinder 12 Exhaust Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3005": [
    {
      "scope": "奥迪，大众",
      "code": "P3005",
      "zh-cn": "发动机冷却液加热器继电器2 - 高输出",
      "en-us": "Engine Coolant heater Relay 2, High Output",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    },
    {
      "scope": "迷你",
      "code": "P3005",
      "zh-cn": "燃油管路压力，压力控制 - 压力太低",
      "en-us": "Fuel Rail Pressure, Pressure Control - Pressure Too Low",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。"
    }
  ],
  "P3150": [
    {
      "scope": "沃尔沃",
      "code": "P3150",
      "zh-cn": "启动过程中检测到失火 - 气缸5",
      "en-us": "Misfire Detected During Start up - Cylinder 5",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。"
    }
  ],
  "P312D": [
    {
      "scope": "沃尔沃",
      "code": "P312D",
      "zh-cn": "检测到失火，气缸2",
      "en-us": "Misfire Detected, Cylinder 2",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。"
    }
  ],
  "P3329": [
    {
      "scope": "奥迪，大众",
      "code": "P3329",
      "zh-cn": "进气歧管翻板电机2 - 开路/短路到负极",
      "en-us": "Intake Manifold Flap Motor 2 - Open Circuit/Short to Ground",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "进气歧管通路控制（IMRC）总成位于进气歧管和气缸盖之间。为提高发动机性能，每个气缸对应两个进气通路，其中之一一直开通，另一个仅当转速高于一定值（比如说3000RPM）的时候才打开。IMRC执行电机的作用是根据电子控制单元（ECU）的指令开/关进气通路的阀门翻板。"
    }
  ],
  "P3015": [
    {
      "scope": "奥迪，大众",
      "code": "P3015",
      "zh-cn": "燃油旁通阀 - 短路到正极",
      "en-us": "Fuel Bypass Valve - Short to Positive",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    },
    {
      "scope": "宝马",
      "code": "P3015",
      "zh-cn": "加热氧传感器 - 电压故障（第2排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 2 - Voltage Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3482": [
    {
      "scope": "所有汽车制造商",
      "code": "P3482",
      "zh-cn": "气缸11停缸系统/进气门控制 - 性能问题",
      "en-us": "Cylinder 11 Deactivation/Intake Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3262": [
    {
      "scope": "奥迪，大众",
      "code": "P3262",
      "zh-cn": "加热氧传感器 - 互换（第1/2排第2个）",
      "en-us": "Heated Oxygen Sensor 2, Bank 1/2 - Interchanged.",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3233": [
    {
      "scope": "迷你",
      "code": "P3233",
      "zh-cn": "控制模块监控 - 充电系统正常性",
      "en-us": "Control Module Monitoring - Charging System Plausibility",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    }
  ],
  "P3422": [
    {
      "scope": "所有汽车制造商",
      "code": "P3422",
      "zh-cn": "气缸3排气门控制 - 性能问题",
      "en-us": "Cylinder 3 Exhaust Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3140": [
    {
      "scope": "沃尔沃",
      "code": "P3140",
      "zh-cn": "启动过程中检测到失火 - 气缸4",
      "en-us": "Misfire Detected During Start up - Cylinder 4",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。"
    }
  ],
  "P3017": [
    {
      "scope": "宝马",
      "code": "P3017",
      "zh-cn": "加热氧传感器 - 校准故障（第2排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 2 - Calibration Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3196": [
    {
      "scope": "迷你",
      "code": "P3196",
      "zh-cn": "发动机冷却液温度（ECT）传感器，冷却水箱出口 - 高输入",
      "en-us": "Engine Coolant Temperature Sensor, Radiator Outlet - High Input",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。"
    }
  ],
  "P3200": [
    {
      "scope": "宝马",
      "code": "P3200",
      "zh-cn": "变速器控制模块 - 控制器局域网（CAN）芯片出错",
      "en-us": "Transmission Control Module - CAN Chip Defective",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。"
    },
    {
      "scope": "沃尔沃",
      "code": "P3200",
      "zh-cn": "点火线圈 - 信号错误",
      "en-us": "Ignition Coil - Signal Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。"
    }
  ],
  "P3449": [
    {
      "scope": "所有汽车制造商",
      "code": "P3449",
      "zh-cn": "气缸7停缸系统/进气门控制 - 电路开路",
      "en-us": "Cylinder 7 Deactivation/Intake Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3452": [
    {
      "scope": "所有汽车制造商",
      "code": "P3452",
      "zh-cn": "气缸7停缸系统/进气门控制 - 电路高",
      "en-us": "Cylinder 7 Deactivation/Intake Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3447": [
    {
      "scope": "所有汽车制造商",
      "code": "P3447",
      "zh-cn": "气缸6排气门控制 - 电路低",
      "en-us": "Cylinder 6 Exhaust Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P310C": [
    {
      "scope": "沃尔沃",
      "code": "P310C",
      "zh-cn": "启动过程中检测到失火 - 催化箱破坏",
      "en-us": "Misfire Detected During Start-up - Catalyst Damage",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。"
    }
  ],
  "P341C": [
    {
      "scope": "沃尔沃",
      "code": "P341C",
      "zh-cn": "凸轮轴位置（CMP）传感器，排气端 - 信号太高",
      "en-us": "Camshaft Position (CMP) Sensor, Exhaust - Signal High",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。"
    }
  ],
  "P3135": [
    {
      "scope": "克莱斯勒，道奇，吉普",
      "code": "P3135",
      "zh-cn": "微粒过滤器 - 难以相信信号",
      "en-us": "Particulate Filter - Implausible Signal",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "柴油机微粒过滤器（DPF）的作用是除掉柴油机尾气中的颗粒污染物和烟尘。柴油机微粒过滤器（DPF）一般分为可再生和不可再生两种。可再生微粒过滤器一般通过高温或利用氮氧化物氧化颗粒的方式来再生过滤器。"
    }
  ],
  "P3409": [
    {
      "scope": "所有汽车制造商",
      "code": "P3409",
      "zh-cn": "气缸2停缸系统/进气门控制 - 电路开路",
      "en-us": "Cylinder 2 Deactivation/Intake Valve Control Circuit Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3432": [
    {
      "scope": "所有汽车制造商",
      "code": "P3432",
      "zh-cn": "气缸4排气门控制 - 电路高",
      "en-us": "Cylinder 4 Exhaust Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3001": [
    {
      "scope": "迷你",
      "code": "P3001",
      "zh-cn": "燃油管路压力传感器 - 信号比预定值低",
      "en-us": "Fuel Rail Pressure Sensor - Signal Lower Than Expected",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。"
    }
  ],
  "P3139": [
    {
      "scope": "克莱斯勒，道奇，吉普",
      "code": "P3139",
      "zh-cn": "微粒过滤器 - 难以相信信号",
      "en-us": "Particulate Filter - Implausible Signal",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "柴油机微粒过滤器（DPF）的作用是除掉柴油机尾气中的颗粒污染物和烟尘。柴油机微粒过滤器（DPF）一般分为可再生和不可再生两种。可再生微粒过滤器一般通过高温或利用氮氧化物氧化颗粒的方式来再生过滤器。"
    }
  ],
  "P3459": [
    {
      "scope": "所有汽车制造商",
      "code": "P3459",
      "zh-cn": "气缸8停缸系统/进气门控制 - 电路低",
      "en-us": "Cylinder 8 Deactivation/Intake Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3434": [
    {
      "scope": "所有汽车制造商",
      "code": "P3434",
      "zh-cn": "气缸5停缸系统/进气门控制 - 性能问题",
      "en-us": "Cylinder 5 Deactivation/Intake Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P313C": [
    {
      "scope": "沃尔沃",
      "code": "P313C",
      "zh-cn": "检测到失火，气缸3 - 催化箱破坏",
      "en-us": "Misfire Detected, Cylinder 3 - catalyst Damage",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。"
    }
  ],
  "P3035": [
    {
      "scope": "奥迪，大众",
      "code": "P3035",
      "zh-cn": "节气门阀控制模块2 - 机械故障",
      "en-us": "Throttle Valve Control Module 2 - Mechanical Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    }
  ],
  "P3496": [
    {
      "scope": "所有汽车制造商",
      "code": "P3496",
      "zh-cn": "气缸12排气门控制 - 电路高",
      "en-us": "Cylinder 12 Exhaust Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3479": [
    {
      "scope": "所有汽车制造商",
      "code": "P3479",
      "zh-cn": "气缸10排气门控制 - 电路低",
      "en-us": "Cylinder 10 Exhaust Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3239": [
    {
      "scope": "奔驰",
      "code": "P3239",
      "zh-cn": "加热氧传感器3 - 短路到正极",
      "en-us": "Heated Oxygen Sensor 3 - Short to Positive",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3416": [
    {
      "scope": "所有汽车制造商",
      "code": "P3416",
      "zh-cn": "气缸2排气门控制 - 电路高",
      "en-us": "Cylinder 2 Exhaust Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3022": [
    {
      "scope": "宝马",
      "code": "P3022",
      "zh-cn": "加热氧传感器 - 通讯故障（第1排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 1 - Communication Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    },
    {
      "scope": "迷你",
      "code": "P3022",
      "zh-cn": "加热氧传感器1 - 通讯故障",
      "en-us": "Heated Oxygen Sensor 1 - Communication Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P340C": [
    {
      "scope": "沃尔沃",
      "code": "P340C",
      "zh-cn": "凸轮轴位置（CMP）传感器，进气端 - 信号太高",
      "en-us": "Camshaft Position (CMP) Sensor, Intake - Signal High",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。"
    }
  ],
  "P304C": [
    {
      "scope": "沃尔沃",
      "code": "P304C",
      "zh-cn": "爆震传感器，后面 - 信号偏高",
      "en-us": "Knock Sensor, Rear - Signal High",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "动力总成控制模块（PCM）利用爆震传感器探测发动机转速改变时的震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。"
    }
  ],
  "P3014": [
    {
      "scope": "奥迪，大众",
      "code": "P3014",
      "zh-cn": "涡轮增压器（TC）废气门调节阀B - 开路/短路到负极",
      "en-us": "Turbocharger (TC) Wastegate Regulating Valve B - Open Circuit/Short to Ground",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。废气门执行器的作用是通过控制进入涡轮的尾气流量（将其余尾气绕开），来调整涡轮转速，从而调整最大增压压力。"
    },
    {
      "scope": "宝马",
      "code": "P3014",
      "zh-cn": "加热氧传感器 - 电压故障（第1排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 1 - Voltage Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    },
    {
      "scope": "迷你",
      "code": "P3014",
      "zh-cn": "加热氧传感器1 - 电压故障",
      "en-us": "Heated Oxygen Sensor 1 - Voltage Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P340D": [
    {
      "scope": "沃尔沃",
      "code": "P340D",
      "zh-cn": "凸轮轴位置（CMP）传感器，进气端 - 信号太低",
      "en-us": "Camshaft Position (CMP) Sensor, Intake - Signal Low",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。"
    }
  ],
  "P322B": [
    {
      "scope": "迷你",
      "code": "P322B",
      "zh-cn": "大气压力（BARO）传感器 - 信号故障",
      "en-us": "Barometric Pressure Sensor - Signal Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "大气压力传感器（有时候也叫高海拔补偿器，HAC）的作用是将大气压力以电信号的形式输送给电子控制模块。大气压力会随天气和海拔高度的变化而变化。压力越小，空气越稀薄。动力总成控制模块（PCM）会根据大气压力的数值来修正燃油供给，以帮助发动机达到最佳空燃比。"
    }
  ],
  "P3000": [
    {
      "scope": "奥迪，大众",
      "code": "P3000",
      "zh-cn": "控制器局域网（CAN）数据连线，仪表盘 - 电热塞告警灯",
      "en-us": "CAN data bus, instrumentation - glow plug warning lamp",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。"
    },
    {
      "scope": "沃尔沃",
      "code": "P3000",
      "zh-cn": "凸轮轴位置（CMP）传感器（CMP），进气端 - 信号错误",
      "en-us": "Camshaft Position (CMP) Sensor, Intake - Signal Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。"
    },
    {
      "scope": "迷你",
      "code": "P3000",
      "zh-cn": "燃油管路压力传感器 - 信号比预定值高",
      "en-us": "Fuel Rail Pressure Sensor - Signal Higher Than Expected",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。"
    }
  ],
  "P315C": [
    {
      "scope": "沃尔沃",
      "code": "P315C",
      "zh-cn": "检测到失火，气缸5 - 催化箱破坏",
      "en-us": "Misfire Detected, Cylinder 5 - catalyst Damage",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。"
    }
  ],
  "P3020": [
    {
      "scope": "宝马",
      "code": "P3020",
      "zh-cn": "加热氧传感器 - 信号电压故障（第1排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 1 - Signal Voltage Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    },
    {
      "scope": "迷你",
      "code": "P3020",
      "zh-cn": "加热氧传感器1 - 信号电压故障",
      "en-us": "Heated Oxygen Sensor 1 - Signal Voltage Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3049": [
    {
      "scope": "奥迪，大众",
      "code": "P3049",
      "zh-cn": "启动电机继电器2 - 开路",
      "en-us": "Starter Motor Relay 2 - Open Circuit",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "起动机继电器（电磁阀）的工作原理是，当点火开关打开时，小电流经过一个电磁线圈，导致一对更大的接触器结合，从而允许大电流经过动电机，而启动发动机。"
    }
  ],
  "P3062": [
    {
      "scope": "奥迪，大众",
      "code": "P3062",
      "zh-cn": "涡轮增压器（TC） - 超过增压极限",
      "en-us": "Turbocharger (TC) - Boost Limit Exceeded.",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。废气门执行器的作用是通过控制进入涡轮的尾气流量（将其余尾气绕开），来调整涡轮转速，从而调整最大增压压力。"
    }
  ],
  "P3041": [
    {
      "scope": "奥迪，大众",
      "code": "P3041",
      "zh-cn": "控制器局域网（CAN）数据连线，仪表盘 - 难以相信的发动机冷却液温度（ECT）信号",
      "en-us": "CAN Data Bus, Instrumentation - Implausible ECT Signal",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。"
    },
    {
      "scope": "宝马",
      "code": "P3041",
      "zh-cn": "加热氧传感器 - 混合比稀/浓电压故障（第2排第2个）",
      "en-us": "Heated Oxygen Sensor 2, Bank 2 - Lean/Rich Voltage Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3013": [
    {
      "scope": "奥迪，大众",
      "code": "P3013",
      "zh-cn": "涡轮增压器（TC）废气门调节阀B - 短路到正极",
      "en-us": "Turbocharger (TC) Wastegate Regulating Valve B - Short to Postive",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "涡轮增压器利用发动机排出的废气惯性冲力来推动涡轮，涡轮又带动同轴的叶轮，给进气增压，从而提高汽车功率。废气门执行器的作用是通过控制进入涡轮的尾气流量（将其余尾气绕开），来调整涡轮转速，从而调整最大增压压力。"
    },
    {
      "scope": "宝马",
      "code": "P3013",
      "zh-cn": "加热氧传感器 - 适应值太高（第2排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 2 - Adaptation Value Too High",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P323D": [
    {
      "scope": "迷你",
      "code": "P323D",
      "zh-cn": "控制模块监控 - 进气流量正常性",
      "en-us": "Control Module Monitoring - Air Volume Plausibility",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    }
  ],
  "P3133": [
    {
      "scope": "克莱斯勒，道奇，吉普",
      "code": "P3133",
      "zh-cn": "氧传感器 - 电源电压",
      "en-us": "Oxygen Sensor - Supply Voltage",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3029": [
    {
      "scope": "奥迪，大众",
      "code": "P3029",
      "zh-cn": "节气门阀控制电路，传感器2 - 信号太低",
      "en-us": "Throttle Valve Control Circuit, Sensor 2 - Signal Low",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    },
    {
      "scope": "宝马",
      "code": "P3029",
      "zh-cn": "加热氧传感器 - 没有活动（第2排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 2 - No Activity",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3097": [
    {
      "scope": "克莱斯勒，道奇，吉普",
      "code": "P3097",
      "zh-cn": "进气温度（IAT）传感器 - 值太高",
      "en-us": "Intake Air Temperature (IAT) Sensor - Value Too High",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。"
    },
    {
      "scope": "奥迪，大众",
      "code": "P3097",
      "zh-cn": "发动机控制模块（ECM）- 内部错误",
      "en-us": "Engine Control Module (ECM) - Internal Fault",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P3423": [
    {
      "scope": "所有汽车制造商",
      "code": "P3423",
      "zh-cn": "气缸3排气门控制 - 电路低",
      "en-us": "Cylinder 3 Exhaust Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P303C": [
    {
      "scope": "沃尔沃",
      "code": "P303C",
      "zh-cn": "爆震传感器，前面 - 信号偏高",
      "en-us": "Knock Sensor, Front - Signal High",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "动力总成控制模块（PCM）利用爆震传感器探测发动机转速改变时的震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。"
    }
  ],
  "P3463": [
    {
      "scope": "所有汽车制造商",
      "code": "P3463",
      "zh-cn": "气缸8排气门控制 - 电路低",
      "en-us": "Cylinder 8 Exhaust Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3350": [
    {
      "scope": "沃尔沃",
      "code": "P3350",
      "zh-cn": "点火线圈，气缸5 - 信号错误",
      "en-us": "Ignition Coil , Cylinder 5 - Signal Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。"
    }
  ],
  "P3320": [
    {
      "scope": "沃尔沃",
      "code": "P3320",
      "zh-cn": "点火线圈，气缸2 - 信号错误",
      "en-us": "Ignition Coil , Cylinder 2- Signal Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。"
    }
  ],
  "P3154": [
    {
      "scope": "克莱斯勒，道奇，吉普",
      "code": "P3154",
      "zh-cn": "进气温度（IAT）传感器 - 信号太高",
      "en-us": "Intake Air Temperature (IAT) Sensor - Signal High",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。"
    }
  ],
  "P3425": [
    {
      "scope": "所有汽车制造商",
      "code": "P3425",
      "zh-cn": "气缸4停缸系统/进气门控制 - 电路开路",
      "en-us": "Cylinder 4 Deactivation/Intake Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3080": [
    {
      "scope": "克莱斯勒，道奇，吉普",
      "code": "P3080",
      "zh-cn": "发动机机油压力传感器 - 电路故障",
      "en-us": "Engine Oil Pressure Sensor - Circuit Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    }
  ],
  "P3442": [
    {
      "scope": "所有汽车制造商",
      "code": "P3442",
      "zh-cn": "气缸6停缸系统/进气门控制 - 性能问题",
      "en-us": "Cylinder 6 Deactivation/Intake Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3269": [
    {
      "scope": "迷你",
      "code": "P3269",
      "zh-cn": "空气流量（MAF）传感器 - 高输入",
      "en-us": "Mass Air Flow Sensor - High Input",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "空气流量（MAF）传感器的作用是将空气流量转换成电信号送至电子控制单元（ECU），作为决定喷油量的基本信号之一。"
    }
  ],
  "P3284": [
    {
      "scope": "迷你",
      "code": "P3284",
      "zh-cn": "燃油管路压力传感器 - 难以相信的信号",
      "en-us": "Fuel Rail Pressure Sensor - Implausible Signal",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。"
    }
  ],
  "P3469": [
    {
      "scope": "所有汽车制造商",
      "code": "P3469",
      "zh-cn": "气缸9排气门控制 - 电路开路",
      "en-us": "Cylinder 9 Exhaust Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3466": [
    {
      "scope": "所有汽车制造商",
      "code": "P3466",
      "zh-cn": "气缸9停缸系统/进气门控制 - 性能问题",
      "en-us": "Cylinder 9 Deactivation/Intake Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3028": [
    {
      "scope": "奥迪，大众",
      "code": "P3028",
      "zh-cn": "节气门阀控制电路，传感器2 - 难以相信信号",
      "en-us": "Throttle Valve Control Circuit, Sensor 2 - Implausible Signal",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    },
    {
      "scope": "宝马",
      "code": "P3028",
      "zh-cn": "加热氧传感器 - 没有活动（第1排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 1 - No Activity",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    },
    {
      "scope": "迷你",
      "code": "P3028",
      "zh-cn": "加热氧传感器1 - 没有活动",
      "en-us": "Heated Oxygen Sensor 1 - No Activit",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3235": [
    {
      "scope": "迷你",
      "code": "P3235",
      "zh-cn": "控制模块监控 - 版本编程正常性",
      "en-us": "Control Module Monitoring - Version Coding Plausibility",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    }
  ],
  "P3473": [
    {
      "scope": "所有汽车制造商",
      "code": "P3473",
      "zh-cn": "气缸10停缸系统/进气门控制 - 电路开路",
      "en-us": "Cylinder 10 Deactivation/Intake Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3202": [
    {
      "scope": "宝马",
      "code": "P3202",
      "zh-cn": "变速器控制模块 - 控制器局域网（CAN）芯片出错",
      "en-us": "Transmission Control Module - CAN Chip Defective",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "变速器控制模块（TCM或TCU）通过收集来自各类传感器以及发动机控制模块的信息来帮助变速器决定什么时候以及如何换档，以使汽车提高性能，换档平稳，并节约燃油使用。"
    }
  ],
  "P3419": [
    {
      "scope": "所有汽车制造商",
      "code": "P3419",
      "zh-cn": "气缸3停缸系统/进气门控制 - 电路低",
      "en-us": "Cylinder 3 Deactivation/Intake Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3060": [
    {
      "scope": "沃尔沃",
      "code": "P3060",
      "zh-cn": "爆震传感器模块 - 内部错误",
      "en-us": "Knock Sensor Module - Internal Fault",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "动力总成控制模块（PCM）利用爆震传感器探测发动机转速改变时的震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。"
    }
  ],
  "P3059": [
    {
      "scope": "奥迪，大众",
      "code": "P3059",
      "zh-cn": "废气再循环（EGR）系统 - 检测到流量过大",
      "en-us": "Exhaust Gas Recirculation (EGR) System - Excessive Flow Detected.",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。"
    }
  ],
  "P3461": [
    {
      "scope": "所有汽车制造商",
      "code": "P3461",
      "zh-cn": "气缸8排气门控制 - 电路开路",
      "en-us": "Cylinder 8 Exhaust Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P316B": [
    {
      "scope": "迷你",
      "code": "P316B",
      "zh-cn": "发动机冷却液温度 - 信号电压低",
      "en-us": "Engine Coolant Temperature - Signal Voltage Low",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。"
    }
  ],
  "P3486": [
    {
      "scope": "所有汽车制造商",
      "code": "P3486",
      "zh-cn": "气缸11排气门控制 - 性能问题",
      "en-us": "Cylinder 11 Exhaust Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3421": [
    {
      "scope": "所有汽车制造商",
      "code": "P3421",
      "zh-cn": "气缸3排气门控制 - 电路开路",
      "en-us": "Cylinder 3 Exhaust Valve Control Circuit Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3331": [
    {
      "scope": "奥迪，大众",
      "code": "P3331",
      "zh-cn": "进气歧管翻板电机2 - 故障",
      "en-us": "Intake Manifold Flap Motor 2 - Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "进气歧管通路控制（IMRC）总成位于进气歧管和气缸盖之间。为提高发动机性能，每个气缸对应两个进气通路，其中之一一直开通，另一个仅当转速高于一定值（比如说3000RPM）的时候才打开。IMRC执行电机的作用是根据电子控制单元（ECU）的指令开/关进气通路的阀门翻板。"
    }
  ],
  "P3090": [
    {
      "scope": "迷你",
      "code": "P3090",
      "zh-cn": "燃油管路压力，流速控制 - 最低压力不正确",
      "en-us": "Fuel Rail Pressure, Flow Rate Contol - Minimum Pressure Incorrect",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。"
    }
  ],
  "P3477": [
    {
      "scope": "所有汽车制造商",
      "code": "P3477",
      "zh-cn": "气缸10排气门控制 - 电路开路",
      "en-us": "Cylinder 10 Exhaust Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3137": [
    {
      "scope": "克莱斯勒，道奇，吉普",
      "code": "P3137",
      "zh-cn": "微粒过滤器 - 信号太低",
      "en-us": "Particulate Filter - Signal Low",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "柴油机微粒过滤器（DPF）的作用是除掉柴油机尾气中的颗粒污染物和烟尘。柴油机微粒过滤器（DPF）一般分为可再生和不可再生两种。可再生微粒过滤器一般通过高温或利用氮氧化物氧化颗粒的方式来再生过滤器。"
    }
  ],
  "P3494": [
    {
      "scope": "所有汽车制造商",
      "code": "P3494",
      "zh-cn": "气缸12排气门控制 - 性能问题",
      "en-us": "Cylinder 12 Exhaust Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3407": [
    {
      "scope": "所有汽车制造商",
      "code": "P3407",
      "zh-cn": "气缸1排气门控制 - 电路低",
      "en-us": "Cylinder 1 Exhaust Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3016": [
    {
      "scope": "奥迪，大众",
      "code": "P3016",
      "zh-cn": "燃油旁通阀 - 开路/短路到负极",
      "en-us": "Fuel Bypass Valve - Open Circuit/Short to Ground",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    },
    {
      "scope": "宝马",
      "code": "P3016",
      "zh-cn": "加热氧传感器 - 校准故障（第1排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 1 - Calibration Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    },
    {
      "scope": "迷你",
      "code": "P3016",
      "zh-cn": "加热氧传感器1 - 校准故障",
      "en-us": "Heated Oxygen Sensor 1 - Calibration Fault",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3474": [
    {
      "scope": "所有汽车制造商",
      "code": "P3474",
      "zh-cn": "气缸10停缸系统/进气门控制 - 性能问题",
      "en-us": "Cylinder 10 Deactivation/Intake Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3450": [
    {
      "scope": "所有汽车制造商",
      "code": "P3450",
      "zh-cn": "气缸7停缸系统/进气门控制 - 性能问题",
      "en-us": "Cylinder 7 Deactivation/Intake Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3443": [
    {
      "scope": "奔驰",
      "code": "P3443",
      "zh-cn": "加热氧传感器3 - 检测不到活动",
      "en-us": "Heated Oxygen Sensor 3 - No Activity Detected",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    },
    {
      "scope": "所有汽车制造商",
      "code": "P3443",
      "zh-cn": "气缸6停缸系统/进气门控制 - 电路低",
      "en-us": "Cylinder 6 Deactivation/Intake Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3410": [
    {
      "scope": "所有汽车制造商",
      "code": "P3410",
      "zh-cn": "气缸2停缸系统/进气门控制 - 性能问题",
      "en-us": "Cylinder 2 Deactivation/Intake Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    },
    {
      "scope": "沃尔沃",
      "code": "P3410",
      "zh-cn": "凸轮轴位置（CMP）传感器，排气端 - 信号错误",
      "en-us": "Camshaft Position (CMP) Sensor, Exhaust - Signal Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。"
    }
  ],
  "P3232": [
    {
      "scope": "迷你",
      "code": "P3232",
      "zh-cn": "控制模块监控 - 点火正时正常性",
      "en-us": "Control Module Monitoring - Ignition Timing Plausibility",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    }
  ],
  "P3058": [
    {
      "scope": "奥迪，大众",
      "code": "P3058",
      "zh-cn": "废气再循环（EGR）系统 - 检测到流量不足",
      "en-us": "Exhaust Gas Recirculation (EGR) System - Insufficient Flow Detected.",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "废气再循环（EGR）系统的作用是在发动机高负荷运转时将少量的废气导入进气歧管。这些废气的存在降低了燃烧室的温度和压力，从而减少了氧化氮污染物的排放。"
    }
  ],
  "P305D": [
    {
      "scope": "沃尔沃",
      "code": "P305D",
      "zh-cn": "爆震传感器模块 - 内部错误",
      "en-us": "Knock Sensor Module - Internal Fault",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "动力总成控制模块（PCM）利用爆震传感器探测发动机转速改变时的震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。"
    }
  ],
  "P3483": [
    {
      "scope": "所有汽车制造商",
      "code": "P3483",
      "zh-cn": "气缸11停缸系统/进气门控制 - 电路低",
      "en-us": "Cylinder 11 Deactivation/Intake Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3237": [
    {
      "scope": "奔驰",
      "code": "P3237",
      "zh-cn": "加热氧传感器3 - 检测不到活动",
      "en-us": "Heated Oxygen Sensor 3 - No Activity Detected",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    },
    {
      "scope": "迷你",
      "code": "P3237",
      "zh-cn": "控制模块监控 - 燃油修建错误",
      "en-us": "Control Module Monitoring - Fuel Trim Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    }
  ],
  "P310A": [
    {
      "scope": "沃尔沃",
      "code": "P310A",
      "zh-cn": "凸轮轴位置（CMP）传感器（CMP）-信号错误",
      "en-us": "Camshaft Position Sensor - Signal Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。"
    }
  ],
  "P3478": [
    {
      "scope": "所有汽车制造商",
      "code": "P3478",
      "zh-cn": "气缸10排气门控制 - 性能问题",
      "en-us": "Cylinder 10 Exhaust Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3436": [
    {
      "scope": "所有汽车制造商",
      "code": "P3436",
      "zh-cn": "气缸5停缸系统/进气门控制 - 电路高",
      "en-us": "Cylinder 5 Deactivation/Intake Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3019": [
    {
      "scope": "宝马",
      "code": "P3019",
      "zh-cn": "加热氧传感器 - 拉姆达控制故障（第2排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 2 - Lambda Control Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。拉姆达是空燃比的另外一种表达方法（拉姆达等于1相当于空燃比14.7：1，拉姆达越大，空燃比越稀）。"
    }
  ],
  "P3018": [
    {
      "scope": "宝马",
      "code": "P3018",
      "zh-cn": "加热氧传感器 - 拉姆达控制故障（第1排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 1 - Lambda Control Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。拉姆达是空燃比的另外一种表达方法（拉姆达等于1相当于空燃比14.7：1，拉姆达越大，空燃比越稀）。"
    },
    {
      "scope": "迷你",
      "code": "P3018",
      "zh-cn": "加热氧传感器1 - 拉姆达控制故障",
      "en-us": "Heated Oxygen Sensor 1 - Lambda Control Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。拉姆达是空燃比的另外一种表达方法（拉姆达等于1相当于空燃比14.7：1，拉姆达越大，空燃比越稀）。"
    }
  ],
  "P3429": [
    {
      "scope": "所有汽车制造商",
      "code": "P3429",
      "zh-cn": "气缸4排气门控制 - 电路开路",
      "en-us": "Cylinder 4 Exhaust Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3032": [
    {
      "scope": "奥迪，大众",
      "code": "P3032",
      "zh-cn": "节气门阀控制模块2 - 基本设置故障",
      "en-us": "Throttle Valve Control Module 2 - Basic Setting Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    },
    {
      "scope": "迷你",
      "code": "P3032",
      "zh-cn": "加热氧传感器1 - 难以相信的信号",
      "en-us": "Heated Oxygen Sensor 1 - Implausible Signal",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3455": [
    {
      "scope": "所有汽车制造商",
      "code": "P3455",
      "zh-cn": "气缸7排气门控制 - 电路低",
      "en-us": "Cylinder 7 Exhaust Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P340A": [
    {
      "scope": "沃尔沃",
      "code": "P340A",
      "zh-cn": "爆震传感器 - 范围/性能",
      "en-us": "Knock Sensor - Range/Performance",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "动力总成控制模块（PCM）利用爆震传感器探测发动机转速改变时的震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。"
    }
  ],
  "P342B": [
    {
      "scope": "沃尔沃",
      "code": "P342B",
      "zh-cn": "凸轮轴位置（CMP）传感器，排气端 - 信号丢失",
      "en-us": "Camshaft Position (CMP) Sensor - Signal Missing",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。"
    }
  ],
  "P3025": [
    {
      "scope": "奥迪，大众",
      "code": "P3025",
      "zh-cn": "节气门阀控制电路，传感器1 - 难以相信信号",
      "en-us": "Throttle Valve Control Circuit, Sensor 1 - Implausible Signal",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    },
    {
      "scope": "宝马",
      "code": "P3025",
      "zh-cn": "加热氧传感器 - 起始化故障（第2排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 2 - Initialization Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3444": [
    {
      "scope": "所有汽车制造商",
      "code": "P3444",
      "zh-cn": "气缸6停缸系统/进气门控制 - 电路高",
      "en-us": "Cylinder 6 Deactivation/Intake Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P341D": [
    {
      "scope": "沃尔沃",
      "code": "P341D",
      "zh-cn": "凸轮轴位置（CMP）传感器，排气端 - 信号太低",
      "en-us": "Camshaft Position (CMP) Sensor, Exhaust - Signal Low",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。"
    }
  ],
  "P3241": [
    {
      "scope": "迷你",
      "code": "P3241",
      "zh-cn": "发动机冷却液节温器控制电路 - 信号低",
      "en-us": "Engine Coolant Thermostat Control Circuit - Signal Low",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "节温器的作用是在发动机预热之前阻止冷却液循环。直到发动机到达工作温度（一般是80-95摄氏度），节温器才会打开。通过让发动机迅速预热，节温器有效地降低了发动机磨损，碳残留，和污染物排放。"
    }
  ],
  "P3104": [
    {
      "scope": "奥迪，大众",
      "code": "P3104",
      "zh-cn": "进气歧管空气控制电磁阀 - 短路到正极",
      "en-us": "Intake Manifold Air Control Solenoid - Short to Positive",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "进气歧管空气控制（IMAC）总成位于进气歧管和气缸盖之间。为提高发动机性能，每个气缸对应两个进气通路，其中之一一直开通，另一个仅当转速高于一定值（比如说3000RPM）的时候才打开。IMAC执行电机的作用是根据电子控制单元（ECU）的指令开/关进气通路的阀门翻板。"
    }
  ],
  "P3218": [
    {
      "scope": "迷你",
      "code": "P3218",
      "zh-cn": "控制器局域网数据连线监控 - 信号故障",
      "en-us": "CAN Data Bus Monitoring - Signal Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。"
    }
  ],
  "P3034": [
    {
      "scope": "奥迪，大众",
      "code": "P3034",
      "zh-cn": "进气温度（IAT）传感器2 - 高输入",
      "en-us": "Intake Air Temperature (IAT) Sensor 2 -High Input",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。"
    },
    {
      "scope": "迷你",
      "code": "P3034",
      "zh-cn": "加热氧传感器1 - 信号太低",
      "en-us": "Heated Oxygen Sensor 1 - Signal Too Low",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3030": [
    {
      "scope": "奥迪，大众",
      "code": "P3030",
      "zh-cn": "节气门阀控制电路，传感器2 - 信号太高",
      "en-us": "Throttle Valve Control Circuit, Sensor 2 - Signal High",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    },
    {
      "scope": "迷你",
      "code": "P3030",
      "zh-cn": "加热氧传感器1 - 适应值太高",
      "en-us": "Heated Oxygen Sensor 1 - Adaptation Value Too High",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3010": [
    {
      "scope": "奥迪，大众",
      "code": "P3010",
      "zh-cn": "燃油冷却泵继电器 - 开路/短路到负极",
      "en-us": "Fuel Cooling Pump Relay - Open Circuit/Short to Ground",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    },
    {
      "scope": "宝马",
      "code": "P3010",
      "zh-cn": "加热氧传感器 - 冷车启动以后低输入（第1排第2个）",
      "en-us": "Heated Oxygen Sensor 2, Bank 1 - Low Input After Cold Start",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    },
    {
      "scope": "沃尔沃",
      "code": "P3010",
      "zh-cn": "凸轮轴位置（CMP）传感器（CMP），排气端 - 信号错误",
      "en-us": "Camshaft Position (CMP) Sensor, Exhuast - Signal Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。"
    },
    {
      "scope": "迷你",
      "code": "P3010",
      "zh-cn": "加热氧传感器2 - 冷启动后低输入",
      "en-us": "Heated Oxygen Sensor 2 - Low Input After Cold Start",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3415": [
    {
      "scope": "所有汽车制造商",
      "code": "P3415",
      "zh-cn": "气缸2排气门控制 - 电路低",
      "en-us": "Cylinder 2 Exhaust Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3136": [
    {
      "scope": "克莱斯勒，道奇，吉普",
      "code": "P3136",
      "zh-cn": "微粒过滤器 - 信号太高",
      "en-us": "Particulate Filter - Signal High",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "柴油机微粒过滤器（DPF）的作用是除掉柴油机尾气中的颗粒污染物和烟尘。柴油机微粒过滤器（DPF）一般分为可再生和不可再生两种。可再生微粒过滤器一般通过高温或利用氮氧化物氧化颗粒的方式来再生过滤器。"
    }
  ],
  "P3485": [
    {
      "scope": "所有汽车制造商",
      "code": "P3485",
      "zh-cn": "气缸11排气门控制 - 电路开路",
      "en-us": "Cylinder 11 Exhaust Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3081": [
    {
      "scope": "奥迪，大众",
      "code": "P3081",
      "zh-cn": "发动机温度过低",
      "en-us": "Engine Temperature Too Low",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    }
  ],
  "P3458": [
    {
      "scope": "所有汽车制造商",
      "code": "P3458",
      "zh-cn": "气缸8停缸系统/进气门控制 - 性能问题",
      "en-us": "Cylinder 8 Deactivation/Intake Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3400": [
    {
      "scope": "所有汽车制造商",
      "code": "P3400",
      "zh-cn": "气缸停缸系统 （第1排）",
      "en-us": "Cylinder Deactivation System (Bank 1)",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。"
    },
    {
      "scope": "沃尔沃",
      "code": "P3400",
      "zh-cn": "凸轮轴位置（CMP）传感器（CMP），进气端 - 信号错误 - 信号错误",
      "en-us": "Camshaft Position (CMP) Sensor, Intake - Signal Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。"
    },
    {
      "scope": "沃尔沃",
      "code": "P3400",
      "zh-cn": "爆震传感器 - 信号错误",
      "en-us": "Knock Sensor - Signal Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "动力总成控制模块（PCM）利用爆震传感器探测发动机转速改变时的震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。"
    }
  ],
  "P3418": [
    {
      "scope": "所有汽车制造商",
      "code": "P3418",
      "zh-cn": "气缸3停缸系统/进气门控制 - 性能问题",
      "en-us": "Cylinder 3 Deactivation/Intake Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3259": [
    {
      "scope": "迷你",
      "code": "P3259",
      "zh-cn": "控制模块监控 - 燃油流量/进气流量/拉姆达控制阀， 信号相关性",
      "en-us": "Control Module Monitoring - Fuel Quantity/Air Volume/Lambda Control Valve, Signal Correlation",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "拉姆达是空燃比的另外一种表达方法（拉姆达等于1相当于空燃比14.7：1，拉姆达越大，空燃比越稀）。"
    }
  ],
  "P3240": [
    {
      "scope": "迷你",
      "code": "P3240",
      "zh-cn": "发动机冷却液节温器控制电路 - 开路",
      "en-us": "Engine Coolant Thermostat Control Circuit - Open Circuit",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "节温器的作用是在发动机预热之前阻止冷却液循环。直到发动机到达工作温度（一般是80-95摄氏度），节温器才会打开。通过让发动机迅速预热，节温器有效地降低了发动机磨损，碳残留，和污染物排放。"
    }
  ],
  "P3236": [
    {
      "scope": "迷你",
      "code": "P3236",
      "zh-cn": "控制模块监控 - 喷射持续时间/燃油量正常性",
      "en-us": "Control Module Monitoring - Injection Duration/Fuel Quantity Plausibility",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    }
  ],
  "P3437": [
    {
      "scope": "所有汽车制造商",
      "code": "P3437",
      "zh-cn": "气缸5排气门控制 - 电路开路",
      "en-us": "Cylinder 5 Exhaust Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P311D": [
    {
      "scope": "沃尔沃",
      "code": "P311D",
      "zh-cn": "检测到失火，气缸1",
      "en-us": "Misfire Detected, Cylinder 1",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。"
    }
  ],
  "P323C": [
    {
      "scope": "宝马",
      "code": "P323C",
      "zh-cn": "外围压力传感器 - 对比电流不正确",
      "en-us": "Ambient Pressure Sensor - Comparison Current Incorrect",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "外围压力传感器的作用是将大气压力以电信号的形式输送给电子控制模块。动力总成控制模块（PCM）根据进气歧管压力与大气压力之间的差值（跟发动机负荷成线性关系）修正燃油供给，以帮助发动机在不同负荷下达到最佳空燃比。"
    },
    {
      "scope": "迷你",
      "code": "P323C",
      "zh-cn": "大气压力（BARO）传感器 - 电路故障",
      "en-us": "Barometric Pressure Sensor - Circuit Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "大气压力传感器（有时候也叫高海拔补偿器，HAC）的作用是将大气压力以电信号的形式输送给电子控制模块。大气压力会随天气和海拔高度的变化而变化。压力越小，空气越稀薄。动力总成控制模块（PCM）会根据大气压力的数值来修正燃油供给，以帮助发动机达到最佳空燃比。"
    }
  ],
  "P3203": [
    {
      "scope": "宝马",
      "code": "P3203",
      "zh-cn": "局部控制器局域网（CAN）数据连线 - 故障",
      "en-us": "Local CAN Data Bus - Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。"
    },
    {
      "scope": "迷你",
      "code": "P3203",
      "zh-cn": "控制器局域网数据连线 - 故障",
      "en-us": "CAN Data Bus - Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。"
    }
  ],
  "P340B": [
    {
      "scope": "沃尔沃",
      "code": "P340B",
      "zh-cn": "凸轮轴位置（CMP）传感器，进气端 - 信号丢失",
      "en-us": "Camshaft Position (CMP) Sensor, Intake - Signal Missing",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。"
    }
  ],
  "P3337": [
    {
      "scope": "迷你",
      "code": "P3337",
      "zh-cn": "拉姆达控制 - 难以相信的信号",
      "en-us": "Lambda Control - Implausible signal",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "拉姆达是空燃比的另外一种表达方法（拉姆达等于1相当于空燃比14.7：1，拉姆达越大，空燃比越稀）。"
    }
  ],
  "P3131": [
    {
      "scope": "克莱斯勒，道奇，吉普",
      "code": "P3131",
      "zh-cn": "氧传感器 - 电路故障（第1排第1个）",
      "en-us": "Oxygen Sensor 1, Bank 1 - Circuit Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3492": [
    {
      "scope": "所有汽车制造商",
      "code": "P3492",
      "zh-cn": "气缸12停缸系统/进气门控制 - 电路高",
      "en-us": "Cylinder 12 Deactivation/Intake Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P310D": [
    {
      "scope": "沃尔沃",
      "code": "P310D",
      "zh-cn": "启动过程中检测到失火",
      "en-us": "Misfire Detected During Start-up",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。"
    },
    {
      "scope": "沃尔沃",
      "code": "P310D",
      "zh-cn": "凸轮轴位置（CMP）传感器 - 信号错误",
      "en-us": "Crankshaft Position (CKP) Sensor - Signal Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。曲轴位置（CKP）传感器(也叫上止点传感器），其作用是检测上止点（TDC）信号、曲轴转角信号和发动机转速信号，并将其输入计算机，从而使计算机能按气缸的点火顺序发出最佳点火时刻指令。"
    }
  ],
  "P313D": [
    {
      "scope": "沃尔沃",
      "code": "P313D",
      "zh-cn": "检测到失火，气缸3",
      "en-us": "Misfire Detected, Cylinder 3",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。"
    }
  ],
  "P311C": [
    {
      "scope": "沃尔沃",
      "code": "P311C",
      "zh-cn": "检测到失火，气缸1 - 催化箱破坏",
      "en-us": "Misfire Detected, Cylinder 1 - catalyst Damage",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。"
    }
  ],
  "P316A": [
    {
      "scope": "迷你",
      "code": "P316A",
      "zh-cn": "发动机冷却液温度 - 信号故障",
      "en-us": "Engine Coolant Temperature - Signal Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。"
    }
  ],
  "P3003": [
    {
      "scope": "奥迪，大众",
      "code": "P3003",
      "zh-cn": "发动机冷却液加热器继电器1 - 低输出",
      "en-us": "Engine Coolant Heater Relay 1 - Low Output",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    },
    {
      "scope": "迷你",
      "code": "P3003",
      "zh-cn": "燃油管路压力，流速控制 - 压力太高",
      "en-us": "Fuel Rail Pressure, Flow Rate Control - Pressure Too High",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。"
    }
  ],
  "P315D": [
    {
      "scope": "沃尔沃",
      "code": "P315D",
      "zh-cn": "检测到失火，气缸5",
      "en-us": "Misfire Detected, Cylinder 5",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。"
    }
  ],
  "P3258": [
    {
      "scope": "迷你",
      "code": "P3258",
      "zh-cn": "发动机控制模块 - 内部错误",
      "en-us": "Engine Control Module - Internal Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P3328": [
    {
      "scope": "奥迪，大众",
      "code": "P3328",
      "zh-cn": "进气歧管翻板电机2 - 短路到正极",
      "en-us": "Intake Manifold Flap Motor 2 - Short to Postive",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "进气歧管通路控制（IMRC）总成位于进气歧管和气缸盖之间。为提高发动机性能，每个气缸对应两个进气通路，其中之一一直开通，另一个仅当转速高于一定值（比如说3000RPM）的时候才打开。IMRC执行电机的作用是根据电子控制单元（ECU）的指令开/关进气通路的阀门翻板。"
    }
  ],
  "P3096": [
    {
      "scope": "奥迪，大众",
      "code": "P3096",
      "zh-cn": "发动机控制模块（ECM）- 内部错误",
      "en-us": "Engine Control Module (ECM) - Internal Fault",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P3430": [
    {
      "scope": "所有汽车制造商",
      "code": "P3430",
      "zh-cn": "气缸4排气门控制 - 性能问题",
      "en-us": "Cylinder 4 Exhaust Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P310B": [
    {
      "scope": "奥迪、大众",
      "code": "P310B",
      "zh-cn": "燃油低压调节，燃油压力超出于范围",
      "en-us": "Low Pressure Fuel regulation: Fuel Pressure Outside Specification",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    }
  ],
  "P3238": [
    {
      "scope": "奔驰",
      "code": "P3238",
      "zh-cn": "加热氧传感器3 - 短路到接地",
      "en-us": "Heated Oxygen Sensor 3 - Short to Ground",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    },
    {
      "scope": "宝马",
      "code": "P3238",
      "zh-cn": "电子控制模块（ECM）自检 - TPU故障",
      "en-us": "ECM Self-test -TPU Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    },
    {
      "scope": "迷你",
      "code": "P3238",
      "zh-cn": "电子控制模块（ECM）自检 - 时间处理器单元故障",
      "en-us": "ECM Self-test - Time Processor Unit Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P3134": [
    {
      "scope": "克莱斯勒，道奇，吉普",
      "code": "P3134",
      "zh-cn": "氧传感器 - 电源电压",
      "en-us": "Oxygen Sensor - Supply Voltage",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P330B": [
    {
      "scope": "沃尔沃",
      "code": "P330B",
      "zh-cn": "曲轴位置（CKP）传感器 - 信号丢失",
      "en-us": "Crankshaft Position (CKP) Sensor - Signal Missing",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "曲轴的作用是将活塞的的上下运动变成旋转运动。曲轴位置（CKP）传感器(也叫上止点传感器），其作用是检测上止点（TDC）信号、曲轴转角信号和发动机转速信号，并将其输入计算机，从而使计算机能按气缸的点火顺序发出最佳点火时刻指令。"
    }
  ],
  "P3408": [
    {
      "scope": "所有汽车制造商",
      "code": "P3408",
      "zh-cn": "气缸1排气门控制 - 电路高",
      "en-us": "Cylinder 1 Exhaust Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3007": [
    {
      "scope": "奥迪，大众",
      "code": "P3007",
      "zh-cn": "凸轮轴位置（CMP）传感器（CMP）- 没有信号",
      "en-us": "Camshaft Position (CMP) Sensor - No Signal",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。"
    },
    {
      "scope": "迷你",
      "code": "P3007",
      "zh-cn": "燃油管路压力，压力控制 - 超出最大压力",
      "en-us": "Fuel Rail Pressure, Pressure Control - Maximum Pressure Exceeded",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。"
    }
  ],
  "P3404": [
    {
      "scope": "所有汽车制造商",
      "code": "P3404",
      "zh-cn": "气缸1停缸系统/进气门控制 - 电路高",
      "en-us": "Cylinder 1 Deactivation/Intake Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P316C": [
    {
      "scope": "迷你",
      "code": "P316C",
      "zh-cn": "发动机冷却液温度（ECT）传感器，冷却水箱出口 - 难以相信信号",
      "en-us": "Engine Coolant Temperature Sensor, Radiator Outlet - Implausible Signal",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "发动机冷却液温度（ECT）传感器通过热敏电阻的原理将发动机冷却液的温度以电信号的形式传输给电子控制单元（ECU），作为修正喷油和点火的一个依据。"
    }
  ],
  "P314C": [
    {
      "scope": "沃尔沃",
      "code": "P314C",
      "zh-cn": "检测到失火，气缸4 - 催化箱破坏",
      "en-us": "Misfire Detected, Cylinder 4 - catalyst Damage",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。"
    }
  ],
  "P3008": [
    {
      "scope": "奥迪，大众",
      "code": "P3008",
      "zh-cn": "凸轮轴位置（CMP）传感器（CMP）- 超出信号极限",
      "en-us": "Camshaft Position (CMP) Sensor - Signal Limit Exceeded",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。"
    },
    {
      "scope": "迷你",
      "code": "P3008",
      "zh-cn": "加热氧传感器1 - 冷启动后低输入",
      "en-us": "Heated Oxygen Sensor 1 - Low Input After Cold Start",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3011": [
    {
      "scope": "奥迪，大众",
      "code": "P3011",
      "zh-cn": "燃油泵继电器1/2 - 短路到正极",
      "en-us": "Fuel Pump Relay 1/2 - Shor to Positive",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    },
    {
      "scope": "宝马",
      "code": "P3011",
      "zh-cn": "加热氧传感器 - 冷车启动以后低输入（第2排第2个）",
      "en-us": "Heated Oxygen Sensor 2, Bank 2 - Low Input After Cold Start",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3497": [
    {
      "scope": "所有汽车制造商",
      "code": "P3497",
      "zh-cn": "气缸停缸系统 （第2排）",
      "en-us": "Cylinder Deactivation System (Bank 2)",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。"
    }
  ],
  "P321E": [
    {
      "scope": "宝马",
      "code": "P321E",
      "zh-cn": "外围压力传感器 - 最高压力不正确",
      "en-us": "Ambient Pressure Sensor - Maximum Pressure Incorrect",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "外围压力传感器的作用是将大气压力以电信号的形式输送给电子控制模块。动力总成控制模块（PCM）根据进气歧管压力与大气压力之间的差值（跟发动机负荷成线性关系）修正燃油供给，以帮助发动机在不同负荷下达到最佳空燃比。"
    },
    {
      "scope": "迷你",
      "code": "P321E",
      "zh-cn": "大气压力（BARO）传感器 - 最大压力不正确",
      "en-us": "Barometric Pressure Sensor - Maximum Pressure Incorrect",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "大气压力传感器（有时候也叫高海拔补偿器，HAC）的作用是将大气压力以电信号的形式输送给电子控制模块。大气压力会随天气和海拔高度的变化而变化。压力越小，空气越稀薄。动力总成控制模块（PCM）会根据大气压力的数值来修正燃油供给，以帮助发动机达到最佳空燃比。"
    }
  ],
  "P3340": [
    {
      "scope": "沃尔沃",
      "code": "P3340",
      "zh-cn": "点火线圈，气缸4 - 信号错误",
      "en-us": "Ignition Coil , Cylinder 4 - Signal Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。"
    }
  ],
  "P3454": [
    {
      "scope": "所有汽车制造商",
      "code": "P3454",
      "zh-cn": "气缸7排气门控制 - 性能问题",
      "en-us": "Cylinder 7 Exhaust Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3310": [
    {
      "scope": "沃尔沃",
      "code": "P3310",
      "zh-cn": "点火线圈，气缸1 - 信号错误",
      "en-us": "Ignition Coil , Cylinder 1 - Signal Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。"
    }
  ],
  "P3006": [
    {
      "scope": "迷你",
      "code": "P3006",
      "zh-cn": "燃油管路压力，压力控制 - 压力太高",
      "en-us": "Fuel Rail Pressure, Pressure Control - Pressure Too High",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。"
    }
  ],
  "P3428": [
    {
      "scope": "所有汽车制造商",
      "code": "P3428",
      "zh-cn": "气缸4停缸系统/进气门控制 - 电路高",
      "en-us": "Cylinder 4 Deactivation/Intake Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3402": [
    {
      "scope": "所有汽车制造商",
      "code": "P3402",
      "zh-cn": "气缸1停缸系统/进气门控制 - 性能问题",
      "en-us": "Cylinder 1 Deactivation/Intake Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3457": [
    {
      "scope": "所有汽车制造商",
      "code": "P3457",
      "zh-cn": "气缸8停缸系统/进气门控制 - 电路开路",
      "en-us": "Cylinder 8 Deactivation/Intake Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3110": [
    {
      "scope": "沃尔沃",
      "code": "P3110",
      "zh-cn": "启动过程中检测到失火 - 气缸1",
      "en-us": "Misfire Detected During Start up - Cylinder 1",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。"
    }
  ],
  "P3130": [
    {
      "scope": "沃尔沃",
      "code": "P3130",
      "zh-cn": "启动过程中检测到失火 - 气缸3",
      "en-us": "Misfire Detected During Start up - Cylinder 3",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。"
    }
  ],
  "P3451": [
    {
      "scope": "所有汽车制造商",
      "code": "P3451",
      "zh-cn": "气缸7停缸系统/进气门控制 - 电路低",
      "en-us": "Cylinder 7 Deactivation/Intake Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P301A": [
    {
      "scope": "沃尔沃",
      "code": "P301A",
      "zh-cn": "凸轮轴位置（CMP）传感器（CMP），排气端 - 信号错误",
      "en-us": "Camshaft Position (CMP) Sensor, Exhuast - Signal Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "凸轮轴的作用是控制气门的开启和闭合。可变气门正时系统中，电子凸轮轴调节阀（或机油控制阀，OCV）根据来自发动机控制模块（ECM）的指令通过改变到凸轮轴调节器（机械式）的机油压力的方式来调整凸轮轴的角度，以确保气门在最佳时间打开和关闭。凸轮轴位置（CMP）传感器的作用是将凸轮轴位置（气门的相对位置）以电压信号的形式传输给电子控制单元（ECU）。"
    }
  ],
  "P305C": [
    {
      "scope": "沃尔沃",
      "code": "P305C",
      "zh-cn": "爆震传感器模块 - 内部错误",
      "en-us": "Knock Sensor Module - Internal Fault",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "动力总成控制模块（PCM）利用爆震传感器探测发动机转速改变时的震动。爆震传感器然后会将这个震动以电压的形式表达出来。必要的时候电子控制模块（ECU）会通过延迟点火等来避免爆震发生。"
    }
  ],
  "P3465": [
    {
      "scope": "所有汽车制造商",
      "code": "P3465",
      "zh-cn": "气缸9停缸系统/进气门控制 - 电路开路",
      "en-us": "Cylinder 9 Deactivation/Intake Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3427": [
    {
      "scope": "所有汽车制造商",
      "code": "P3427",
      "zh-cn": "气缸4停缸系统/进气门控制 - 电路低",
      "en-us": "Cylinder 4 Deactivation/Intake Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3424": [
    {
      "scope": "所有汽车制造商",
      "code": "P3424",
      "zh-cn": "气缸3排气门控制 - 电路高",
      "en-us": "Cylinder 3 Exhaust Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3004": [
    {
      "scope": "迷你",
      "code": "P3004",
      "zh-cn": "燃油管路压力，流速控制 - 超出最大压力",
      "en-us": "Fuel Rail Pressure, Flow Rate Control - Maximum Pressure Exceeded",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。"
    }
  ],
  "P3339": [
    {
      "scope": "奥迪，大众",
      "code": "P3339",
      "zh-cn": "电热塞计时器继电器2 - 电路故障",
      "en-us": "Glow Plug Timer Relay 2 - Circuit Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "电热塞的作用是通过电热线圈对柴油机燃烧室压缩气体加热，从使柴油机在天冷时容易启动。电热塞控制模块可以将电热塞的预热和循环过程自动化。"
    }
  ],
  "P3330": [
    {
      "scope": "奥迪，大众",
      "code": "P3330",
      "zh-cn": "进气歧管翻板电机2 - 没有信号",
      "en-us": "Intake Manifold Flap Motor 2 - No Signal",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "进气歧管通路控制（IMRC）总成位于进气歧管和气缸盖之间。为提高发动机性能，每个气缸对应两个进气通路，其中之一一直开通，另一个仅当转速高于一定值（比如说3000RPM）的时候才打开。IMRC执行电机的作用是根据电子控制单元（ECU）的指令开/关进气通路的阀门翻板。"
    },
    {
      "scope": "沃尔沃",
      "code": "P3330",
      "zh-cn": "点火线圈，气缸3 - 信号错误",
      "en-us": "Ignition Coil , Cylinder 3 - Signal Error",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "点火线圈的作用是将汽车电池的12伏电压转化成火花塞点火需要的的几千甚至几万伏电压。点火线圈里面有两组线圈，初级线圈和次级线圈。初级线圈有较粗的漆包线，匝数较少；次级线圈用较细的漆包线，匝数相对较多。当初级线圈接通电源时，随着电流的增长四周产生一个很强的磁场，铁芯储存了磁场能；当开关装置使初级线圈电路断开时，初级线圈的磁场迅速衰减，次级线圈就会感应出很高的电压。"
    }
  ],
  "P3414": [
    {
      "scope": "所有汽车制造商",
      "code": "P3414",
      "zh-cn": "气缸2排气门控制 - 性能问题",
      "en-us": "Cylinder 2 Exhaust Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3412": [
    {
      "scope": "所有汽车制造商",
      "code": "P3412",
      "zh-cn": "气缸2停缸系统/进气门控制 - 电路高",
      "en-us": "Cylinder 2 Deactivation/Intake Valve Control Circuit High",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3462": [
    {
      "scope": "所有汽车制造商",
      "code": "P3462",
      "zh-cn": "气缸8排气门控制 - 性能问题",
      "en-us": "Cylinder 8 Exhaust Valve Control Performance",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3027": [
    {
      "scope": "奥迪，大众",
      "code": "P3027",
      "zh-cn": "节气门阀控制电路，传感器1 - 信号太高",
      "en-us": "Throttle Valve Control Circuit, Sensor 1 - Signal High",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    },
    {
      "scope": "宝马",
      "code": "P3027",
      "zh-cn": "加热氧传感器 - 操作温度故障（第2排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 2 - Operating Temperature Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3283": [
    {
      "scope": "迷你",
      "code": "P3283",
      "zh-cn": "燃油管路压力传感器 - 燃油流量信号超出正常范围",
      "en-us": "Fuel Rail Pressure Sensor - Fuel Volume Signal Out of Range",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "燃油压力调节器利用一个弹簧推动的阀门，将多余汽油流回油箱，从而保持油路内的压力恒定。燃油压力调节器上有一根与进气歧管相连的真空管，以在不同的发动机运行状况下（根据真空度判断发动机负载）提供相应的汽油压力。大部分汽车的燃油压力调机器都位于燃油分供管上，但也有些汽车的燃油压力调节器位于油箱之内。燃油压力传感器负责测量喷油器附近的燃油压力。电子控制单元（ECU）使用这个信号来调整喷油器脉冲宽度和测量进入燃烧室的燃油量。"
    }
  ],
  "P3245": [
    {
      "scope": "奔驰",
      "code": "P3245",
      "zh-cn": "加热氧传感器3 - 短路到接地",
      "en-us": "Heated Oxygen Sensor 3 - Short to Ground",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3093": [
    {
      "scope": "奥迪，大众",
      "code": "P3093",
      "zh-cn": "发动机控制模块（ECM）- 内部错误",
      "en-us": "Engine Control Module (ECM) - Internal Fault",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "发动机控制模块，也叫发动机控制单元（有些车上发动机控制模块跟变速器控制模块被集成在一起成为动力总成控制模块），控制整个发动机的运转。其最主要的作用就是控制发动机的最佳喷油量及点火时机。另一个重要作用是负责监控尾气排放控制的部件。"
    }
  ],
  "P3481": [
    {
      "scope": "所有汽车制造商",
      "code": "P3481",
      "zh-cn": "气缸11停缸系统/进气门控制 - 电路开路",
      "en-us": "Cylinder 11 Deactivation/Intake Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3405": [
    {
      "scope": "所有汽车制造商",
      "code": "P3405",
      "zh-cn": "气缸1排气门控制 - 电路开路",
      "en-us": "Cylinder 1 Exhaust Valve Control Circuit Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3242": [
    {
      "scope": "迷你",
      "code": "P3242",
      "zh-cn": "发动机冷却液节温器控制电路 - 信号高",
      "en-us": "Engine Coolant Thermostat Control Circuit - Signal High",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "节温器的作用是在发动机预热之前阻止冷却液循环。直到发动机到达工作温度（一般是80-95摄氏度），节温器才会打开。通过让发动机迅速预热，节温器有效地降低了发动机磨损，碳残留，和污染物排放。"
    }
  ],
  "P3229": [
    {
      "scope": "迷你",
      "code": "P3229",
      "zh-cn": "负荷传感器监控 - 可变气门正时（VVT）正常性",
      "en-us": "Load Sensor Monitoring - VVT Plausibility",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    }
  ],
  "P3155": [
    {
      "scope": "克莱斯勒，道奇，吉普",
      "code": "P3155",
      "zh-cn": "进气温度（IAT）传感器 - 信号太低",
      "en-us": "Intake Air Temperature (IAT) Sensor - Signal Low",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。"
    }
  ],
  "P321D": [
    {
      "scope": "迷你",
      "code": "P321D",
      "zh-cn": "控制器局域网数据连线监控 - 故障",
      "en-us": "CAN Data Bus Monitoring - Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。"
    }
  ],
  "P3012": [
    {
      "scope": "奥迪，大众",
      "code": "P3012",
      "zh-cn": "燃油泵继电器1/2 - 开路/短路到负极",
      "en-us": "Fuel Pump Relay 1/2 - Open Circuit/Short to Ground",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": ""
    },
    {
      "scope": "宝马",
      "code": "P3012",
      "zh-cn": "加热氧传感器 - 适应值太高（第1排第1个）",
      "en-us": "Heated Oxygen Sensor 1, Bank 1 - Adaptation Value Too High",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    },
    {
      "scope": "迷你",
      "code": "P3012",
      "zh-cn": "加热氧传感器1 - 适应值太高",
      "en-us": "Heated Oxygen Sensor 1 - Adaptation Value Too High",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "氧传感器的作用是测定发动机排气中的氧气含量，以修正喷油量，从而使发动机获得最佳空燃比。在OBD故障码中，你经常会看到第几排第几个氧传感器的说法。第1排是指气缸1所在的那个排，剩下的另外一排为第2排。不管哪一排，第1个传感器总是指上游氧传感器（催化箱之前），第2个传感器总是指下游氧传感器（催化箱之后）。"
    }
  ],
  "P3439": [
    {
      "scope": "所有汽车制造商",
      "code": "P3439",
      "zh-cn": "气缸5排气门控制 - 电路低",
      "en-us": "Cylinder 5 Exhaust Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3214": [
    {
      "scope": "宝马",
      "code": "P3214",
      "zh-cn": "控制器局域网（CAN）数据连线监控 - ETC检查故障",
      "en-us": "CAN Data Bus Monitoring - ETC Check Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    },
    {
      "scope": "宝马",
      "code": "P3214",
      "zh-cn": "控制器局域网（CAN）数据连线监控 - ETC检查故障",
      "en-us": "CAN Data Bus Monitoring - ETC Check Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    },
    {
      "scope": "迷你",
      "code": "P3214",
      "zh-cn": "控制器局域网数据连线监控 - ETC自检故障",
      "en-us": "CAN Data Bus Monitoring - ETC Self-test Malfunction",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "控制器局域网（CAN）（Controller Area Network，简称CAN或CAN bus）是一种汽车通讯协定，其特点是允许网路上的设备直接互相通讯，网路上不需要主机控制通讯。在电子节气门（ETC）系统中，电子控制模块（ECU）根据来自加速踏板位置（APP）传感器的信号以及发动机转速、车速、空调能耗等，来指令节气门位置电机使节气门开度达到最佳。"
    }
  ],
  "P3413": [
    {
      "scope": "所有汽车制造商",
      "code": "P3413",
      "zh-cn": "气缸2排气门控制 - 电路开路",
      "en-us": "Cylinder 2 Exhaust Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3120": [
    {
      "scope": "沃尔沃",
      "code": "P3120",
      "zh-cn": "启动过程中检测到失火 - 气缸2",
      "en-us": "Misfire Detected During Start up - Cylinder 2",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。"
    }
  ],
  "P3441": [
    {
      "scope": "所有汽车制造商",
      "code": "P3441",
      "zh-cn": "气缸6停缸系统/进气门控制 - 电路开路",
      "en-us": "Cylinder 6 Deactivation/Intake Valve Control Circuit/Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P3495": [
    {
      "scope": "所有汽车制造商",
      "code": "P3495",
      "zh-cn": "气缸12排气门控制 - 电路低",
      "en-us": "Cylinder 12 Exhaust Valve Control Circuit Low",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制排气阀门的电路发生故障。"
    }
  ],
  "P3401": [
    {
      "scope": "所有汽车制造商",
      "code": "P3401",
      "zh-cn": "气缸1停缸系统/进气门控制 - 电路开路",
      "en-us": "Cylinder 1 Deactivation/Intake Valve Control Circuit Open",
      "sys": "气缸停缸",
      "knowledge": "对于一些大功率的汽车，当负载很小时，节气门几近关闭，发动机需要做功来获得进气。这时候气缸的混合气压缩压力也很低，导致效率低下。气缸停缸系统通过关闭某些气缸的进气和排气阀门的方式来获得更高的发动机效率。该故障码表明控制进气阀门的电路发生故障。"
    }
  ],
  "P314D": [
    {
      "scope": "沃尔沃",
      "code": "P314D",
      "zh-cn": "检测到失火，气缸4",
      "en-us": "Misfire Detected, Cylinder 4",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "气缸失火是指发动机工作过程中由于各种原因造成的混合气在气缸内不能正常燃烧的现象。"
    }
  ],
  "P3098": [
    {
      "scope": "克莱斯勒，道奇，吉普",
      "code": "P3098",
      "zh-cn": "进气温度（IAT）传感器 - 值太低",
      "en-us": "Intake Air Temperature (IAT) Sensor - Value Too Low",
      "sys": "动力总成系统（制造商自定义）",
      "knowledge": "进气温度（IAT）传感器的作用是将发动机的进气温度以电压信号的形式输送给电子控制单元（ECU），为喷油修正提供一个参考依据。"
    }
  ]
}