var cn = {
	"foxwell_local_lang": "cn",
	"11D614100000": [
		"B1000",
		"故障--驻车定位系统 N62"
	],
	"11D614124600": [
		"B1246",
		"故障--驻车定位系统前保险杠 传感器连接 外部 A42b1"
	],
	"11D614124700": [
		"B1247",
		"故障--驻车定位系统前保险杠 传感器连接 中间 A42b2"
	],
	"11D614124800": [
		"B1248",
		"故障--驻车定位系统前保险杠 传感器连接 内部 A42b3"
	],
	"11D614124900": [
		"B1249",
		"故障--驻车定位系统前保险杠 右边传感器 内部A42b4"
	],
	"11D614125000": [
		"B1250",
		"故障--驻车定位系统前保险杠 右边传感器 中间 A42b5"
	],
	"11D614125100": [
		"B1251",
		"故障--驻车定位系统前保险杠 右边传感器 外部 A42b6"
	],
	"11D614125200": [
		"B1252",
		"故障--驻车定位系统后保险杠 右边传感器 外部A43b7"
	],
	"11D614125300": [
		"B1253",
		"故障--驻车定位系统后保险杠 右边传感器 内部A43b8"
	],
	"11D614125400": [
		"B1254",
		"故障--驻车定位系统后保险杠 传感器连接 内部A43b9"
	],
	"11D614125500": [
		"B1255",
		"故障--驻车定位系统后保险杠 传感器连接 外部A43b10"
	],
	"11D615000200": [
		"002",
		"故障--中央门锁系统气动需求过高"
	],
	"11D615000300": [
		"003",
		"故障--可收缩行李箱盖锁止机构气动需求过高"
	],
	"11D615000400": [
		"004",
		"故障--调整式后座枕（RHR）/行李箱盖遥控解锁装置（RTR）气动需求过高(收回后座区头枕,行李箱盖)"
	],
	"11D615000500": [
		"005",
		"故障--多仿形座椅气动需求过高"
	],
	"11D615000600": [
		"006",
		"故障--进气歧管增压,真空低"
	],
	"11D615000700": [
		"007",
		"故障--锁1:S86/1,S87/1,S88/2 电阻过高"
	],
	"11D615000800": [
		"008",
		"故障--锁2:S86/1,S87/1,S88/2 电阻过高"
	],
	"11D615000900": [
		"009",
		"故障--收回头枕S52电阻过高"
	],
	"11D615000A00": [
		"010",
		"故障--便捷锁止设备（CLS）车内控制S85 电阻过高"
	],
	"11D615000B00": [
		"011",
		"故障--前部车门触点S17/3,S17/4 电阻过高"
	],
	"11D615000C00": [
		"012",
		"故障--行李箱盖遥控解锁装置（RTR） 遥控释放开关 S15 电阻过高"
	],
	"11D615000D00": [
		"013",
		"故障--旋转锁销开关S88/1 电阻过高"
	],
	"11D615000E00": [
		"014",
		"故障--锁1:S86/1,S87/1,S88/2 有信号 > 2 min"
	],
	"11D615000F00": [
		"015",
		"故障--锁2:S86/1,S87/1,S88/2 有信号 > 2 min"
	],
	"11D615001000": [
		"016",
		"故障--控制中控锁（CL）内部开关S85/5 的导线有信号> 2min"
	],
	"11D615001100": [
		"017",
		"故障--控制调整式后座枕（RHR）内部释放开关S52的导线 有信号>2min"
	],
	"11D615001200": [
		"018",
		"故障--控制行李箱盖遥控解锁装置（RTR）内部释放开关 S15的导线 有信号>2min"
	],
	"11D616000100": [
		"001",
		"故障--控制模块 N2/2 >Ω"
	],
	"11D616000200": [
		"002",
		"故障--辅助乘员保护系统（SRS）安全气囊故障指示灯 A1e15 >Ω"
	],
	"11D616000300": [
		"003",
		"故障--电压过低或过高电路 15R"
	],
	"11D616000400": [
		"004",
		"故障--驾驶员的安全气囊点火电路 >Ω"
	],
	"11D616000500": [
		"005",
		"故障--驾驶员的安全带紧急拉紧器点火电路 >Ω"
	],
	"11D616000600": [
		"006",
		"故障--副驾驶员的安全带紧急拉紧器点火电路 >Ω"
	],
	"11D616000700": [
		"007",
		"故障--副驾驶员的安全气囊点火线路 >Ω"
	],
	"11D616001000": [
		"016",
		"故障--驾驶员的安全带锁扣开关(安全气囊)/安全带拉紧器"
	],
	"11D616001100": [
		"017",
		"故障--副驾驶员的安全带锁扣开关(安全气囊)/安全带拉紧器"
	],
	"11D616001900": [
		"025",
		"故障--前乘客座位占用识别 "
	],
	"11D616001A00": [
		"026",
		"故障--座位占用识别程序出错"
	],
	"11D616001B00": [
		"027",
		"故障--副驾驶员座椅占用识别和儿童座椅识别 B48 >Ω"
	],
	"11D616001C00": [
		"028",
		"故障--座位与儿童座之间的变速箱"
	],
	"11D616001D00": [
		"029",
		"故障--副驾驶员座椅占用识别和儿童座椅识别 B48 编码出错"
	],
	"11D616001F00": [
		"031",
		"故障--副驾驶员座椅占用识别和儿童座椅识别 B48"
	],
	"11D616002300": [
		"035",
		"故障--模拟碰撞输出线路故障"
	],
	"11D617000200": [
		"002",
		"故障--左前电动车窗M10/3关闭或控制模块N57"
	],
	"11D617000300": [
		"003",
		"故障--左前电动车窗M10/3打开或控制模块N57"
	],
	"11D617000400": [
		"004",
		"故障--右前电动车窗M10/4关闭或控制模块N57"
	],
	"11D617000500": [
		"005",
		"故障--右前电动车窗M10/4打开或控制模块N57"
	],
	"11D617000600": [
		"006",
		"故障--左后电动车窗M10/5关闭或控制模块N57"
	],
	"11D617000700": [
		"007",
		"故障--左后电动车窗M10/5打开或控制模块N57"
	],
	"11D617000800": [
		"008",
		"故障--右后电动车窗M10/6关闭或控制模块N57"
	],
	"11D617000900": [
		"009",
		"故障--右后电动车窗M10/6打开或控制模块N57"
	],
	"11D617000A00": [
		"010",
		"故障--左前车窗开关S21/1关闭信号存在时间超过30秒"
	],
	"11D617000B00": [
		"011",
		"故障--左前车窗开关S21/1打开信号存在时间超过30秒"
	],
	"11D617000C00": [
		"012",
		"故障--右前车窗开关S21/2关闭信号存在时间超过30秒"
	],
	"11D617000D00": [
		"013",
		"故障--右前车窗开关S21/2打开信号存在时间超过30秒"
	],
	"11D617000E00": [
		"014",
		"故障--左后车窗开关S21/3，S21/5关闭信号存在时间超过30秒"
	],
	"11D617000F00": [
		"015",
		"故障--左后车窗开关S21/3，S21/5打开信号存在时间超过30秒"
	],
	"11D617001000": [
		"016",
		"故障--右后车窗开关S21/4，S21/6关闭信号存在时间超过30秒"
	],
	"11D617001100": [
		"017",
		"故障--右后车窗开关S21/4，S21/6打开信号存在时间超过30秒"
	],
	"11D617001200": [
		"018",
		"故障--锁止2 S86/1，S87/1，S88/2信号存在时间超过30秒"
	],
	"11D617001300": [
		"019",
		"故障--锁止1 S86/1，S87/1，S88/2信号存在时间超过30秒"
	],
	"11D617001400": [
		"020",
		"故障--左前车窗开关S21/1对地短路"
	],
	"11D617001500": [
		"021",
		"故障--右前车窗开关S21/2对地短路"
	],
	"11D617001600": [
		"022",
		"故障--左后车窗开关S21/3，S21/5对地短路"
	],
	"11D617001700": [
		"023",
		"故障--右后车窗开关S21/4，S21/6对地短路"
	],
	"11D617001800": [
		"024",
		"故障--左前电动车窗M10/3线缆或速度传感器"
	],
	"11D617001900": [
		"025",
		"故障--右前电动车窗M10/4线缆或速度传感器"
	],
	"11D617001A00": [
		"026",
		"故障--左后电动车窗M10/5线缆或速度传感器"
	],
	"11D617001B00": [
		"027",
		"故障--右后电动车窗M10/6线缆或速度传感器"
	],
	"11D617001C00": [
		"028",
		"故障--左前电动车窗M10/3传感器线路混乱"
	],
	"11D617001D00": [
		"029",
		"故障--右前电动车窗M10/4传感器线路混乱"
	],
	"11D617001E00": [
		"030",
		"故障--右前电动车窗M10/5传感器线路混乱"
	],
	"11D617001F00": [
		"031",
		"故障--右后电动车窗M10/6传感器线路混乱"
	],
	"11D617002000": [
		"032",
		"故障--左前电动车窗M10/3速度传感器开路信号"
	],
	"11D617002100": [
		"033",
		"故障--右前电动车窗M10/4速度传感器开路信号"
	],
	"11D617002200": [
		"034",
		"故障--左后电动车窗M10/5速度传感器开路信号"
	],
	"11D617002300": [
		"035",
		"故障--右后电动车窗M10/6速度传感器开路信号"
	],
	"11D617002400": [
		"036",
		"故障--控制单元N57"
	],
	"11D617002500": [
		"037",
		"故障--欠压（低于9伏）端子30E，F4-11"
	],
	"11D617002600": [
		"038",
		"故障--倾斜/滑动式车顶S13/2，M12，N57短路"
	],
	"11D617002700": [
		"039",
		"故障--电源电压端子30 A或控制单元N57"
	],
	"11D617002800": [
		"040",
		"故障--电源电压端子30 B或控制单元N57"
	],
	"11D618000100": [
		"001",
		"故障--No fault stored"
	],
	"11D618000200": [
		"002",
		"故障--1-2 or 4-5 shift solenoid valvecircuit fault"
	],
	"11D618000300": [
		"003",
		"故障--2-3 shift solenoid valve circuit fault"
	],
	"11D618000400": [
		"004",
		"故障--3-4 shift solenoid valve circuit fault"
	],
	"11D618000500": [
		"005",
		"故障--PWM solenoid valve,(connerter lock-up)circuit fault"
	],
	"11D618000600": [
		"006",
		"故障--Pressure regulating solenoid valve circuit fault"
	],
	"11D618000700": [
		"007",
		"故障--Shift pressure regulating solenoid valve circuit fault"
	],
	"11D618000800": [
		"008",
		"故障--R/P lock solenoid,function defective"
	],
	"11D618000900": [
		"009",
		"故障--Cable to starter lock-out relay module function defective"
	],
	"11D618000A00": [
		"010",
		"故障--Supply voltage or valves fault"
	],
	"11D618000B00": [
		"011",
		"故障--Supply voltage or RPM sensors fault"
	],
	"11D618000C00": [
		"012",
		"故障--RPM sensor n2 signal defective"
	],
	"11D618000D00": [
		"013",
		"故障--RPM sensor n3 signal defective"
	],
	"11D618001000": [
		"016",
		"故障--Transmission RPM sensor fault"
	],
	"11D618001200": [
		"018",
		"故障--Selector lever signal incorrect"
	],
	"11D618001300": [
		"019",
		"故障--Trans. oil temp.sensor signal faulty"
	],
	"11D618001400": [
		"020",
		"故障--1. Starter lock-out contact (ASK) no operative 2. Trans. oil temp.sensor defective"
	],
	"11D618001500": [
		"021",
		"故障--Supply voltage (B7)too high or too low"
	],
	"11D618001600": [
		"022",
		"故障--RR wheel speed signal from traction system"
	],
	"11D618001700": [
		"023",
		"故障--RL wheel speed signal from traction system"
	],
	"11D618001800": [
		"024",
		"故障--FR wheel speed signal from traction system"
	],
	"11D618001900": [
		"025",
		"故障--FR wheel speed signal from traction system"
	],
	"11D618001A00": [
		"026",
		"故障--Accelerator position from engine system"
	],
	"11D618001B00": [
		"027",
		"故障--Set torque of engine system faulty"
	],
	"11D618001C00": [
		"028",
		"故障--1. CAN data: Engine torque/left signal incorrect \\n2. CAN data: Eng. RPM signal incorrect"
	],
	"11D618001D00": [
		"029",
		"故障--CAN data: Engine torque/right signal (ME-SFI) incorrect"
	],
	"11D618001E00": [
		"030",
		"故障--CAN data: Altitude factor indicated from Engine incorrect (can be ignored if no relative faults in the Engine system)"
	],
	"11D618001F00": [
		"031",
		"故障--CAN data: Maximum engine torque signal from ME-SFI incorrect"
	],
	"11D618002000": [
		"032",
		"故障--CAN data: Engine torque/left indicated from Engine incorrect"
	],
	"11D618002100": [
		"033",
		"故障--CAN data: Actual value of throttle valve position signal from Engine incorrect"
	],
	"11D618002300": [
		"035",
		"故障--CAN communication fault from engine"
	],
	"11D618002400": [
		"036",
		"故障--CAN data: no engine temperature signal"
	],
	"11D618002500": [
		"037",
		"故障--Fault in entire CAN communication"
	],
	"11D618002600": [
		"038",
		"故障--CAN communication fault in engine system"
	],
	"11D618002700": [
		"039",
		"故障--CAN communicadtion fault in traction control system"
	],
	"11D618002800": [
		"040",
		"故障--CAN communication fault with instrument cluster"
	],
	"11D618002900": [
		"041",
		"故障--CAN communication fault with instrument cluster"
	],
	"11D618003200": [
		"050",
		"故障--RPM n3 too high, external tooth disc carrier"
	],
	"11D618003300": [
		"051",
		"故障--Gear implausible or transmission slipping"
	],
	"11D618003400": [
		"052",
		"故障--Unifit locking by torque converter lock-up clutch(KUB)"
	],
	"11D618003500": [
		"053",
		"故障--Torque converter lock-up clutch(KUB), no operative or locked high Engine speed"
	],
	"11D618003600": [
		"054",
		"故障--No reception feedback signal from trans. protection"
	],
	"11D618003700": [
		"055",
		"故障--Gear comparison incorrect or target gear lever not reach"
	],
	"11D618003800": [
		"056",
		"故障--Tansmission control unit faulty"
	],
	"11D618003900": [
		"057",
		"故障--Control module faulty"
	],
	"11D618003A00": [
		"058",
		"故障--Control module faulty"
	],
	"11D618003B00": [
		"059",
		"故障--Control module faulty"
	],
	"11D618003C00": [
		"060",
		"故障--Control module faulty"
	],
	"11D618003D00": [
		"061",
		"故障--Control module faulty"
	],
	"11D618003E00": [
		"062",
		"故障--Control module faulty"
	],
	"11D618003F00": [
		"063",
		"故障--Control module faulty"
	],
	"11D618004000": [
		"064",
		"故障--Control module faulty"
	],
	"11D618004100": [
		"065",
		"故障--Control module faulty"
	],
	"11D618006200": [
		"098",
		"故障--1-2 or 4-5 shift solenoid valve circuit fault"
	],
	"11D618006300": [
		"099",
		"故障--2-3 shift solenoid valve circuit fault"
	],
	"11D618006400": [
		"100",
		"故障--3-4 shift solenoid valve circuit fault"
	],
	"11D618006500": [
		"101",
		"故障--PWM solenoid valve (torque converter lock-up) circuit fault"
	],
	"11D618006600": [
		"102",
		"故障--Pressure regulating solenoid valve circuit fault"
	],
	"11D618006700": [
		"103",
		"故障--Shift pressure regulating solenoid valve circuit fault"
	],
	"11D618006800": [
		"104",
		"故障--R/P lock solenoid, function defective"
	],
	"11D618006900": [
		"105",
		"故障--Cable to starter lock-out relay module function defective"
	],
	"11D618006A00": [
		"106",
		"故障--Supply voltage or valves fault"
	],
	"11D618006B00": [
		"107",
		"故障--Supply voltage or RPM sensors fault"
	],
	"11D618006C00": [
		"108",
		"故障--RPM sensor n2 signal defective"
	],
	"11D618006D00": [
		"109",
		"故障--RPM sensor n3 signal defective"
	],
	"11D618007000": [
		"112",
		"故障--RPM sensor signal fault"
	],
	"11D618007200": [
		"114",
		"故障--Selector lever signal incorrect"
	],
	"11D618007300": [
		"115",
		"故障--Trans. oil temp. sensor signal defective"
	],
	"11D618007400": [
		"116",
		"故障--1. Starter lock-out contact (ASK) no operative \\n2. Transmision oil temp.sensor"
	],
	"11D618007500": [
		"117",
		"故障--Supply voltage (87) too high or too low"
	],
	"11D618007600": [
		"118",
		"故障--RR wheel speed signal from traction system"
	],
	"11D618007700": [
		"119",
		"故障--RL wheel speed signal from traction system"
	],
	"11D618007800": [
		"120",
		"故障--FR wheel speed signal from traction system"
	],
	"11D618007900": [
		"121",
		"故障--wheel speed signal from traction system"
	],
	"11D618007A00": [
		"122",
		"故障--Accelerator position from engine system"
	],
	"11D618007B00": [
		"123",
		"故障--Accelerator position from engine system"
	],
	"11D618007C00": [
		"124",
		"故障--CAN data: Engine torque/left indicated incorrect"
	],
	"11D618007D00": [
		"125",
		"故障--CAN data: Engine torque/right signal incorrect"
	],
	"11D618007E00": [
		"126",
		"故障--1.CAN data: communi, from Traction control system faulty \\n2.CAN data: Altitude factor indicated from Engine incorrect"
	],
	"11D618007F00": [
		"127",
		"故障--CAN data: Maximum engine torque signal incorrect"
	],
	"11D618008000": [
		"128",
		"故障--CAN data: Engine torque/left indicated incorrect"
	],
	"11D618008100": [
		"129",
		"故障--CAN data: Actual value of throttle valve position indicated from Engine incorrect"
	],
	"11D618008300": [
		"131",
		"故障--CAN communication fault with engine"
	],
	"11D618008400": [
		"132",
		"故障--CAN communication fault from engine, or engine temperature signal"
	],
	"11D618008500": [
		"133",
		"故障--Fault in CAN communication"
	],
	"11D618008600": [
		"134",
		"故障--CAN data :communication fault from traction system"
	],
	"11D618008700": [
		"135",
		"故障--CAN communication fault with engine system"
	],
	"11D618008800": [
		"136",
		"故障--CAN data :communication fault CLUS"
	],
	"11D618008900": [
		"137",
		"故障--CAN data :communication fault CLUS"
	],
	"11D618009200": [
		"146",
		"故障--RPM n3 too high, external tooth disc carrier"
	],
	"11D618009300": [
		"147",
		"故障--Gear implausible or transmission slipping"
	],
	"11D618009400": [
		"148",
		"故障--Unifit locking by torque converter lock-up clutch (KUB)"
	],
	"11D618009500": [
		"149",
		"故障--1. Torque converter lock-up cluth (KUB) No operative or RPM too high"
	],
	"11D618009600": [
		"150",
		"故障--No reception feedback signal from trans. protection"
	],
	"11D618009700": [
		"151",
		"故障--Gear comparison incorrect or target gear lever not reach"
	],
	"11D618009800": [
		"152",
		"故障--Tansmission control unit faulty"
	],
	"11D618009900": [
		"153",
		"故障--Tansmission control unit faulty"
	],
	"11D618009A00": [
		"154",
		"故障--Tansmission control unit faulty"
	],
	"11D618009B00": [
		"155",
		"故障--Tansmission control unit faulty"
	],
	"11D618009C00": [
		"156",
		"故障--Control module faulty"
	],
	"11D618009D00": [
		"157",
		"故障--Control module faulty"
	],
	"11D618009E00": [
		"158",
		"故障--Control module faulty"
	],
	"11D618009F00": [
		"159",
		"故障--Control module faulty"
	],
	"11D61800A000": [
		"160",
		"故障--Control module faulty"
	],
	"11D61800A100": [
		"161",
		"故障--Control module faulty"
	],
	"11D619000000": [
		"000",
		"故障--开路，电路30布防状态"
	],
	"11D619000100": [
		"001",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619000200": [
		"002",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619000300": [
		"003",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619000400": [
		"004",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619000500": [
		"005",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619000600": [
		"006",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619000700": [
		"007",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619000800": [
		"008",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619000900": [
		"009",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619000A00": [
		"010",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619000B00": [
		"011",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619000C00": [
		"012",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619000D00": [
		"013",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619000E00": [
		"014",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619000F00": [
		"015",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619001000": [
		"016",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619001100": [
		"017",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619001200": [
		"018",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619001300": [
		"019",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619001400": [
		"020",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619001500": [
		"021",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619001600": [
		"022",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619001700": [
		"023",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619001800": [
		"024",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619001900": [
		"025",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619001A00": [
		"026",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619001B00": [
		"027",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619001C00": [
		"028",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619001D00": [
		"029",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619001E00": [
		"030",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619001F00": [
		"031",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619002000": [
		"032",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619002100": [
		"033",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619002200": [
		"034",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619002300": [
		"035",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619002400": [
		"036",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619002500": [
		"037",
		"故障--终止执行的条件"
	],
	"11D619002600": [
		"038",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619002700": [
		"039",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619002800": [
		"040",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619002900": [
		"041",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619002A00": [
		"042",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619002B00": [
		"043",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619002C00": [
		"044",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619002D00": [
		"045",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619002E00": [
		"046",
		"故障--控制模块的EFP（电子油门踏板）N4/1"
	],
	"11D619003000": [
		"048",
		"故障--设置电位计数值，电位计监测M16/1r1"
	],
	"11D619003100": [
		"049",
		"故障--电位计实际值M16/1r2"
	],
	"11D619003200": [
		"050",
		"故障--安全触点M16/1s1"
	],
	"11D619003300": [
		"051",
		"故障--怠速安全触点M16/1s2"
	],
	"11D619003400": [
		"052",
		"故障--伺服电机M16/1m1短路"
	],
	"11D619003500": [
		"053",
		"故障--磁性离合器M16/1k1短路"
	],
	"11D619003600": [
		"054",
		"故障--执行器EFP M16/1"
	],
	"11D619003700": [
		"055",
		"故障--重置未执行M16/3"
	],
	"11D619003800": [
		"056",
		"故障--EFP（电子油门踏板）的执行器 M16/1"
	],
	"11D619003900": [
		"057",
		"故障--电位计监测的设定值 M16/1r1"
	],
	"11D619004000": [
		"064",
		"故障--巡航控制开关S40"
	],
	"11D619005000": [
		"080",
		"故障--停止灯S9/1"
	],
	"11D619006000": [
		"096",
		"故障--起动机锁定和倒车灯开关S16/3"
	],
	"11D619006100": [
		"097",
		"故障--离合器踏板开关S40/1"
	],
	"11D619007000": [
		"112",
		"故障--CAN：来自EFP N4/1的传输错误"
	],
	"11D619007100": [
		"113",
		"故障--CAN：无来自ASR N30/1的接收"
	],
	"11D619007300": [
		"115",
		"故障--CAN：无来自LH N3/1的接收"
	],
	"11D619007500": [
		"117",
		"故障--CAN：无来自EZ N1/3的接收"
	],
	"11D619008000": [
		"128",
		"故障--来自ASR N30/1的左前轮速信号"
	],
	"11D619008100": [
		"129",
		"故障--来自ASR N30/1的左前车轮信号"
	],
	"11D619008200": [
		"130",
		"故障--来自ASR N30/1的左前车轮信号"
	],
	"11D619009000": [
		"144",
		"故障--来自ASR N30/1的右前轮速信号"
	],
	"11D61900A000": [
		"160",
		"故障--来自GM N16/1的发动机转速信号"
	],
	"11D61900B000": [
		"176",
		"故障--来自LH N3/1的安全燃油切断开关信号"
	],
	"11D61900B100": [
		"177",
		"故障--来自LH N3/1的怠速识别信号短路"
	],
	"11D61900B200": [
		"178",
		"故障--来自LH N3/1的怠速识别信号开路"
	],
	"11D61900B300": [
		"179",
		"故障--来自LH N3/1的怠速识别信号"
	],
	"11D61900B400": [
		"180",
		"故障--LH N3/1短路时怠速识别信号"
	],
	"11D61900B600": [
		"182",
		"故障--LH N3/1的安全断油信号"
	],
	"11D61900C000": [
		"192",
		"故障--电源电压过压"
	],
	"11D61900C100": [
		"193",
		"故障--供给电压电路87"
	],
	"11D61900E000": [
		"224",
		"故障--怠速触点开关S29/3"
	],
	"11D61900F000": [
		"240",
		"故障--CAN：与ASR交换的数据不可信"
	],
	"11288D000100": [
		"001",
		"故障--No fault stored"
	],
	"11288D000200": [
		"002",
		"故障--1-2 or 4-5 shift solenoid valvecircuit fault"
	],
	"11288D000300": [
		"003",
		"故障--2-3 shift solenoid valve circuit fault"
	],
	"11288D000400": [
		"004",
		"故障--3-4 shift solenoid valve circuit fault"
	],
	"11288D000500": [
		"005",
		"故障--PWM solenoid valve,(connerter lock-up)circuit fault"
	],
	"11288D000600": [
		"006",
		"故障--Pressure regulating solenoid valve circuit fault"
	],
	"11288D000700": [
		"007",
		"故障--Shift pressure regulating solenoid valve circuit fault"
	],
	"11288D000800": [
		"008",
		"故障--R/P lock solenoid,function defective"
	],
	"11288D000900": [
		"009",
		"故障--Cable to starter lock-out relay module function defective"
	],
	"11288D000A00": [
		"010",
		"故障--Supply voltage or valves fault"
	],
	"11288D000B00": [
		"011",
		"故障--Supply voltage or RPM sensors fault"
	],
	"11288D000C00": [
		"012",
		"故障--RPM sensor n2 signal defective"
	],
	"11288D000D00": [
		"013",
		"故障--RPM sensor n3 signal defective"
	],
	"11288D001000": [
		"016",
		"故障--Transmission RPM sensor fault"
	],
	"11288D001200": [
		"018",
		"故障--Selector lever signal incorrect"
	],
	"11288D001300": [
		"019",
		"故障--Trans. oil temp.sensor signal faulty"
	],
	"11288D001400": [
		"020",
		"故障--1. Starter lock-out contact (ASK) no operative 2. Trans. oil temp.sensor defective"
	],
	"11288D001500": [
		"021",
		"故障--Supply voltage (B7)too high or too low"
	],
	"11288D001600": [
		"022",
		"故障--RR wheel speed signal from traction system"
	],
	"11288D001700": [
		"023",
		"故障--RL wheel speed signal from traction system"
	],
	"11288D001800": [
		"024",
		"故障--FR wheel speed signal from traction system"
	],
	"11288D001900": [
		"025",
		"故障--FR wheel speed signal from traction system"
	],
	"11288D001A00": [
		"026",
		"故障--Accelerator position from engine system"
	],
	"11288D001B00": [
		"027",
		"故障--Set torque of engine system faulty"
	],
	"11288D001C00": [
		"028",
		"故障--1. CAN data: Engine torque/left signal incorrect \\n2. CAN data: Eng. RPM signal incorrect"
	],
	"11288D001D00": [
		"029",
		"故障--CAN data: Engine torque/right signal (ME-SFI) incorrect"
	],
	"11288D001E00": [
		"030",
		"故障--CAN data: Altitude factor indicated from Engine incorrect (can be ignored if no relative faults in the Engine system)"
	],
	"11288D001F00": [
		"031",
		"故障--CAN data: Maximum engine torque signal from ME-SFI incorrect"
	],
	"11288D002000": [
		"032",
		"故障--CAN data: Engine torque/left indicated from Engine incorrect"
	],
	"11288D002100": [
		"033",
		"故障--CAN data: Actual value of throttle valve position signal from Engine incorrect"
	],
	"11288D002300": [
		"035",
		"故障--CAN communication fault from engine"
	],
	"11288D002400": [
		"036",
		"故障--CAN data: no engine temperature signal"
	],
	"11288D002500": [
		"037",
		"故障--Fault in entire CAN communication"
	],
	"11288D002600": [
		"038",
		"故障--CAN communication fault in engine system"
	],
	"11288D002700": [
		"039",
		"故障--CAN communicadtion fault in traction control system"
	],
	"11288D002800": [
		"040",
		"故障--CAN communication fault with instrument cluster"
	],
	"11288D002900": [
		"041",
		"故障--CAN communication fault with instrument cluster"
	],
	"11288D003200": [
		"050",
		"故障--RPM n3 too high, external tooth disc carrier"
	],
	"11288D003300": [
		"051",
		"故障--Gear implausible or transmission slipping"
	],
	"11288D003400": [
		"052",
		"故障--Unifit locking by torque converter lock-up clutch(KUB)"
	],
	"11288D003500": [
		"053",
		"故障--Torque converter lock-up clutch(KUB), no operative or locked high Engine speed"
	],
	"11288D003600": [
		"054",
		"故障--No reception feedback signal from trans. protection"
	],
	"11288D003700": [
		"055",
		"故障--Gear comparison incorrect or target gear lever not reach"
	],
	"11288D003800": [
		"056",
		"故障--Tansmission control unit faulty"
	],
	"11288D003900": [
		"057",
		"故障--Control module faulty"
	],
	"11288D003A00": [
		"058",
		"故障--Control module faulty"
	],
	"11288D003B00": [
		"059",
		"故障--Control module faulty"
	],
	"11288D003C00": [
		"060",
		"故障--Control module faulty"
	],
	"11288D003D00": [
		"061",
		"故障--Control module faulty"
	],
	"11288D003E00": [
		"062",
		"故障--Control module faulty"
	],
	"11288D003F00": [
		"063",
		"故障--Control module faulty"
	],
	"11288D004000": [
		"064",
		"故障--Control module faulty"
	],
	"11288D004100": [
		"065",
		"故障--Control module faulty"
	],
	"11288D006200": [
		"098",
		"故障--1-2 or 4-5 shift solenoid valve circuit fault"
	],
	"11288D006300": [
		"099",
		"故障--2-3 shift solenoid valve circuit fault"
	],
	"11288D006400": [
		"100",
		"故障--3-4 shift solenoid valve circuit fault"
	],
	"11288D006500": [
		"101",
		"故障--PWM solenoid valve (torque converter lock-up) circuit fault"
	],
	"11288D006600": [
		"102",
		"故障--Pressure regulating solenoid valve circuit fault"
	],
	"11288D006700": [
		"103",
		"故障--Shift pressure regulating solenoid valve circuit fault"
	],
	"11288D006800": [
		"104",
		"故障--R/P lock solenoid, function defective"
	],
	"11288D006900": [
		"105",
		"故障--Cable to starter lock-out relay module function defective"
	],
	"11288D006A00": [
		"106",
		"故障--Supply voltage or valves fault"
	],
	"11288D006B00": [
		"107",
		"故障--Supply voltage or RPM sensors fault"
	],
	"11288D006C00": [
		"108",
		"故障--RPM sensor n2 signal defective"
	],
	"11288D006D00": [
		"109",
		"故障--RPM sensor n3 signal defective"
	],
	"11288D007000": [
		"112",
		"故障--RPM sensor signal fault"
	],
	"11288D007200": [
		"114",
		"故障--Selector lever signal incorrect"
	],
	"11288D007300": [
		"115",
		"故障--Trans. oil temp. sensor signal defective"
	],
	"11288D007400": [
		"116",
		"故障--1. Starter lock-out contact (ASK) no operative \\n2. Transmision oil temp.sensor"
	],
	"11288D007500": [
		"117",
		"故障--Supply voltage (87) too high or too low"
	],
	"11288D007600": [
		"118",
		"故障--RR wheel speed signal from traction system"
	],
	"11288D007700": [
		"119",
		"故障--RL wheel speed signal from traction system"
	],
	"11288D007800": [
		"120",
		"故障--FR wheel speed signal from traction system"
	],
	"11288D007900": [
		"121",
		"故障--wheel speed signal from traction system"
	],
	"11288D007A00": [
		"122",
		"故障--Accelerator position from engine system"
	],
	"11288D007B00": [
		"123",
		"故障--Accelerator position from engine system"
	],
	"11288D007C00": [
		"124",
		"故障--CAN data: Engine torque/left indicated incorrect"
	],
	"11288D007D00": [
		"125",
		"故障--CAN data: Engine torque/right signal incorrect"
	],
	"11288D007E00": [
		"126",
		"故障--1.CAN data: communi, from Traction control system faulty \\n2.CAN data: Altitude factor indicated from Engine incorrect"
	],
	"11288D007F00": [
		"127",
		"故障--CAN data: Maximum engine torque signal incorrect"
	],
	"11288D008000": [
		"128",
		"故障--CAN data: Engine torque/left indicated incorrect"
	],
	"11288D008100": [
		"129",
		"故障--CAN data: Actual value of throttle valve position indicated from Engine incorrect"
	],
	"11288D008300": [
		"131",
		"故障--CAN communication fault with engine"
	],
	"11288D008400": [
		"132",
		"故障--CAN communication fault from engine, or engine temperature signal"
	],
	"11288D008500": [
		"133",
		"故障--Fault in CAN communication"
	],
	"11288D008600": [
		"134",
		"故障--CAN data :communication fault from traction system"
	],
	"11288D008700": [
		"135",
		"故障--CAN communication fault with engine system"
	],
	"11288D008800": [
		"136",
		"故障--CAN data :communication fault CLUS"
	],
	"11288D008900": [
		"137",
		"故障--CAN data :communication fault CLUS"
	],
	"11288D009200": [
		"146",
		"故障--RPM n3 too high, external tooth disc carrier"
	],
	"11288D009300": [
		"147",
		"故障--Gear implausible or transmission slipping"
	],
	"11288D009400": [
		"148",
		"故障--Unifit locking by torque converter lock-up clutch (KUB)"
	],
	"11288D009500": [
		"149",
		"故障--1. Torque converter lock-up cluth (KUB) No operative or RPM too high"
	],
	"11288D009600": [
		"150",
		"故障--No reception feedback signal from trans. protection"
	],
	"11288D009700": [
		"151",
		"故障--Gear comparison incorrect or target gear lever not reach"
	],
	"11288D009800": [
		"152",
		"故障--Tansmission control unit faulty"
	],
	"11288D009900": [
		"153",
		"故障--Tansmission control unit faulty"
	],
	"11288D009A00": [
		"154",
		"故障--Tansmission control unit faulty"
	],
	"11288D009B00": [
		"155",
		"故障--Tansmission control unit faulty"
	],
	"11288D009C00": [
		"156",
		"故障--Control module faulty"
	],
	"11288D009D00": [
		"157",
		"故障--Control module faulty"
	],
	"11288D009E00": [
		"158",
		"故障--Control module faulty"
	],
	"11288D009F00": [
		"159",
		"故障--Control module faulty"
	],
	"11288D00A000": [
		"160",
		"故障--Control module faulty"
	],
	"11288D00A100": [
		"161",
		"故障--Control module faulty"
	],
	"11D612010000": [
		"P0100",
		"故障--右侧高频空气流量计传感器 (B2/7)"
	],
	"11D612010500": [
		"P0105",
		"故障--右侧压力传感器 (B28/2)"
	],
	"11D612011000": [
		"P0110",
		"故障--右侧进气空气温度传感器 (B17/6)"
	],
	"11D612011500": [
		"P0115",
		"故障--右侧冷却液温度传感器 (B11/10)"
	],
	"11D612012000": [
		"P0120",
		"故障--右调节区实际电位器"
	],
	"11D612013000": [
		"P0130",
		"故障--催化器前面的右氧传感器  (G3/4)"
	],
	"11D612013500": [
		"P0135",
		"故障--催化器加热装置前面的右氧传感器  (G3/4)"
	],
	"11D612013600": [
		"P0136",
		"故障--催化器后面的右氧传感器 (G3/4)"
	],
	"11D612014000": [
		"P0140",
		"故障--催化器老化装置右后氧传感器 (G3/6)"
	],
	"11D612014100": [
		"P0141",
		"故障--催化器右后氧传感器加热装置(G3/6)"
	],
	"11D612015000": [
		"P0150",
		"故障--催化器前面的左氧传感器 (G3/3)"
	],
	"11D612015500": [
		"P0155",
		"故障--催化器前面的左氧传感器加热装置 (G3/3)"
	],
	"11D612015600": [
		"P0156",
		"故障--催化器后面的左氧传感器(G3/5)"
	],
	"11D612016000": [
		"P0160",
		"故障--催化器老化装置左后氧传感器 (G3/5)"
	],
	"11D612016100": [
		"P0161",
		"故障--催化器左后氧传感器加热装置(G3/5)"
	],
	"11D612020100": [
		"P0201",
		"故障--气缸 1 喷油器 (Y62y1)"
	],
	"11D612020200": [
		"P0202",
		"故障--气缸 2 喷油器 (Y62y2)"
	],
	"11D612020300": [
		"P0203",
		"故障--气缸 3 喷油器 (Y62y3)"
	],
	"11D612020400": [
		"P0204",
		"故障--气缸 4 喷油器 (Y62y4)"
	],
	"11D612020500": [
		"P0205",
		"故障--气缸 5 喷油器 (Y62y5)"
	],
	"11D612020600": [
		"P0206",
		"故障--气缸 6 喷油器 (Y62y6)"
	],
	"11D612020700": [
		"P0207",
		"故障--气缸 7 喷油器 (Y62y7)"
	],
	"11D612020800": [
		"P0208",
		"故障--气缸 8 喷油器 (Y62y8)"
	],
	"11D612020900": [
		"P0209",
		"故障--气缸 9 喷油器 (Y62y9)"
	],
	"11D612021000": [
		"P0210",
		"故障--气缸 10 喷油器 (Y62y10)"
	],
	"11D612021100": [
		"P0211",
		"故障--气缸 11 喷油器 (Y62y11)"
	],
	"11D612021200": [
		"P0212",
		"故障--气缸 12 喷油器 (Y62y12)"
	],
	"11D612030000": [
		"P0300B",
		"故障--催化器干扰设备故障"
	],
	"11D612032500": [
		"P0325",
		"故障--右前爆震传感器"
	],
	"11D612033000": [
		"P0330",
		"故障--右后爆震传感器"
	],
	"11D612033500": [
		"P0335",
		"故障--右曲轴位置传感器(L5/5)"
	],
	"11D612034100": [
		"P0341",
		"故障--右凸轮轴霍尔传感器 (B6/3)"
	],
	"11D612041000": [
		"P0410",
		"故障--进气装置误操作"
	],
	"11D612042200": [
		"P0422",
		"故障--右催化器效果过小"
	],
	"11D612043200": [
		"P0432",
		"故障--左催化器效果过小"
	],
	"11D612044000": [
		"P0440",
		"故障--右侧废气再循环装置误操作"
	],
	"11D612044100": [
		"P0441",
		"故障--右侧废气再循环装置误操作"
	],
	"11D612044200": [
		"P0442",
		"故障--燃油蒸发排放系统轻微的泄漏"
	],
	"11D612044300": [
		"P0443",
		"故障--右燃油蒸发排放系统转换阀 (Y58/3)"
	],
	"11D612045000": [
		"P0450",
		"故障--油箱压力传感器(B4/3,R129 B4/4)"
	],
	"11D612045500": [
		"P0455",
		"故障--废气再循环严重泄"
	],
	"11D612046200": [
		"P0462",
		"故障--油箱充电过少"
	],
	"11D612050700": [
		"P0507",
		"故障--怠速调节装置出错"
	],
	"11D612056000": [
		"P0560",
		"故障--右电压调节器(N3/12)"
	],
	"11D612056500": [
		"P0565",
		"故障--测速仪点动开关(S40)"
	],
	"11D612060000": [
		"P0600",
		"故障--电子稳定程序控制器局域网总线技术"
	],
	"11D612060600": [
		"P0606",
		"故障--右控制器 (N3/12)"
	],
	"11D612070000": [
		"P0700",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612070100": [
		"P0701",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612070200": [
		"P0702",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612070300": [
		"P0703",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612070400": [
		"P0704",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612070500": [
		"P0705",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612070600": [
		"P0706",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612070700": [
		"P0707",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612070800": [
		"P0708",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612070900": [
		"P0709",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612071000": [
		"P0710",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612071100": [
		"P0711",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612071200": [
		"P0712",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612071300": [
		"P0713",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612071400": [
		"P0714",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612071500": [
		"P0715",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612071600": [
		"P0716",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612071700": [
		"P0717",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612071800": [
		"P0718",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612071900": [
		"P0719",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612072000": [
		"P0720",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612072100": [
		"P0721",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612072200": [
		"P0722",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612072300": [
		"P0723",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612072400": [
		"P0724",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612072500": [
		"P0725",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612072600": [
		"P0726",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612072700": [
		"P0727",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612072800": [
		"P0728",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612072900": [
		"P0729",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612073000": [
		"P0730",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612073100": [
		"P0731",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612073200": [
		"P0732",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612073300": [
		"P0733",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612073400": [
		"P0734",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612073500": [
		"P0735",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612073600": [
		"P0736",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612073700": [
		"P0737",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612073800": [
		"P0738",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612073900": [
		"P0739",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612074000": [
		"P0740",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612074100": [
		"P0741",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612074200": [
		"P0742",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612074300": [
		"P0743",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612074400": [
		"P0744",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612074500": [
		"P0745",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612074600": [
		"P0746",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612074700": [
		"P0747",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612074800": [
		"P0748",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612074900": [
		"P0749",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612075000": [
		"P0750",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612075100": [
		"P0751",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612075200": [
		"P0752",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612075300": [
		"P0753",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612075400": [
		"P0754",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612075500": [
		"P0755",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612075600": [
		"P0756",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612075700": [
		"P0757",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612075800": [
		"P0758",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612075900": [
		"P0759",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612076000": [
		"P0760",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612076100": [
		"P0761",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612076200": [
		"P0762",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612076300": [
		"P0763",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D612114600": [
		"P1146",
		"故障--左侧高频空气流量计传感器(B2/6)"
	],
	"11D612114700": [
		"P1147",
		"故障--左侧冷却液温度传感器(B11/9)"
	],
	"11D612114800": [
		"P1148",
		"故障--左侧进气温度传感器(B17/5)"
	],
	"11D612114900": [
		"P1149",
		"故障--左压力传感器(B28/1)"
	],
	"11D612116200": [
		"P1162",
		"故障--左调节区实际电位器"
	],
	"11D612116300": [
		"P1163",
		"故障--发动机油控制开关(S43)"
	],
	"11D612117700": [
		"P1177",
		"故障--发动机油温度传感器"
	],
	"11D612130000": [
		"P1300",
		"故障--左曲轴位置传感器(L5/4)"
	],
	"11D612138400": [
		"P1384",
		"故障--左前爆震传感器"
	],
	"11D612138500": [
		"P1385",
		"故障--左后爆震传感器"
	],
	"11D612138600": [
		"P1386",
		"故障--右侧爆震调节控制器(N3/12)"
	],
	"11D612139700": [
		"P1397",
		"故障--左凸轮轴霍尔传感器(B6/2)"
	],
	"11D612142000": [
		"P1420",
		"故障--空气泵转换阀(Y32)"
	],
	"11D612143700": [
		"P1437",
		"故障--右催化器温度传感器(B16/5)"
	],
	"11D612144300": [
		"P1443",
		"故障--左工作连接废气再循环"
	],
	"11D612144400": [
		"P1444",
		"故障--左催化器温度传感器(B16/4)"
	],
	"11D612145300": [
		"P1453",
		"故障--空气泵继电器(K17)"
	],
	"11D612146300": [
		"P1463",
		"故障--左进气装置故障"
	],
	"11D612149000": [
		"P1490",
		"故障--左废气再循环装置转换阀(Y58/2)"
	],
	"11D612151900": [
		"P1519",
		"故障--右侧工作连接凸轮轴控制装置"
	],
	"11D612152200": [
		"P1522",
		"故障--左工作连接凸轮轴控制装置"
	],
	"11D612152500": [
		"P1525",
		"故障--右凸轮轴控制调节装置电磁阀(Y49/2)"
	],
	"11D612153300": [
		"P1533",
		"故障--右凸轮轴控制调节装置电磁阀(Y49/1)"
	],
	"11D612157000": [
		"P1570",
		"故障--右侧FBS及发动机控制器干扰(N3/12)"
	],
	"11D612158000": [
		"P1580",
		"故障--右侧侧调节区(M16/3)"
	],
	"11D612158100": [
		"P1581",
		"故障--左侧调节区(M16/4)"
	],
	"11D612158400": [
		"P1584",
		"故障--刹车灯开关(S9/1)"
	],
	"11D612158700": [
		"P1587",
		"故障--左控制器电压(N3/11)"
	],
	"11D612158800": [
		"P1588",
		"故障--左从FBS 到ME CAN BUS受干扰(N3/11)"
	],
	"11D612158900": [
		"P1589",
		"故障--右侧爆震调节控制器(N3/11)"
	],
	"11D612160500": [
		"P1605",
		"故障--防抱死制动系统转速传感器破损通道识别控制器局域网总线技术加速信号"
	],
	"11D612163200": [
		"P1632",
		"故障--左控制器(N3/11)"
	],
	"11D612164400": [
		"P1644",
		"故障--无法检测到可变变速箱(电压低)"
	],
	"11D612174700": [
		"P1747",
		"故障--电子控制变速器（EGS）控制器局域网总线技术 受到干扰"
	],
	"11D613010000": [
		"P0100",
		"故障--右侧高频空气流量计传感器(B2/7)"
	],
	"11D613010500": [
		"P0105",
		"故障--右侧压力传感器(B28/2)"
	],
	"11D613011000": [
		"P0110",
		"故障--右侧进气温度传感器(B17/6)"
	],
	"11D613011500": [
		"P0115",
		"故障--右侧冷却液温度传感器(B11/10)"
	],
	"11D613012000": [
		"P0120",
		"故障--右侧调节区实际电位器"
	],
	"11D613013000": [
		"P0130",
		"故障--催化器前右氧传感器(G3/4)"
	],
	"11D613013500": [
		"P0135",
		"故障--催化器加热装置前右氧传感器(G3/4)"
	],
	"11D613013600": [
		"P0136",
		"故障--催化器后右氧传感器(G3/4)"
	],
	"11D613014000": [
		"P0140",
		"故障--催化器老化装置后右氧传感器(G3/6)"
	],
	"11D613014100": [
		"P0141",
		"故障--催化器后右氧传感器加热装置(G3/6)"
	],
	"11D613015000": [
		"P0150",
		"故障--催化器前左氧传感器(G3/3)"
	],
	"11D613015500": [
		"P0155",
		"故障--催化器前左氧传感器加热装置(G3/3)"
	],
	"11D613015600": [
		"P0156",
		"故障--催化器后左氧传感器(G3/5)"
	],
	"11D613016000": [
		"P0160",
		"故障--催化器老化装置后左氧传感器(G3/5)"
	],
	"11D613016100": [
		"P0161",
		"故障--催化器后左氧传感器加热装置(G3/5)"
	],
	"11D613020100": [
		"P0201",
		"故障--气缸 1 喷油器 (Y62y1)"
	],
	"11D613020200": [
		"P0202",
		"故障--气缸 2 喷油器 (Y62y2)"
	],
	"11D613020300": [
		"P0203",
		"故障--气缸 3 喷油器 (Y62y3)"
	],
	"11D613020400": [
		"P0204",
		"故障--气缸 4 喷油器 (Y62y4)"
	],
	"11D613020500": [
		"P0205",
		"故障--气缸 5 喷油器 (Y62y5)"
	],
	"11D613020600": [
		"P0206",
		"故障--气缸 6 喷油器 (Y62y6)"
	],
	"11D613020700": [
		"P0207",
		"故障--气缸 7 喷油器 (Y62y7)"
	],
	"11D613020800": [
		"P0208",
		"故障--气缸 8 喷油器 (Y62y8)"
	],
	"11D613020900": [
		"P0209",
		"故障--气缸 9 喷油器 (Y62y9)"
	],
	"11D613021000": [
		"P0210",
		"故障--气缸 10 喷油器 (Y62y10)"
	],
	"11D613021100": [
		"P0211",
		"故障--气缸 11 喷油器 (Y62y11)"
	],
	"11D613021200": [
		"P0212",
		"故障--气缸 12 喷油器 (Y62y12)"
	],
	"11D613030000": [
		"P0300B",
		"故障--催化器干扰设备故障"
	],
	"11D613032500": [
		"P0325",
		"故障--前轮爆震传感器"
	],
	"11D613033000": [
		"P0330",
		"故障--后轮爆震传感器"
	],
	"11D613033500": [
		"P0335",
		"故障--右侧曲轴传感器(L5/5)"
	],
	"11D613034100": [
		"P0341",
		"故障--右侧凸轮轴霍尔传感器(B6/3)"
	],
	"11D613041000": [
		"P0410",
		"故障--进气装置误操作"
	],
	"11D613042200": [
		"P0422",
		"故障--右催化器效果过小"
	],
	"11D613043200": [
		"P0432",
		"故障--左催化器效果过小"
	],
	"11D613044000": [
		"P0440",
		"故障--右废气再循环装置误操作"
	],
	"11D613044100": [
		"P0441",
		"故障--右废气再循环装置误操作"
	],
	"11D613044200": [
		"P0442",
		"故障--燃油蒸发排放系统轻微泄漏"
	],
	"11D613044300": [
		"P0443",
		"故障--右燃油蒸发排放系统转换阀 (Y58/3)"
	],
	"11D613045000": [
		"P0450",
		"故障--油箱压力传感器(B4/3,R129 B4/4)"
	],
	"11D613045500": [
		"P0455",
		"故障--废弃再循环严重泄漏"
	],
	"11D613046200": [
		"P0462",
		"故障--油箱充电过少"
	],
	"11D613050700": [
		"P0507",
		"故障--怠速调节装置出错"
	],
	"11D613056000": [
		"P0560",
		"故障--右调节器电压(N3/12)"
	],
	"11D613056500": [
		"P0565",
		"故障--测速仪点动开关(S40)"
	],
	"11D613060000": [
		"P0600",
		"故障--电子稳定程序控制器局域网总线技术"
	],
	"11D613060600": [
		"P0606",
		"故障--右控制器(N3/12)"
	],
	"11D613070000": [
		"P0700",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613070100": [
		"P0701",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613070200": [
		"P0702",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613070300": [
		"P0703",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613070400": [
		"P0704",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613070500": [
		"P0705",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613070600": [
		"P0706",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613070700": [
		"P0707",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613070800": [
		"P0708",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613070900": [
		"P0709",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613071000": [
		"P0710",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613071100": [
		"P0711",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613071200": [
		"P0712",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613071300": [
		"P0713",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613071400": [
		"P0714",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613071500": [
		"P0715",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613071600": [
		"P0716",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613071700": [
		"P0717",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613071800": [
		"P0718",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613071900": [
		"P0719",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613072000": [
		"P0720",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613072100": [
		"P0721",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613072200": [
		"P0722",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613072300": [
		"P0723",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613072400": [
		"P0724",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613072500": [
		"P0725",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613072600": [
		"P0726",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613072700": [
		"P0727",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613072800": [
		"P0728",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613072900": [
		"P0729",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613073000": [
		"P0730",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613073100": [
		"P0731",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613073200": [
		"P0732",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613073300": [
		"P0733",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613073400": [
		"P0734",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613073500": [
		"P0735",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613073600": [
		"P0736",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613073700": [
		"P0737",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613073800": [
		"P0738",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613073900": [
		"P0739",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613074000": [
		"P0740",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613074100": [
		"P0741",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613074200": [
		"P0742",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613074300": [
		"P0743",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613074400": [
		"P0744",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613074500": [
		"P0745",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613074600": [
		"P0746",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613074700": [
		"P0747",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613074800": [
		"P0748",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613074900": [
		"P0749",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613075000": [
		"P0750",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613075100": [
		"P0751",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613075200": [
		"P0752",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613075300": [
		"P0753",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613075400": [
		"P0754",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613075500": [
		"P0755",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613075600": [
		"P0756",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613075700": [
		"P0757",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613075800": [
		"P0758",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613075900": [
		"P0759",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613076000": [
		"P0760",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613076100": [
		"P0761",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613076200": [
		"P0762",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613076300": [
		"P0763",
		"故障--电子控制变速器（EGS）故障记忆测量值"
	],
	"11D613114600": [
		"P1146",
		"故障--左高频空气流量计传感器(B2/6)"
	],
	"11D613114700": [
		"P1147",
		"故障--左冷却液温度传感器(B11/9)"
	],
	"11D613114800": [
		"P1148",
		"故障--左进气温度传感器(B17/5)"
	],
	"11D613114900": [
		"P1149",
		"故障--左压力传感器(B28/1)"
	],
	"11D613116200": [
		"P1162",
		"故障--左调节区实际电位器"
	],
	"11D613116300": [
		"P1163",
		"故障--发动机油控制开关(S43)"
	],
	"11D613117700": [
		"P1177",
		"故障--发动机油温度传感器"
	],
	"11D613130000": [
		"P1300",
		"故障--左曲轴位置传感器(L5/4)"
	],
	"11D613138400": [
		"P1384",
		"故障--左前爆震传感器"
	],
	"11D613138500": [
		"P1385",
		"故障--左后爆震传感器"
	],
	"11D613138600": [
		"P1386",
		"故障--右删除爆震调节控制器 (N3/12)"
	],
	"11D613139700": [
		"P1397",
		"故障--左凸轮轴霍尔传感器(B6/2)"
	],
	"11D613142000": [
		"P1420",
		"故障--空气泵转换阀(Y32)"
	],
	"11D613143700": [
		"P1437",
		"故障--右催化器温度传感器(B16/5)"
	],
	"11D613144300": [
		"P1443",
		"故障--左工作连接废弃再循环"
	],
	"11D613144400": [
		"P1444",
		"故障--左催化器温度传感器(B16/4)"
	],
	"11D613145300": [
		"P1453",
		"故障--空气泵继电器(K17)"
	],
	"11D613146300": [
		"P1463",
		"故障--左进气装置不激活"
	],
	"11D613149000": [
		"P1490",
		"故障--左废气再循环装置转换阀(Y58/2)"
	],
	"11D613151900": [
		"P1519",
		"故障--右工作连接凸轮轴控制装置"
	],
	"11D613152200": [
		"P1522",
		"故障--左工作连接凸轮轴控制装置"
	],
	"11D613152500": [
		"P1525",
		"故障--右凸轮轴控制调节装置电磁阀(Y49/2)"
	],
	"11D613153300": [
		"P1533",
		"故障--右凸轮轴控制调节装置电磁阀(Y49/1)"
	],
	"11D613157000": [
		"P1570",
		"故障--右FB和发动机控制器受干扰(N3/12)"
	],
	"11D613158000": [
		"P1580",
		"故障--右侧调节区(M16/3)"
	],
	"11D613158100": [
		"P1581",
		"故障--左侧调节区(M16/4)"
	],
	"11D613158400": [
		"P1584",
		"故障--刹车灯开关(S9/1)"
	],
	"11D613158700": [
		"P1587",
		"故障--左侧控制器电压(N3/11)"
	],
	"11D613158800": [
		"P1588",
		"故障--左从FBS到ME CAN BUS受干扰 (N3/11)"
	],
	"11D613158900": [
		"P1589",
		"故障--右侧删除爆震调节控制器(N3/11)"
	],
	"11D613160500": [
		"P1605",
		"故障--防抱死制动系统转速传感器破损通道识别控制器局域网总线技术加速信号"
	],
	"11D613163200": [
		"P1632",
		"故障--左控制器(N3/11)"
	],
	"11D613164400": [
		"P1644",
		"故障--无法检测到可变变速箱(电压低)"
	],
	"11D613174700": [
		"P1747",
		"故障--电子控制变速器（EGS）控制器局域网总线技术受到干扰"
	]
}
